
̮͈!̘̝̕ͅf̵̞̼ͅu͖̫͙n͈̱̥̼̩c̨̠̜t҉̮͔̙̥͎̠̲i̧ò͉̲̳͓ń̟̜̟(è͎̟, ̞ţ)̜̱̠ {
    ̲̺̗̗̞͇͍͡ "̵̦̻̺u͉͓̳s͕̼̝̼e̫͚̗̫̝͈ ̞̥̘̱̙͕ṣ͔̞͈t̶͇̻r̝̼͙i͕̖̻c͖͈̺͎ͅţ̻̤̞" ̵̬̯̱̦̲;
    ̪̲̬̮ "̳̱̲͡o͏̣͙̣̣̙͎͈b̡̥j̮̜̮͇͖ę̳̳c̝̟̬t̳͕" ̥̞̣͚͈̱̝͘ = ̮͕͈̙̗ = ̬͔͚t̟̼̩y͖̗̹̤̖̙̬p̡̬͎͙̜͍eo҉͙̬͖̠̗͇f͎ ̲̤̼͍́m̭͕̲̰̞͇͜o҉̼d̝̫̞̝u̘͈̫l̵̲̘̣͙e̶̳͇̬̺ & ̣̮͚͟ & ̶̻̮͍ͅ "̩̯̺̗͎͙̪o̝b͔̪͇j͈̲͍͈̘e̢͕̜͇̘̝ͅc̳t͙" ̮͢ = ͡ = ̶̥̱͈ͅt͎̻͕͖̰ͅy̧p͙̻̦͎̘͜e͙̳̼͓̠̲̻͞o͎͎f͢ mo̢̦̥̺̝͔̬du͇̙̱̻̺̘̙l̗̞e͇͈̙̳ͅ.̛͖͇̥̮͚͎èx̛̫͎̱̗͙͚p͉̯͇or̹͔̖̗ͅͅt̹̦s̨̠̩͚̦ ? ̟̥̤͎m̶̥̣̮̞̠̤ͅo͏̲̤d̙̙̮u̮͓ḷ̵̭̠̰e̵̬̘̘.̝̪̘̲ęx̻p̙̕o̸̖̼̳r̖̻̯̰̦̞t͉͕͔s̱͔̹͕̣͎̹ = ̢e.̰͔̖̬d̡̗̮̥̫̘o̷̙͚cu̯̱͙̝̩͖m̩͓e̷͕̲̪̖̤ṉ͕̼̟ͅt̪͜ ? ̗̣̜͇̰̯͚t̩(̵̝̼̬̰͉̰e̹̜, ̥̬̺̖̜̻!̰̼̙͓0)͢ͅ : ͔̝̠̳͈ͅf͚̱̰͎ͅṳ́n͈͔̱̣̳ct͔͚i̡̝o͏̥n̗̪͝(e̷̬̮̥͇̤ͅ)̷͔ {
        ̡̮̳͉̭i̴̟͖f̱̩̩͝(̶̺!҉̱̻e̷̟͖̬̤̻̠̭.̱̹͇̣̺ḏ̣̖͞ͅocu̖̮̲ͅm̷̗e̩̭͚n̷̖͚͕̜t̙)͍̖͕̹t̸h̺̦̱͈͚̼ͅr̝̮̖o̳̺̻̲̯̦w̗ ne̝͙͔̯̞ͅw̬͢ ͉̖̻̫͕̣͎E͔̼͟r̻͔̦r̘̠͎̦͕o̩͙r̵͔͓͉͙̩͉͙(̻ "͚͕̩j̩͕̮̘̫̱Q̞̻̩͕̪͞u̻̲̼̙͈̱ͅe̠͙͓̮͈r̛y͓̝̖̻͔͇ ̼̼̗͈͕ͅr͓̙e̶̞͎͎̰͎͍q̷̝̙͚̗̬u͓̣͎̜̲͇i̞̺͈r͕͍̺̯̻̠͍e̸͎͍̝̥̜̺̰ş̹ ̸̳ạ̭̭ ̳͍̲͚w̹̜ͅi̱̺n͟d͙̰̭̪͕͟o̹̠͟w̫͕͞ ͍̦͖w̕i͈͝t͎̜̣̳ẖ͔ ̰̝͍͕͈̭͇a̼̙͍̝͙ ̜̳̮̘̫͈̕d̮̥̱̞̭òc̗̗͎͇ú͕m̺̝̝ͅe̛̦̠̙͇nt̢̻͉̞̰" ̢͔̼̰̬)̟̫̰̩͈;
        ̷̤͔͚ͅr̯et̗͔úr̙̹̜̯̀n̰͔̞͚ ̢̣͉͍̣̳̪̫t͙̬̻͉(͔e̤̯̥͍̩̠)҉͎̙̙͇͕̻̪
    }
    ҉̫͈̪̘͔̺ : ̠̟͖̮̪͍͙t̝̥̳̯͔̙(̙̟̲͖̮͈̬e̩̪̮̥)̩̺
}
̰̜̘́(͚̻̞͖̟̥̭ "̼̲̦̗̲̣u͍͢n҉̝̪ḏ̮͍̲e͚̦͓̩͡f̜͎̝̦̭in҉̗̦̞͚e̗͙̫̳̻͚d̺̰͕͇" ̸̭̟̬͎̯͚!͡ = ̣͚͍͈͓̥ͅṯ̛̤͈͕̰̠͓yp̲͈͔̬͖̝͢ͅe̜͎͍͉̣̦o͕̬̱f ̜̭̦̰̲̞̺wͅi̯̫n̳͉͙d̛o͝ẁ̼̞ ? ̶̭wḭ̢̘̣n̟̳͈d̜̟o̩͓͔̱̩̮̤w̦͉̩͓̫̘ : ̖ţ̫̲̪̭h̡̦̝̥͈̞i͙͚s̹̺͕̰̭, ̲̤͎͈f̵̲͓̘̥̖̦̗u̧̺͔̺nc҉̱t̢̼̮̲i̷on̰͍̯͉̖̫͈(̧̻̭͈̝̮͔C̤̻̗̦, ͚͚̙ͅe͠)̥̗ {
    ͎̰̠͜ "̛͈̭̳u̪̲͓͕͍̭͡s͉͎̯͡e̻̖̝̟̬͎͢ͅ ҉̳̠͖̝̖s͓͓̝̭ͅͅt͉̬̯̞͖̺̗͞r̳ị̲͍̜̤̪̳c̱̭t̢̫̥̣";
    ͜v̷̮͎͈̗͕a̴͎̣͉̦͕̟̣ṛ̝̪̞̰̠ ̧̳t̯̟͝ = ͖͎̹͓[]̧̖̟̗̭̫,
    ̰r͉̤̬̙̪͝ = ̯̮̩Ọ͖̟ͅb͕̮̖̣̺j͚͉̬̟̬̙e͇̠̩͡c̘̣̻̠̬͍͞t͏͖̞͇͚̻͉̜.g͡e͇͇̦̼̩̗t̺̗P̼r̪̖͔̭̤̥ͅo̪͖̼͈͖͉t̛͎͓͖̱̤ͅo̺̰̠t͞y̨p̨̹̱̫͈̳̥e҉͇O̺̟̝̻͚͘f̯̩͜ͅ,
    ̫̗̗̯͢s̞̣͘ = ̟t̛͖̯̼͓.̞s͔l̟̣͓̬̜̘i҉͎̯̥ce̳ͅ,
    ̢̱̝͉̲̺̘̮g̠̲̯ = ̴̯̱͉̩̯͍t҉.̥̙̣͚̟̞̜f̞̭̮̖̗l͎̙a̱̗͜t ? ̪̥̥̬ͅf̘̟̦̠̪̱̠͢ų͓̝̗̝͚̰̳nc̤t̷͙̭̞̻i̼̫̥̠̕o̷͉͕̗̤̼̠͚n̫͔͉̺͎̙͚(̤͙̩̥̯̗̕e͈͙̖͎)̩̦̲̺͎ {
        ̶͕͕̜̺̭r̬̰̘̫̰͈͉e̢̥̦͕̟͓t͚͙̝̦̦͕u̶͙̱͔̪̮͔ṟ͙͔͜n͕̲ͅ ̴͍̰t̸̮.̛͕̝͎f̺̥͇l̬̤̺̲̳͝a̵̱͓̠t͇.̫̲̺̙͎̤c̱͇͉͟a̤͙͙͖̩̫͍l̟̝͙̮̼͎͇l(҉é̤͚)͖̩̣̣̬̜
    }
    ̯̬̙̲͔͟ : ̡̠̗f̗̙u͈̫͔̟n͏̩̖̟c̢͚t͔̳̜̝̥͖͓i͎̻̦ͅơ̖̺̲n̠(͈e͏̝͍͈̪͓̘)̷̜͈͕͙̹̣͖ {
        ̞̠̻̯̻͎ͅr̸͚͇e̛̠̘̞̣̞̳t̗̬u̡r̲͉̖̞̹͔͖n͕̩̭ ̙̮̲̤̠͞t҉̯̭̬̗̼̙.̤̥̻ͅc̶̻̮͖̞͕o̠̭͖̫̘͍̺͞nͅc̵a̷̱͇͕̳̤̲ͅt͡.̡͔̫a̷͙̼p̸͕͍̦͎̻̮̱p̶̣l̡̦̙͎̣͇̠̥y(͓̫͖̰[͙̯̹̬̜͖͚͝]͓̝̤̻, ̡̥͈e͓̩͈̪̳̘͖)̹̼̰͡ͅͅ
    }
    ̟̤̺̦̮̥͡,
    ̲̱̻̦̹̪̘u͚̖̭̝͙ͅ = ̺̙̰̯̤͇͍t͖͍̯̱̩.́p̵̫̯̟u͕̘̬̟̥͙̬͟s̻̳h̟̙̗̦͙̬,
    ͎͉̹̗̘̞̕ͅi͕͈̮̯͡ = ͈̯̲͞t҉͚̫̳̺.̗̮̣i̡̬͓̟̼̗ń̪̥͙d͕̫̟̙̩e͕̖͈͎͕̗x̘O͕f̙͜,
    ̶͔͔̤n̬̫̮ = ̮̯̱̤̭̠͓ {}
    ͏̙͎̻̟̤,
    ̵̣̮͔̮͇̜o = ̻n̹̙.͟t͔̝̦o̴̜S̸̙ṯ̹̺͙r̖̖̥̙̤̜̀ín̼̼g̰͘,
    ̤̼̗͟v̰͖̬ = ̪̱͓͉̼̥͠ͅn̨͉̥̥̠.͙h̖͔̹a͙͔̮͖̭͓s̘̫̪̪̜͙̤O̪̝̹̣̘̙̩w͏͙͓ṉ̸͈P̻̬̹̰̳̟r̘͓o̜̠̯̝͕p̜͈̘̲e̫̳r̵t͍̭͍͈̘y̝͉̺ͅ,
    ̧̲a̸̬ = ̩̭̭̫̗̳̕v̠̜̞̗̮.t͖̜̮̤o̮͕̱S̳̼̳̬̺̙t͔̮̼͇̼̺͕r͔̳̣͈̲͡i̻̲̞̦n̦̖g̡̻̲,
    ̵̤̱̰͉̪̭l̡ = ̻̼̮̀ͅa̩̝.̲̩̫̗̰͓͔c̴̳̙̦̪à̦̲̠̞̦̰l͈̥ͅl̳̖͔̜̘͞(̳̞̹̪̘̣ͅO̺͉̳b̨̟̬ͅj̜̜e̺̙͜ͅͅc̡̭̱t̵̳̮̫͓̠̰̙)̭̹̮̫͕͟,
    ͔̖̠̦̙͖̫y̗͔͔̪̼ = ̝ {
        ̭͠
    }
    ̬̫̯̬̬̺,
    ̷̙̭̫m͈̞ͅ = ͇͔̰̠̗͜f̛̩̪̞̖̼ͅu̝ṇ̪͓̱͢c̢̝̙͔t͎͖́i̮̫̭͇̦o͢n͎̣̤͓̠͍͕(̯̖͉̻e̲͚̖̣̫̠)̴̤͈̭ {
        ̼̩̻̤͉̝r͞e͏̝͙͇t͉̲̺͕͇u̷͓͈̙ŗ̣̦̯̟n͍̙̫͔ "̘͍͓͝fu̱̖̮̩̰͜n͏̘̹̟c̨̮t͎̟̞͖̜̘͎́i̹̹̩̞̰͓̺o̵̘̼̣̫n̤̩͙" ̟͕̙͇͚͚̜ = ̹̼̜̲̮̘͘ = ̸̼̙͕t̸̤̻y̨͔͓̲͉p̯̳̜̺̞͍̦eo̝͟ͅf̯̻̘̦̪̦ ͡e̼̻͕̱̯̘ & ̧̬̱̱̗ & ̸̠ "̶̤̲̻̝̝n̴̺u̟͎͍͓m̤̦͍b̢͎̙̠è̞̝r̮̥͙̮͎" ͓̱̜̹̤!̪̞̮̼͔̠̪ = ̦̦̠̯t͏̩̘͚y̝̭͖̱̼̞p̷e͔̫̜͞o̝͔̻͞f e.͚̳̬̙̙̱͜n̻̝̩o̷̗ḑ̖͇e̥̕T̷̳̙̤y̤͉p̰̝̗̻̩e̡ & ̱̫̳͔͇͠ & ̻̗̭ "̖̱f͓̲͖u͈̦͕̦̞n͍̣̳̮̼̤̪c̶t͉͎͢i̜̱͉̹̳̝o͎͙̤͇̖n̛͚̲̭̗̹̝"!̢͚̱̦̺̼ = ͓̘͔̲̗́ͅt͈͞ype̯̼̟̘͜o̱̭͓͕f ͏͖̪e̪̰͉͢.ị̖̻̰̣tȩm̖͉̳̗̞͙
    }
    ̗̹̼̟̜͠,
    ̗̳̺̱̰̰ͅx̟͠ = ̨͔̯̳̼̤̱f̶u͉̜͎ṇ͢c̳͈t̷͇͕i̵̝̠͔͔ọ͈̥̲̹͈ṉ̪̪͕(̰͖̜ȩ̣̦̬)̕ {
        ͏re̙͔͉t̵̝̘̝ͅų̙̹͖͍͚͚̺r̜̭̙͇̪ͅn̰ ̰̠̹̖̹͚ͅn̢̳̬̺̹ͅu̺̘͖͖̯̹l͍ͅl̸̲̳̳̝̩!̮̳̣̙̬ = ̗̪̟͎͎̗e̻̠͈ & ͖̪̲͎̳̤͉͠ & ͎̞͍e̞͉̻̬ = ̰ == ̰̩͞e̱.̮̦͡w̼̫̝̩͔ͅi̯̭͕̺̮̙͜n̬̝̰͕d̗̪̤̣̗o̢̹̗w̯̞͈̺̩
    }
    ̶̘͕͉̟̻̩̩,
    ͇̣͝E = ̳͎̳̦̲̝C͝.̨͉̝d̯̳͙͇͉͝o҉͓c̟̩̯̪͢u҉m̩̻̳̭̪̥͜ḛ͈͓̟͢n̷͔̖̙t͎͜,
    ̝͓͕̻͓c҉̬̯ͅ = ͈̪͔ {
        ̰͓̤t̷̯͚͍̙͓̻̖y̵p̖͉̲͕͎e̛̜̦͔̰̯̮̹: ̻̞̦̮ͅ!̢͈̠̗͉̖͍0̰̖̝̜̠̳̗̀,
        ̢͇̗s̵̬̝͍̰r̤̫̺͇̣̀c: ̰̮͖̘͔̼!̠̥0͕͞,
        ͍n̛͇̖̝̲̤o̸̥n̤͎̻͇̯c̬̜̤̤̬̱͟e̖͕̘̙̰: ͔̹̻̗!̖0̹̺̱̤̩,
        ̹̘̪̹n̛o̤̞͓̗M̦̮o̗̜̺̦̖̺d̮̲u̵̝͉̬̰l̤̘̯͉͜è̜̣̠͈̼͓͙: ̛̟̩̙!̩̻̭̞͖̙̱0͇͘
    }
    ҉;
    f͙͚̲̪̮͔u̜̱͖̼̕n͏ͅc̰̤̝̦̭̭̹t̖̤͎̞̣i͟ọn͚̩ ̶͚̜͙b͖̟ͅ(̶e, ̷̰t̜̙, ̫͙̰n͎͘)̫̱̣ {
        ̙̜̬̘͘v͍͍a̢̹͕̗͍̯̳r̸͔̱̮̳ͅ ̛̦ͅr̷̠̪̣̦,
        ̨̣̼̼̭͓̬͖i̳,
        ̮o̱͠ = ̖͕͓̙̠͟(̘̻̳n̙̪͔̰̜ͅ = ̙n͏ | ͈̩̟̳͞ | ̰̣͇̪E̘̯͖̥̩)̻̯̙̭̼̼̪̕.̞̝̣̣c͇̺͟r҉̝͎͓̩̘e̡͇͓͔̰à̰̼̘̜̦t̴̟̻͙e͍̩̯͉ͅE̵̪̻̘̜͇ḻ̴̠̝̝̲̟̰e͠m̢͇̳̤̮e̜̳̰n̫͇̱̻͘t̹͔̳͇̺(̯̘̜̞̯ "̲s͚̖̼̘̀c̙̼̮̭̲r̪̥̻i̝̞͉͢p͕̹̼̗t̲̘̲͜" ̻̼)̭͙͕;
        ̵̮̜͙̜̠i̙̯̮̫͟f̬̮̮̱̩(̦o̧̳̱̫̣.͇̜͙͕ṱe͚͇̲̖̤͍̦x͚̹̰͈̪̜̬t̘͎̮͍̝̮̪͢ = ̖̫͇̟ḛ̜, ̷t̮̭̯̪͜)̨f̤̩͔̜̜͞o̱̻r̟̫(̡̳̤̼̤̦̖r̤̠̲͘ ̫̟͖̹͈͡i̯͚̭̼͠n̯̣̗͓̜̜͟ ̷̺͖̜̺c̩̮̮͎)̝̟̦̝̤̰(̬̭̻̫̫i̛̜ = ̳̻͝t̞̘̬̬͎[̙̗͓͠r̩͙̥̗̺̜͠]̛̲̬̺ | ̵̯̮͉̘̱̟ | ̙̼͓̮̦͍͞ͅt̶̩͍̝̭̦ͅ.̝̖͇͠g̭͞e͞t̩A̺͉͚̻͍͓̥ţ̞͉̰͙̻̭̙t̨r̯̭̭̭͉i͏̲̱̖̭̩͕̻b̮̰̘̠͇̲͠u̵̟͖̪̱̺̲ţ̳͕ͅe̷͉̳͖̼̘͚ͅ & ̳̻̀ͅ & ̞̬̩̼̞̳̭t̺͉͜.̢̭g̢̺̞e͇͉͇̣͉ṭ̲̭̰͕̳͟A͟t̫̦̺t͉̼̺r҉̮̰̠i̹̗̥̞̠ͅb̷̞̼̪͇̺̲̺u͖̮̤̦t͓̗͔̱͙͔͙e͓͎(̗̘̻̗̫r̩͚̹)̷̪̻̱̪̘̜)͔͎͎̜̣̟ & ͙͉͔͖͞ & ̨͚̙̼̣o͇̟̜.̛͈͕̱̤̭̪̠s̫̦̼e̞̲͎̗̝̲t͘A̝͇̱͈̳t͖͈͇̘̥ṭ̣̟̯̣̟͙ŕi̤̲b̛͎̺̝͙̖̘̜u͈t͔̖̮̲͚͚̤e͕(̩̱͡r̝̯͚͉̖̘, ̖͜i̹̘̟̜̹͜)͖̙;
        ̠̥͎̗͈͢n҉͓̣̜͍.̟̺͉̰͙̣͡h̫̝é̳̯̞̟̱̺a̯̯̞̘͡ͅd̶̩͔.̠̳̠̺̖̩̫a̢͖͙ͅp̧̹̱̼̳̠͈p̣̭̱̗͠ę̦̪̫̲͎̝n͇̝dC̜h̵i̗̳͕͙̰̩̗l͔͘d̟̗͕̤(̬͍̥̭o̵͔̗̗͈̲̜)͉̜.͈̙͇̜̭pár̭̤en̹͚̣͓͔̯t̴͉N͕͠ơ͔̰͙͍͚̞̖d̺̜̼͞e̖̖̹͖̹͓̙.͇̯̤̜͡r̰̭̼̤̲̞e̩͙͍̻̪̥͓m̨͚̜̗̘͙o̜̥͜v̶̼̰̦e̠̟̥C҉̝͉̹̣̳̼h̰̮̥͈͍̗ͅìl̬̟̟̰̺͔͈d̕(͍͎̜̪̯͓̯̀o͍)̢̼̰̗̹̮
    }
    ̝͖̠f̗̤ụ͉̣nc̟̻̯̭̱̳͘t̛̜̳i̞̬̭̺͟o͏̪̗͔̼̺̯n͍̣ ̧̥̩̥w͖̮̗͢(̦e҉̼̺)̘͘ {
        ͠r̤̺͍è̠͓̝t̯̣͇̥u̷̜̼̗͔̰̳̫r̥̻̞̝̯̯͖n̸͍ ͢n̷̫͈̰u̲̣̰ͅļl̠ = ̱̤̰̙͘ = ͓̻͉͔̟͖e͉̻̠͓ ? ̪̩̜͕̙̺e̦̬̠̟ + ̠̹͉̬̻͟ "̞͕̠͓̣̻ͅ" ̬͔͠ : ͙̟̻̪͜ "̼o͍̮͢bj͓̺͔̱͝e͈͚͚c̼̼̤̹̯͚̘t̨̠͓͚̺̗̼͙" ̺̱ = ̷̗̪͍̳͈̜͉ = ̻̞͕͕̱͘ty̟̭͙͓p̳͚̝̜͠e̼͉̩̺͔͉o̪̺͍͖ͅf̵̳̠͖͇̹̜̯ ̥͚͘e̷̙̠̮͈̪̣ | ̻̭̜̘̜̟͈ | ͈̲̦̠̲̹̲͡ "̵͖̞̤̭̖̩͉f̵̙̭͍͎̱ṵ͖͔̞n̤̦̯͚ͅc̰͈̳̰̤͡t̞̙̺̻̮̮i̭̜̗͔̟̰on̤͝" ͖̜̫ = ͏ = ̠̼̤̙ț̨̫͈̘̤̯y̷̮̝p̼̻͕̼͖͜e̢͕̻o̰f͙̗̀ ̴͖e ? ̝̼͎͝n͉͉̯̥͠[o͉̳̯͈̜.̘̪͇͉c̦͉̠̞a͚̼̞̗l͕͠l̸(̮̙̫e̡̜͉͎̪̟̖)̯͇͈͠]̛̻͕͇̙̘̘̻ | ͏̞ | ̢ "̡o͕bj̴̤̣͙͍͕̩e̯̖͙͎͎͝c̵̦̘̬̻t̠̻̠̼̥̺̺" ̡ : ̴̣̣̤̱t͚̪̖̖͚̖͈͝y̵̯̜͉̥͚p͉̣̪̭̫ͅę̺̩o̜͚͎̦͕̩f̺́ ̹̥̕e̡͖̜̰̞͎̮
    }
    ̡v̩͢a̱̪̙̪̘̟̯͠r̴̰̬̥͓̝͚̤ ͜f̷ = ̴̟͉ "̯̻̠͍̠͘3̮͙͖͇̳̮͡ͅ.̩̤͈̗6̲̻̺̮̗̫̭.̝̻̱͓0̸̻̣" ͔,
    ͈͉̼S̫̱͕͡ = ̯̥̺̬f͍͔͈u̫̻͉̺n̬c̟̫̹t̜́i̦o̶ṉ̡͓͇̳̲̟(͓̹͔͍̫͎͞ȩ̦͉͈̗, ̧̼t̝̮͖̣͓̯)̵̠ {
        ̸r̢e̺͓͎͙͉̹͞t̼̺̬ͅur̬̳̭͇̯̲̹n҉ ̖̙̼͍̠̥̫n̙̳e̞̠̥͇̞̘̹w̡ ͈͜S̼͔̩̘̦̀.̛̜͉̹f̣n̨̠͉͈̦.̞i̷̙̝̻̝̺̰ͅń̫̮͉̖̗̱͕i̵̱̩͕̦͎t̬(̫̱̮͓͖̫e̦͕̺͟, ̛͍t̨)̥̖̟͡ͅͅ
    }
    ͏;
    ͍̙̜͖͎f͈ṷ̱̟̤͕̩̗n̝̺̘̖c̸͓ṭ̪i̵̞͇̲̜͔̥̗o҉͖̹͚̪̥͚͎n̻̖ ̭̲p͙̥(̸̥͚̗̹̟̼̳e͖)͏ {
        ̴̪̺̲v̘̦̤̝a̶̻̜̯̫͈r͚̩̹̰̣ͅͅ ̨͓̝͉͉t̨̺̟ = ̫̱̩̹͚̜̜!͕!̯̟̜̰̼e̩̻ & ̖̦̲̙͕͖͎ & ̛͍̤̦ "͚̟l̞̝̣͈͜e̸ǹ̘̦̬g̫t͇̯̦͚̺͡ͅh͘" ̶̦in̙͘ ̯͈͕͔̙e͖̦̬̦̖͢ & ̮̦̘̪͕̦̼͞ & ̳e̘̼̥̞̠͚̠.̦̩̗ļ̝̺͉͎̠͙̟ȩ̹n͓̻̪̫͈͡gt̬̥͕͕̲̬̘́h̢̜,
        ͉̥̠n̗̞̠̳͞ = ̵w̧̩(̴̗̹̳̤̺͇̪e̝̪̤̘̹͔̻)̵̯͍͕;
        ̬̟̞̙r̺̮͡e̟͇̥͙̬̥͇t̯u͉͕̥̬͉̼̜͝r̠̜̰̜͞n͉̼!̢͓̹̫̠̖̝m̹̮͓̥͍̠ͅ(̖̯͢é̙̩͖̣)̦̳̺̰̳̟̞ & ̛̲ & ̲̞̣̕!͚̣̱̟̤͔͍x͟ͅ(e͔)͙͟ & ̴̹͕ & ͍͓̗̹͚(̮̬̞̜̤̝̪ "̲̪̰̟̯̝͉arr͈a̠y̼̙̯͎̘͜" ̜̤͍̝̣͟ = ̱͙̫ = ͇͙͓̬ = n̶̗̼ | ̦̼͙͕̤̭̦͝ | ̫͇̗̠̬̤0̶̪̱̤̖ = ͙͙̞̣͕͔̺͘ == ̥͓̠̫͞ͅt͕͚̭̺̺̲͖ || ͙̟͝ "̞͝ǹ̠̬̞͕̞u͎̖m̜̠̤̯͈̖b̴͖͍̬̠e̙͚͜r̠" ͖̖̠̜͔̘̲ = ̹̜͇̼́ = ̠t̸̟̟̮y̻̘̰p͓̩̩͔̙e̺̹̙̠o̱̣̯ͅf̴͉͙͓͉̤̥̼ ͎̮̙̖̺͍͡t̟͇͕͖̩͙ͅ & ͈̱ & ̖0͓͖͝ < ̼̮̖̹̝̱ṭ̸̭ & ͍̜̙̣ & ̲̬͎̫t - ͟1̦̤̰͝ͅ į͔̣̳̣̗̲n̗ ͖͚̲͍͙̥e̳̩͇̥ͅͅ)̭̯̞͕̱͟ͅͅ
    }
    ̟̠͓̻S̴̻̙̭̭̜̬̣.͘f̟̀n = ̼͈̰͉͙͔S̻̤̖.̩̠̯̗͙p̸̙͇̱r͖̘͚̙̣̻̳ó̪̟̹̹̣ͅt̵̰͕͔̳̦̟̦ọ̦͙͓͇̮̹t͉̀ͅy̺̠̦̹p̷͈̣e̹͓̖͍͕͔ = {
        ̬͎̩͇̺̘͞j̪͉͕͔̯̞q̙̮͚̗͙͠ͅù͇̟e͢r̴̯y̸̭͍̩̘̥: ̠̗̩̼̪̙f̩̟͠,
        c͙͎o̖͉̘͍n̘̣̦͔̣͍s̩͍̖̕t͜r̲͎̙̞͇uc̛̲̼t̢o̥͚r̞̳̬̫͞: ͏͙S͏,
        ͍̻̖͔̀ḷ̮̖̼̥͎͍e͔͕̤̖̘ͅn͉̣̪͇͖g̴̻͇̯t͉̥̺̟̘͓̕ͅẖ͠: ̙̦͙0͟,
        ̧̹̲͇͔t̹͓͇͖o̪͔̲͕̘ͅḀ̯r̫̝̱̘̙̳r̘͙̦̘͘a̲̥̯͙y͕̗̜͎: ̞̝͚͚̰f̨̼u̗͙͔̺̱ͅn̯͠ç̖̰͔͚̞t̞̣̰̮̖͢i̧̺̤̗̮o̻̥n̲()͉̘̥ {
            ͎͔̀r̻͈͉ͅe͇ţ͕̮̩͖̘̻u̼̙̺̯̘r͏̻̭̗ͅn̮̭ ̣͕̦s͔̫̻̮̙͝.c̺͖̼̩̻̦a̺l̢̝̼͚̙̭l̹̜͖̺̺̗͍(̲̫̥̦͕̲͚t̮͔̠h̨̹̭̙i̜̬̤s̯̭̺̳̪͕̜)̱͍̝͓͇̗͉
        }
        ͓͉̰̤̕,
        ̶g͚̪̙̯̲̰̱e̢̦̬ṱ̭̣͍͍: ͖̫̗̟̯f̙͖ưn̩͈͓͓͘c̖͈̳̫͠t̜̠i͢o̤n̪̩̘̗̙̕(͓̥̘̤ͅe̛̩)̱̯̦͙̮̝̲ {
            ͖̺̗͇̟̩r͇̻e͍̹t̪͚̳ụ̘̣̦̠͇̭r̝͕ͅn̶̺̪͍̭̖͚ ͞n͎̮̪̩̰͎͇͡ư͔̖̜͇̼l̥̥l̙͖̳͉ = ̜͉͔͚̙͕ͅ = ͈̜͉͉̦̦̀e͉̜͠ ? ̨̫͉͙̖s̴̜̠͕.̛͇̠̞͙̹̮c̗̰a̩̜̰̤͇l͈͍l̯̯̳̙̗(̦͝t̙̫̦̣͖h̲̟͚̘̕i͍̯̬͔s҉̠̪̟̩̖̜͇)͏̯̩ : ̹̦͘e̠̜̣͎ < ̖̙̣̦͔͎̮͜0̨̮͎̤̗͈͖ ? ̛̠̪̞̥ț̖̠͎hi̙̝s͔̘̻̀[̠̮̕e͓̻͝ + ṯ͔̼h̲͕̺i̩͇̮̘̱s̙͚̣̰̘͉.̞̟l̼̝̯̀e̡͓̩̞̦͙̪̱n̬͡g͈̘̰͙̫̝t̗͖̠̻̖ͅh͠]̺̣ : ̯̗̬̻͢ţ̰̭̲̜̖hͅi̞̯̭̞̫̬s̨[̳̟̻̮̬̘ḛ̞̫̥̫]̷̦͙̘͔̼̮ͅ
        }
        ̮̻͔̫̮,
        ̯̻̼̗͍̪p̥̝̳͔̳̳͘u̥̳͎͔̹s̝͕͇hS̠̩͘t͙̮a͎͉̯̠͇c͕͙k̫̞̫̼̝͖͜ͅ: ̬̹f̶̙̟̪̮͖ͅu̢̗̜̟̬̘͕̼n҉̙̱̝͔̰c̜͔̫͇͉ṱ̵i͉̟̠̞͍o̧̳̠̳͙n̺(͖͔̖̯͎͜ͅe̥̠̫̺͠)͕̗ {
            ̭̥̹̗̭̝̖va̪̬͘r̺͚͈̟̘̬̖ ̻̪̝t̛̝ = ̞͕̱͉̬ͅȘ̟.̟m͔̗̕e̩̜͕̺r̜̺͍̯̣̙͓͞g̭͉̮̖e҉̟͎̲(̨͚̤͖t̥h͈ị̹̪͡s̘̜̼̖̖̲͎͠.̨c͚o̵̹̲͈̩n̠͍̦͡ș̮̠̙ṯ̙̖̱͡r҉͖͉̺̫̻u̫̝̬͈͚̭̩͞c̟͚̠͕ṱ͍͎͎̕o̤̬͍̮̞͙ͅr̲̹̰̳̤̼̤(̟̝̟̟̗)̱̯, ̼̠̲e̛̻͔)̫͙̣̻͓̭̕;
            ̣͎r̴̫͇̥̳é̪̙̘t̞͇úr̮̲̜n̠ ̝̪̝͎̜ͅͅt̗.̜̫ͅp̫̫r͏̰e̵͇̠̗ͅv̫̙̠͖͓O̤͍̼̼bj̲̫̘̦̭̘̲e̮͈͡c̲̤t̨͓͙ = ͎͈̬̝͚̜͍t̢̥h̡̘͙̰̳͍ͅi͖ş̣͉͙,
            ͍͇͜ͅt̬̰
        }
        ͈̩͇,
        ͕͙͕̰̻̙͔͠e̪̩͉̗ach̤̙͙: ͞f̦u̙̫͎̯n̦̠̻̬̦̲c͍̜̯̰̭̭t̲̠̜̬̥̖͠i̙̪̪͍̟̰͘o͔̼͢ṋ̖̫̱(͖͢e͇̣͈͢) {
            ͓͇͕͍̼̮r̬̮̬e̦t̫̦̯̤̟̤u͇̭͉̼͈rņ͙ ̪̬ͅͅS̪̙͓͙.̫̭̝̬͍̫͘e̹̣̦̫a̞̝͜c̲͓͍͓̪ḩ(̼̹̙͜t̝̭̗̮̥͍h͈̙̭̣̣̙i͏͍̙͉͔̝̘s̡̰, ͕ẹ̢)̞
        }
        ̼̤͎̀,
        ̗̹̬͔̫ṃ̢͙͇̺̩̳̠a̞p̸̬̫̮̫̲: ̝͖͕̮͘ͅf̤̣̠̺u̗n̯̟̤̟͢ct̡i͈͚̳̩̦̩̺o̦̫̼̻̤̥n̢̟̜̞͉̱(̗͉̫̱̼͇͈n̛̹̗͖)͎̪̬̕ {
            ͖͓r͇͉̫̠e̶͓̣̻͈t̩̜̟ͅu̬̼̖͍ͅr̦̥̯͟ͅͅņ̖͈̜̼͓̟̮ ̥̪̦͍̙̮̝͢t͡h̟̹̘i̩͉͘s.̠͚͍͔̟̭p̫̻̭̻͙͎̳͝u̙̦͕͚̘̱̲s͍h͏̬̣̪͔̥̮͎S͖t͍̥̲̦͚͖a̡c̭̺̙͈̬̝̣͞k̸̭̳̘(̠̪S̶̠̥̮̝͔̲.̜͔͙m҉̺̠̟̥͎̖̥a̺̻̺͕̖̠̬p͇͕͜(̪̻t̶̝̝̺͇̤̖h̹͕͉͈̘͓̤͡i̳͟s̥̦, ͕̠̺͉̦̣͟f̶̮u̮̤͉͝n̵̳̠̻̺̜͖ͅc̛͔͚̻ͅͅt͓i̬o͎̪͙͔͔n̙(̦̲̞̞̗͓͜e̸̬̳̯͔, ̺̪̰͍͢ͅt̖̗̬͢)͎̬̪̣ {
                    ̯̺̻̙ṛ̴̝̣̩̬̗e̡̻͇͓t͢u̻̰̮̲͝r̷̭͇̤̪̯͔̠n͓̦̼ ͕͉̲̪͉̪͔n̳̳͇.̳̯͚͉͇̦̮c̨̠̼a͇̮̰͘ḻ͈̼̳̳̖͓͘l̮̼͍̙̬͡(̧͎͎e͏͖͙͙, ̟͚͍͝t̙, ̪̱̩̯͝e̷̲̮)̸̦̬̲̝ͅ
                }
                    ̗͍̘̰̥̱͚)͎͈͇̰)̧̯͍̖̤̻
        }
        ̤,
        ͚̟̪͇̥s̖̠̞̹̺̣̕l̻̯̪͎͡ͅi̟̘̝̜̣c̣̞ͅe͕͈̭̝̫̰͝ͅ: ͔̱̥̼͖̰̫fu̜̯̫n̺̮̪̥͔͍c҉̘̖̼̻͈t͍̩̬̹̠i̷̱̦͔͈̰͍̘o̧̻̞͈͙͙͎n̼͇͕͉̭(̦̗̲)̪͍̳ {
            ́r̡e̸̹͕͚̘̙̖̙t͚͎̙͕̞͞u͇̝̖̝rn͙̫̳͈ͅ ̢t҉̖̻͖͔̫̺h͕͖̻͇̝͈́ì̦̬͈̳s͈.̤̥͈̩͡ͅp̦u̲̪̜͖͘sh̪͜S͚̰̠̩̝̫t͙̮̦͖a̗͓͙̝̟̬͜c͓̫̝̙̖̪̠͡k͔̯(̕ś̰̭.͔̥̝̺̞͝a̸͙͎̣̞̣͖͕pp̼̜̰͇͟l̗̜̙y̪̲(t͜h̳̩̪i̳s͏̫̹̦̙, a̢̫̮̠͓̭͙͖r͇̬͉gu̯m҉͓̱͓e̬̩̕n͕͍̣̟̖̣̦͘t̠̦͜s̰)̘̺)҉
        }
        ̖̠͚̟,
        f̷̺i̜r̴̝s̫̥͚̹t͕̗̫̭: ̢̙̤f͕̲͝u͕̭ṇ̢̖͇̼̖̝̫ct̺̕i̸̭̫̥̦̙o̠n͖̰̬͓(͍̭͙̕)͕͓̩̝̫̼̦ {
            r̫̟̳̘͈ͅe҉̫̟̙̤̩̲̰t̥̟̣̹̰̫̻u̠͔ṛ̣̠͕̯̟̜͝n̗̟͇ ͔͞t̵̰̦̱̻h͍͡i͖̝s̯.͖̲̘̤͉e͕̟͙͡q̖̬̩͚͠(̘̠̥͟0͈̟͓̰͖)͉͈͔͢
        }
        ̙͕̟͖̮̯,
        ̢l̗͇̦̠̺̖̻a̗͍̤̖̥͇͟st̝̗̲̺̙̭̮: ̬̺̻f̺͉̙͔̙u̡̱̣̰͖̰̰n͍̭̗c̳͔̳̬̭͉͓t̷̰̙̪͔i͚̫ò̩ͅn̰̩̠͢(̹͖͈̲) {
            ̛r̛̥e͎̻t̳̹̲̜u̶̻͓͕̜̱̩r͎͚n̥͔̘̲͉̺͜ͅ ̣̮͔̲̬̻͙t̫̹͔͉͞h̨̙̞i̶̫s̙̻͖̞͈.͚̠͉͚̠̟͇͞e̲̮̪̯q͇͢ͅ(͚̙ - ̤1̠͙͙̦͇̞̯)̤̬
        }
        ҉̦̹͖,
        ͓͔̭è͉̟̯̬̣̤ͅv̨͚̟en̵̳̮: ͔͉̮̱̫f͓͢u҉̲̟̱͕̹̜n̰̻̯̺͎c̹͇ti͙͉̲̯o͕̪͕̝̩͘n̟̬͎̲(̡̮̹͓̳)̞̟̯̖̱ͅ {
            ̰̙rȩ͓͎̘͓ṱ͕̖̻͞u̢͉̞̹r͏̯ń̬͍̪͓̣͓̤ ț̭̟h̲̙͇͖͚͕͡i̙͚͎̲͔̦s̯͎͙̹̞͢.͈̯̝̥͞p̞͇̣̻͠ù̥͈̲̥̖s̵̬͓h̝̫͉͎̺̫̠S͕t̝͚̙a̘̻̭̰͞c̴̼͚̠͓͍͔ͅk͈͟(̗̘̳̰̪S̠̬͖̰̥̗.g̖̫̲̪̼̭̖̀r̥̜̖͈e͔̟p͔̭(̘͓͇t̕ḥ̴i͉̺̖̟̙s̛̗̲͎̳̯ͅ, ̴̠͉̖̠̠ͅf̥̭̱͉̠͕u̱̳n҉̳̜̯c͖͉͞t̢̳̰͈̦ì̬o̷̙̜̤n̗̜̝͕̜(͠e҉̱̼̤͉̖͉̲, t҉̰̮)̲̦̱̱͈̹̖ {
                    ̦̗̣̠ͅr҉͍̤e͜t̜̯͚͟u̠͈͉̖͈͕͈r̸̟̙͙͇̼̬ṇ̟̟̰͈̫̗(t̀ + ̨̘1̶͈̞) % ̮̭̖͉̳͉̞͟2͏͈̳̭͖̗̞
                }
                    ̱̤̖͍̦͍̘)͍̰͈̩̻)̘̜͔̜
        }
        ͚̭,
        ̷od͔̜̜d͈̞̦̩͞: ̻͉͈ͅͅf̼̻̮̣̩̖͖̀u̧n̰̣c̝̣̭̤ti̷̟̻̫o̷̝n̠̜͔͉͞(̠̙̭̘͍̤͝)͇̹ {
            ̸r͏̤e̵̟͉͍t̲̲u̲̭̤r̻n͕͍͓͇͉̦ ̖̖̕t̨̗̤h̖͕͎̘͔i̡̺̞͙s̷̭̼̺.̨̣͕̙͎p̗̥͕͖̹͔u̘͎̳̥̼̬̜s͔͚̫̖͙͜h̨Sta̪̳̺͡c̘̩̜͖̖̲k͙̹̬̘ͅ(̘̱̫̻͕̤͝S̶͍̳͕̳.̱ǵ̬͈̰̜̥̞r̯͎̗͈͚e̮͍̯p̕(̺̰̕t͓͖͚̲̻h̴͙i͈̞̱̩͚͡s͎͈͡, ͉͠f͚͓̼ͅṵ̶̗̯n͍̞̳̟c̹̼͖ͅt̝̠͖̙i̦̲̣̫̟̝͠o̻͝n̢̤̯̗̲̣̙(͕̠e͚͜, ̩͚t̙̫͚̜)̝͙͇̭ {
                    ̻̝͝r͔ȩ̥͙̩t̰̤̰̰͙͕̠ú̫̗͎͇͖r͏̲̩̥ͅn͔͢ ̬̗̣̮̤͢t̵͕̤͚̖ % ̝̖̜̥2̢
                }
                    ͎̟̗)̨̞̮̦̮)̕
        }
        ̡̭͙,
        ̼̠ͅe̷̫͉q̛̺͉: ͓̞ͅf͉͇̥́u͢n̡̪̼̮͕͎̩c̲̻̫̭͕̼t̲̺͙̞̮͖i̟o҉̺̘̠͙̞͉ͅn̯͔̤̰͍̖(̩͉͓͎̗̥͙e̶̦̲͔̙̙ͅ)̞͇͖͕̙̦͟ {
            ͈͖͜v̠̜́a̜̙r̷͔̹ ̴t̸͔̮͙̝ = th̛̝̝̤͎̣̞ͅi̟͙̠̲͓ś͎̺.̱͖͕͕̹̻l̼͕̝̘͖͔̳e̬̫̫n̲͕̥̰̤͓͎g̟̯̠̳̺̳t̷̺͇̞h̡̗̞̝,
            ̳͎̩̺̣͜n̡̦ = ̬̼̟̣̥ + ̻͙̱͇͍͟e̹̭̱̤͡ + ̼̘̗̪͖̬̻(̭̜͝e͚̞̪͖̣̫͔͘ < ͚̠̱̦͞0̫͍ ? ̭̪̤͖͉̙̜̀t̬̦͕͔͓ : ̸͚̖͇̮0͖͍̩̲);
            ̷̟̱r̷̪̥͓͙e̹͈̝͔̟̕t͙u͏̗̠̻͕̬̭ͅr͎n͙̪͔̺ ̥͙̗t̵̪̯̭̦̤̩͍h̶̺̠̝̩̣̼ͅi͓͓̻̖̯̩s͇.͎̤͙͟p̝͇̯u͖̟̟͙̦s̠̩͓̲̣͖͎͠h͏̙S̠̥͠t̥̖á̻̖̟͈̞c͉̺͚̤̠̰̬̀k̰̪͚͞(̷̫̯̗͎͚͇0̙̪ < ̵ = ͇n̖ & ̭̖̻̲͚̜ & ̞̜̪͓̯̼̼n̖̙͉ < ͎̰͚t̘̭͔̩̜̠̘ ? ̯̰͠[̡̯̹̤̰t̳͉̺͚̠̕ͅͅh͔i͈̩̳s̸[͚̤͙̞n̻̹̱̖̣]̷͉]̴̞̮͎̳̲ : ͏͎[̢]̭̰̯͖̬̺͜)̮̝̝̩̯
        }
        ̥,
        ̸̙̺e̢̘̹̙̙̬n̢͔͙̫̜̱d̟̯: ̜͎f̛̪̺̮̼ͅͅunc҉̱t͡io̦̺͡n̼̜͖(͖͓)̸̲̥ {
            ̟̤͙͎͞ͅr̤͈̯̬e̢̞̥̮̥̤͓t̛̳̖̳̮͕̺ͅṵ͚͓̺̠r͉̜͍̞͎͜ņ̣͙ ̥̣͓̮̣t̗͍͚̹̣͘h̘̠i̭͇̺̬͕̤s͉̮̝̬.̡̹p͔̘̱̯̭r̞͘e͏̱̱͔͔v̺̲̮O̟b̗̤̙̣̲̰j̲̜̪̝͈e͉̠͙c͍̖̤̘͠t͖̠̹̥̫ || ̮̠͚̠̼t̴͖͓̥̠h̛̠͖̘̤ḭ̢̟̫͓̭̤s̥̱̰̫.͍̼̮̼̹̖̜c͏o̘̬̼̦̖ͅn̟͍s̨̩̭̖͈tr͙̙u̢͔̰͉̠c̪ṭ̩͖̤͞o̩r̘̜̻(̨̹̠͈)
        }
        ̧̲͖ͅ,
        ̟p͏͙͙̜̰̹̣͖ụ̬̖̩̟s͞ḥ͎̝̹̜̪: ̦͘u,
        ̛̱̗̘̮so̧̙̻͈̗̻̠͖rt͉̺̜͚̩̩̜̕: ̵͚̺̮̦͕̠͍t̸̝.̰̱̖̺͍s̳͈o͎̰͓̭̘̭̲͝r͚̮̬t̗̰̥,
        ̢͔̦͇̫̞͇͈s̼̹̫p̯͙͎̤̕l̶̞̗͎͎i̠̫̱̣ć̞͖̜̦̹̲̟e̫̫̞̣͡: ͔ͅt̞.͉̺̜s̸̼p̨l̵̜͚i̷̳c̗̘̯ͅe̮̺̣
    }
    ̯̰̖̩̩͎͡,
    ̸̰̫̠͎S̹̥̩̠̀ͅ.e̲͔͔͎x̫̱͉̬͇t͔̩̰e͖̪͕̜n̷̰̻͈ͅd̼͔̜͎̹͓̭ = ̦̣̘̰̞͞S.͉f͕̹̯̻͢n͚̪̗̗̥.̝͈e̞̮̙̩x̵t͔̬̮̦e͙̕n̲d̝̩͚͢ = ̙̻͎̣̘f͔̹̻̜ṳ͈̼̫n̷c͟t̶̞͇̟̹̙i͕̜̯̳̼͈͍o͈̻̟̝̺͙n̴̮͓̘(̦)̡̱̳͈͈͎̞͕ {
        ̧̫̝̗v͔̫͡a̦̱͇̖̫̜͇͘r͍̤̀ ͓͙̘̦̥͎̫e̖̗̳̺̬̝̕,
        ̺̪̝̬͓t͕̜͇̺̯̭̪͟,
        ̬̝͍ͅn̟̱̘̬̩̺̦,
        ̫̺͎̰̠̖̫̀r̳̖͔,
        ̷͈̳i̢ͅ,
        ҉̮̩̺̣o̮̖̥͍̹̞͜,
        ̕a҉̖̭ = ̢a̧̼͓r̙̱g͕̰̳̤̮̞͕um̳̜͖̯̱͝ḙ͔̹͙͜ͅn̡̘ţ͎̪͕̳̝̥s̻͎̲̗[͚͚̙̼̮0̲͙͕͎̠̱͡ͅ]̛̫̼ | ̱͝ | ̣͈̖͝ {
            ̫̟͎̞
        }
        ̲͓͔͈̼̙̯,
        ̙̤̯̙̪̪͞s̭̦͉̝̠̙͘ = ̶̰1͍͉̙̠͕̹̱,
        ̵͍͚̝̪u͓̜̹͔͎͚͞ͅ = ̜a͇͖̰͎͇̟ͅṟ̢̦ǵ̱̞͔̻͎͙ͅṷ̣̮͚̰m̡̼̲̜ẹ͇̮̣n̯̩̣͎̥͡t̢̮̝̳̲s͈̘̞̠͚͙͔.̛̙̱l̯͕̥͡eņ̰̘̞̮̘̣g͉t̝ͅh͕͈,
        ͍̥̞͓̖̮͞l͏ = ̹̮͖̻!̜̱1̥̮̣͎̱̘;
        ̮̟́f̤͔̞͈̫o̲̭̜͕ṛ̦̬͈̳̩(͍̩̦͕̥͘ "͔̬̕b̧̼̬ͅo̗o͙̠̕l̳̭̦̮̮̕e҉͚͎a͎̞̳̥̰̭n̹͉͍̳̙̠" ̶͕͙̥͚͕̥ͅ = ̬̘̝͓̥̖ = ̣̺̖͈͞ty̡p̱̼͇͟e̙͎̟͎o̥̥̳͔̱̣͜f̤͔͡ a̭̖͉̬̮ & ̺̣̤̱ & ̪̭̲̤̫͍̘(͎̩͚l̺͜ = ̧͓a̝̜͓̘̪͙͝, ̣a͎ = ̙͙̥̰͜ár̛g̺̹͍u̶me̲̼̳̰n̮̺̗t̬͕̹̦̠͍̻͞s̶͔̼̠̪̜͖̳[s̯̤̬̲̭̖̬̀]̝͇̟͜ | ̻̫̱̦͜ | ̻ {
                        ̡̰
                    }
                    ̱͎͍, ̷͓͔̭s͏̩ + ͎̫̥̻͟ + ̝̙)̦̜̹, ̜͢ "͓̭̻͈͢o͓̫̫͖͚̬̟͞b̥̺͙͔͈̬̝͘j̰̫͔͇̳͓̮̀e͔̹͡c̺͖̱t̮͙͞" ҉͍̝ = ̪̩͟ = ̸͉͉̰̼t͓͝ͅy̦̝̞̱͓p̛̖͍̤͍̹e͠o͉̥̗̯̖̠̬f̡͕̼͓͇ ̜͍a̤̲̤ | ͍͇͜ | ̷̼̟̺m̭͕͔̘͚(̯a̬̙̮͍̤͈͞ͅ)̭̘ | ̦̯̟̖ | ̺(͏͕̝̫̻a̠̹̪ = {
                        ̻̥
                    }
                    ̬̲͉͉̘͕̪͞)͔̼̮͚̠͞, ͕̬͔͇͇͉͓s͇̀ = ̝̯ = ̩͎̗̲̠̥ = ̯̱̣͕͔u̫͚̰̫͟ & ̺̟ & ̱͓̩(̭̞̺͎̙̫a̻̺̺̱͔̰̭͢ = ̦̱ͅt̵̘̙̙ͅh̫͠i͝ṣ̪̼͜, ̦̗̫͖͍̝́s̷͚̝ - ̯̦̟̹ - ̜̰͉̘)͏̦; ͖͠s̫͔͎̰͖͉͝ < ̫ų͎̱; ̟̼̀ṣ͕̬̟͘ + ̫̬̳ + ̢͖̜̣̪̻̞͚)͏̫̗̬͈i͚f̴̠̯͎͇͉(̝̫̦͝nu͉̺̻̪͉̺l̙͖̟̯̼̳̭l̛͔̥!͙̠͓ = ͈͖͕͇̦͍(̝̙̩̗e͇͍ = ̹̙̲̕a̳͇͔̯͞ͅr̗̰͖̩gư̖̠m̹̩̣̣ͅe̢̳̱̹n̴̻̘̯̱̙̥̟t͈̞͍̬̘̭s҉̻[͈̜̙̣͚̻̜s̬̱͎̞]̴̬̗̯)̭̘͙͙͢)̝̮̳̥̙̖f̮̙o̤͎̲̻͖̰r̖(̷̥t̬͕͔̮̭͈͍ ̧͈͙͔̻̘̦i̶̻͇͓n̺̩͖͚̬͞ͅ ̸̯̩̪̫͈͓͓e̖͍ͅ)̦͙̩̝͚͜r̡̘͈ͅ = ̗̣̳̘̘͈̜͘e͔͕͓̭͇̻[͈̹̤̪̩͠t̬̠̲͞]̫͔̫̪,
        ̼̫̤̜ "͓͟_͓̭̦̰̗ͅͅ_p̟͙͍͖̫̘r͎̫͈̠o̞͓̬t͚̣͉̭̦ơ̭̦̬̙̰̫_̸͙_͇̩͓̬̘͙" ̻̟!̜̩̼̪̲̠̬ == t͏̰̹̗̗͓͇̦ & ͙̤͙̭͉̮ & ͚a͝!̵̱ = ̖̻̰̺̲͓͔ = ͚̤̝̝̭̮̣r͙̭͉̞ & ̹͖̯̫̼͘ & ͕̼̩̰͔̳̣(̳͖̠̘͈̠l͍̪̕ & ̨̘ & ̧̘̰ṟ̩̙̭̹͙ & ̮͈ & ͜(̞̺̜̯S.͎̠i̜̬̟̬͘sPl͡a͢i̝̤͘n̪͉̳͙O̕b̵j̙̮̖̭̝̰͘ḛ̜̩̰͈͢c̪̻̼̝̙t̫͇(̼̣̺̠̜r)̭̰̠̬̣͠ | ̞̜̜͢ | ͖(̣̯͖̙͉̻͓i̭̗ = ̯̭͚͡A̤̭͔̱̝͜r͉r̖̟̻̥̞a͈̳̰̹̣̬y̫.͓͍̘͉̤̲̜͢i҉̰̟s̭̟A̟͉̥̭͉͖̰r̙̞͈̹̹͉r̫̹͙̟͞a̵̞̮y͚̱͖(̪̳͓̙̖̳r̜̭̻)̣)̯͡)̥̻̯̩̹̖ ? ̡̩͍͉̞̳(̬̻̗̰̙͜n̝̹̮͡ = ̧̻a̢̜ͅ[̯t̹̗̫]͔, ̠̤̰̰͇̜͓̀o̺ = ̦͓̣̞͕̹i & ̻̳̰̱́ & ̧!̹A͙̣̠͔͡r̥̝̩̰͖͔̮r̰̩̣̫̙̼a̢͇y̘̭.̫́i͎̻͙s̲̖͉A̟͚r̦̠̼͠r̛͔̘̝̲̰a̹̹y̰̮̭̳̻(̞̰͇̤͔̦͝n͝)͕ ? ̰̺̠̫͘[͉͚͍]̪ : ̡̠͎̺͇͈̯i͔̫̦̹͓̣͍ | ̟̭ͅ | S̰͎̜̫͢.̷̗̙̫̟͉̠is̨̩̙̭̱P͎̤͚ḻ̴̩͕̬̼a̱͇̖̥̙͞i̻̜͇̞̜̯͇͝n̦͕͎̣̯ͅO̵̖̫̟͙b̰̗̳͈̝̀ͅj̤͙͎̣e̩̳̟̜c̯̼̖͖̦͙ͅṭ̻͈͚̪̀(̘n̹͟)̘̳̥͍̩̀ͅ ? ̛̻̬̣̯̘ṉ̩̩̞̳ : ̧̪̮̣͕͙͓ {
                        ̭̺͝
                    }
                    ͍̞̬̹͙ͅ, ̜̠̣͖̭ì̙̜ = ̷͚͙!̣1, ͔̰̟͡a[̟͝t̫̹̩͈̣]̠͎͈͓̗͟ͅ = ͇͕̫̠͚̙̖Ş.̴̝̤̜̩̺ex̘̲̰̙̘͜ͅt͖̝̹̼̭̫̮ḙ̴̺͚̰͍̹̦nd͍̺̰̗(̵l, ̹̤̬̘ͅo͏, ̧̤̱̲̟r̵̜̘̣͇)̲̙͠)̦̩ : ̗̳͖͞ͅv͚̠͕̫o̷̖͚̙i̜͍̪d͔̰̙ ̘͍̻̪̞͘0̩̦͔!͈̫͖̬͎̀ = ̮̘̘̰̹̘̦ = ̫̫̝̼̦̻ṛ̡̖̟͔̞̩ & ̠ & ̣̤̬͟(̜̩̘̟̤͡a͍͕̩͇͢[͏̙̳͈̗̘t̙͖͟]̹͎̣́ = r̙̲̪͔)̳̠̣͈̜̬͖͡)͢;
        ̧̘̪̫͓̬̝̱r̞͢è̲̲̮͔͙̥͓t͓͇̗u̜̲̤r̸͖n͕̱̪̤͇ͅ ͜a
    }
    ͍,
    ̮͜ͅͅS͎̗̟͕͈͖.͙͙̲e̵̻̲͇͉͓x̪͎̠t̯̝e̹̗͓n̛͚̙̝͚̫͖̖d̬̼̙̬̠͉ͅ(͍̟͕ͅ {
        ̥͜e͏͚x̫̻̹͇̖p͜a҉̠̩͙̠n͏͍̜̹̯ḍ̣̼̰͠o̩̣͔̤̦: ̼̰̕ "̼͈j̘͖̖̫Q̶̠̝͖̠ͅu͉̖̣̣e͚͉͞r̜͕͙̦̦̞y͕͕̩̭͟" ̸̣̙ + ̘͞(̛̻̲̫͖̩f̰͉̜̻͡ + ͈͓͖̝Ḿ͈̱a̟͈̰̹̩̖t͉̟ḥ̤̲̖̬͍.̵̯̩͙͓͔̪r͇͘a̞͍̺̝̝͡n͍d̞̦̺̪̟o̲̹̦m̕(̙͉)̢͍̦̯)͟.̧r̤͖̦̝̩e̩̭̘̼̯̺p̪̞͖͉͈l̹̳ͅa̯̼̜̫̟͇c̪͍͇̣̩̪͠ͅe͙̥̖͇(͏̹̯̲̥̣̳ / ̳͍̱̲̮͎͘ \ ̶͕̠D̛͈̰͓ / ͏͇̝̹̬g̼̩͓̪̣͎, ͇̙̻̞̤ "͞" ͘)̸,
        ̸̙i̡͈̰s̬̣̬͓̗R̫͕͇̯͘e̫͍̺̲̳͍ͅą̜͇̥̠̜dý̝̩̦͇: ̫̙̼̤̦̫!̜̬0͎̰͙̹͠ͅ,
        eṟ̠͇͉̤̳̕r͟o̸͕r̛̜̤͙̻̯: ̵̳̙͎͓̲̟f̴̣̭̤̺̠u̴̱̝̰̩̪̩n̩͚̤͡ͅc̠͔͔̥͜t̬̝̣ͅi͍̼̙̲̫͉͜on̶̹̼(̮̤̬̕e̷̬)̛͖͓̝͓̫ {
            ̜̦̳̘̰t̟̺̣̟̗̩͘ͅh̩̬͈̤̫̖̬r̼̮͓̯̪̜̫o̰͔̼̫̬͓͠w̫̙ ̴̥̩̠̼̫̜n̻̪͔̖̙e̖̭͉͙̹̣͉w̡̮̩̰̗̟̭̥ ̫E̬̦͕̣͟r͙̯̘͎̙̕r̮̮̜͞oṛ̩͈̻̬̻͘(̧̭͓̺̳̝̞e̛̝)̴͈
        }
        ̷̺̞̳,
        ̸n̠̼̥̙̫̖͞o̶op: ͖f̳̹̟̗̙̹u̞ǹ͚̝̣̭͇̹c҉̣͎̞͔̮̟̞t̸̪i̠̟͙̥͍̘͠ò͔̪̝͉̤n̹̝͟(̦͍͖̹̙̘͡)̗̳̥́ͅ {
            ͓̪͇̘̱
        }
        ̷̮̦̺͎,
        ̼̰̺̲̘i̦s͎P̱͓̖l̙͕̻̯ḁ̟̼̳̱͡i̵̗͈̪̰n̢͔O͔̬b̤͈͈̟͜j̭͎e̲̳͎͓c̛̹̖̩͕͇̯t̷: ̧͔fun̶̦͙̲̞̮͚c̝̰̳ͅt̫̥̳̯i̭̪ǫn̻(̨͎͙̥̮̩e͕̯͇̬̻ͅ)̞̫́ {
            v̠̪a͈̦̰͓̜͚͜ͅr̞̙̝͍͉̼ ̺̺͎͢t̻,
            ̪̩̙̳̪̮̠n̵̯̥͍̗̬;
            ̵̗r̖̪̻̗̫̪e͍͖̟̼̯̱̱t̜̠̩̮͟u̶̲̪͔̺̠r̖̖͘n͍̞̯̜!̟̥̰̰(̫̺̜̖̲̪!̨̦̲͚͇̮ȩ̩ | ̲̤̬̠ | ̷̮̝̘̖̯ "[͉͚o̖̱̙͚̕ͅb̩̥̤̘̱̥̫͟j͖͈͉̫͖͚ͅę̖̞̼̥̱̠c̗̻̠̹̬͉̮t̳̳̼̩͍͍́ͅ ͟O͖͞b̭j̳̭̬͖̪͚͚e̦̦̮͍̲ć̭̲ţ̙̹͍͓̤]̮͓͡" ͎̙͕̲!̢̦̻̩ = ̧̰͈͔̣ = ̣̀o̺̣͉̬͓͢.̸̮̘c̩̬̦̝̜̙͈͝a̢̘̱͖̥̪͎l͕̜͞ļ̪̠̦̻̼͔͇(̷̫̘͖e͍̮)̮̳͇)̺̣͎̭̘̣͕͞ & ̯̬͓ & (̲̼!̵(҉̙̜̩ţ͔̫ = ̠͕̯͓̗͇͠r̨̝̳̭(̪̫̭͙̪e͚͇͘)̱̣̦̩̜̰̦)͓̼̲̙͈ || ̶ "̲̬̗̲f̪̟͍̗͘u̮̗̘̙̱̤ṉ̨̝̮̯̜̭c͎͔̳̤t̝̳i͓͔͙̭o̱n̝͚͠" ͇̮́ = ͔̖͈̬͕̕ = ̨̞͓̳t̩̬ỵ͚͈̩̘̻͞ͅp̛e̻̞o̠̲͚̪̜f̶̘̭̼̳̮̯ͅ(̖̠̲̠n̸̖̞̱̭͉ = ̡̗̰̥v̛͉̼͙.̸̘̺̖͚̤͇̯c̯̭̮̠̺̱al͓̖̩l̙͖͇̼͓͍̻(̭̳͠t͕͘ͅ, ̖̟̘̠̳͙ "̭̪͚͍c̬̳̳̩̠̩o̘̘͕̗̮ͅn͓s̵͚͙̠̩͈̬t̩r̝͕̰̰̰͝u̕c̻͓t͇̩̻̹̘̣͚o̵̗̙͍̙̘̜͈r̟̮̦͖͇" ͟)̦̫̰̫̠̻ͅ & ̻̗̖̟̺ & ̷̼t̗͈͇̞̞̣ͅ.̥̼̝̠̼̬c̩̰̮͓o̠̜̺̫̠n̟̻͓̠̥̟̕st̩̬̰̞͢r̪u̠̹̭̝͕͖͎͡c̟͚̕to̲͉̼̪̗͡r̲͙̖͡)̨̝̭̪̻̹̠ & ͠ & ̻͟a̷̻̬̥̻̣.ç̭͖̼̦a̬̬͓̜̱ͅl͕͔͍l͏(͈̭͓͚̣͍̗n̴̬̺̩͎̼)͔̦̼̯ = ̯̱̣̳͖ = ͖̥̺̞͟ = ͕̪̘ͅͅl̢̞͓̤̘̣̭̺)͍̲̳͠ͅ
        }
        ̢,
        ̖̩̱̦̗͡i̲s̭͇͓͓̣̖E͍̤̝̱ͅm͓̼̬̻̯p̳̦̙ty̳̜͓̪͉O̵̱͈̮̠b̮ję̪̝̟̺̗̹c͈̫̪̥̝̘t͎̪̘̣̱͕: ̫̮̫̹͟f̢̰̰͉̰u̪n̞̖̲ct̜͕̻̟͉́i̞̪̮̩o̝̗ǹ̜̲͈͇͔̦̰(̟͙e͍)̸ {
            vạr̛̠̤̹̪͚̠ ͓͇̣̩̗ͅt͉;
            ̞̦̪͎̣f̥̯̣̺͟o̺̻̩͓̗͎͚r̦(̨̜̮̟̱̮̹̣t̟̱͚̻ ̻͓̣in̹͠ ͈͖̼̠̱̭e̢̹)̖̮͕̣̕r̯͇͢e̵̤͈͕̠t͉̳̤̗̱͚̜͡u͕̺̞̩͟r͎̬͙̼͓̱̺ṋ̟̱͙͞!1̭̹̥̟̪͚ͅ;
            ͎̱r͙e͖̳̹̯t̤̠u̥̳̟̯̮̟͞r͔͍n!̙̻̣0
        }
        ͚͍̼͕̬̝͍͞,
        ̨g̛͍͙̟̱͎̬̜l̲̜̫͉̮͔̀o͖̫̤͍͔͉̰b̨̤̰̯̟a҉̪lE̱̜͔v̸̮̠̤͉a͈̣̠̳͚l̛̮̟̘͖̭: ͔͖̠͚fu̦̬͖n̡͉c̦̬͇͉̘͉ṭ͔̣̙̞͝ḭ̣̳̹̭o̰͖̮ṉ͚̣̘͟ͅ(̩̠͠e̡͍͕̪͖̣̲͕, ̲̠͚̮̥͞t̹̯̩͚͇ͅ, ̙̮n̛͇̺͎̹̹)͓̙̗͙͖ {
            b͇̕(̦͕e͔͓̲͕͖, ͔͙̬̥ {
                ̱̥̥̯́n̼̤̟o̸̳̙̜̪͍̜̮n̹̘̥̺ć̯̟e̹: ̬͓t̥̖ & ̧̠͍̮͎͙̲̘ & ͍͍̬̹͎t͓̥̻͚ͅ.͓͕n̥̹̠͙̼ò̯̟͓ṇ̫͉̣̘͍͞c̺e̹
            }
                ͈̼̜͔, ̠̠͔͕n͎̼)͏
        }
        ̠̩̩͓̠̮,
        ͓̠ͅę̣̜̟a̡̩̩c̢͕͕͇h̠̤͈͝: ̸͍f̳͓̳̥̝͎̹u̜n̘̥c͎t͈̬̬̝̠̝͟io̱͈͜n̞̺͇̖(̳̩e̼͍̠̥͠ͅ, ̫̖̙̘̳t̼̼̺͈̜)̣͝ {
            ̛̝͖va̭̖r̢̪͈̪͚̜̘͍ ҉͕̱̹͇ṉ,
            ̜r͓̮̖̜̱ = ̪̤͉͉̯͉0̧̩ͅ;
            ̬̣̖i̛͙f̦͉̮̦̩̘̪͢(̲̳̞p̴͚̣(͙̯̖̝̦͖͈͠e҉͓͉͖̦̲̘)͓)̣ {
                ̲͙̹͖͎͕fo̖̝̲͙͍͎̪̕r̗̹(̪̠̪n̬̲̥͈̞͓ͅ = ͉e̗̰͕͙.̩̝͈̳̱̼̠ḽ̷e̫͇͕ͅń͖̰͉͇̯gt̫̞̤̕h̟̠̳̝̮̰; ͇͈̬͈̩̘r̛̜̫̲̖̰ < ̢̰͓̪̤n̗; ̲̺̞͠ͅr̞̩̦ + ̸ + ̫̜̳̤̺͡)̥i̯̤̦̬̺̤̮f̞̱̗̥̣͖̪(͓͚̣̭!̧1͕̣̠͜ = ̯̤̀ = ̺͖̠̝͠ = ̤̞͇ͅţ.̹̦͠ća͚l͓̹̀l̪(̼̹͖̹͖̣͉ȩ̮͕̱͎[҉̱̪͔̖̠̼r͎̤̣͈]͕̙̣̗, ͈̱͖͔̹r͔̮͙͓̱, ̵̻̫e̱͇͎͢ͅ[͙̦̮̫̦̤r̹̜͉̖̭̫̫͝]̱̗̻̫̱̫͜)͔̥̫̣͠)̞̺b̻́r҉̝͍̯e̗̯̼ak̼̳̤̬͓̞
            }
            ͇̬̠̀e͉̫͉̯̳͝l̢̯̳̜̩̪̮s̰͎͙e̛̩͎̱ ̢̻̻̰̤͈f̩̮̩̱͡ơ̙̤r̖̬̹͍(̪̫̭͘r̘͍̪̱ ̱͈̘̻̝i̪̘̜̱͖̱͚n͖̟ e̪͖)̭͝ḭ̵̘̘̙̭̱f̳͜(̵!̺̘͈ͅ1̟͉̰ = ͚͓̩͙͇̳͓ = ̼̤͙̭̳̦ = ̡̤̦t̶̩̰͉̯.̰̳͔͉͇̗c̹̮̯̙̞̰̰a̷l̛̙̪͉͕̱l͙̻̙̺̬̦̀(̼̦̹͔̦̬̰ḙ͕͍̥̖͉[̷̘͙̮̦̦r̴̪͉͉̭ͅ], ̧̻̤͙r̝̲̤͚, ̲̦̬̤̫̞͡e͎͈͉̯̗[͍r̟̫͎̪̮̦̘]̞̺̟͙͇̘͡)̸̹͚͎)͞b̘̘̟r̮̯̻̬e҉̺̦̥á̫̣k̗̬͕̘͎̦;
            ̯͓́r̘̦̫͈̭̦ͅe̝̟̖t̲͘u̘̗̝̟̣͠r̴̟̝̩̹͉n̠̯͈̠ ę̩
        }
        ̼͎͓̠̮̹̫,
        ̷̹m̛͈̜̭̫a̲͙ḳ̮̤̩̟e̖̻̺A̰̗͠r̴̗̙͖͉̼͓̙r҉̘̜̗͈͚̥̣a͈̝͍y҉͕: ͇f͇͈̮u̮̜̟̭̰n̯̫̝̣͡c̤̭̙̪͉t͍i͔o̡̠̗͚̞̞ͅͅn͕̝̫͎͠(̷̰͎̺̦͇e̳̫̝, ̧̹̮͈̺̟ţ͇̭̪̗̹)̠ {
            ̵̞̤v͏̜̬̞̯͙͇͈a̱͇͍̻r̶͎̩̺̦ ̪̱̤͙͖̙n̗̤͖̮̠̥͇͘ = ̛̮̠̟̩̺t̹̤ | ̞ | ͕̳͚̙͎͓͡[͚̫̮̀]̶̳͇;
            ̶̮̰͓̞͚̜r̻̱̩̺̳̪͓͞e̹̩͞t̟̳͚̭̦̬ṷr͔̙͞n̨̲̻͎̫̦ ͓͍͓͙̲n̠̲̳͖̖͜u̶͚̺̣l̝̣͢l͈̜̣̬̫͕̖!̸̤̫͎̪ = ͏͈̺̳̦̳̣e̴̥̳͙ & ̲̫̖̣̠͍̹͘ & ̜̮̦̞̭͖ͅ(̶̻͖ṕ̬͕(͡O̹b͍͈̘͍͖̘j̹̬e̸̮̯͍c̠͙̩̘̘͝t̙̰̥̰̖(̳̹͜e͎̩̭̹͎)̷͚̤̭)̤̝͟ ? ͈̱͚̺̦̲S͙̻͡.̨̞̣m̹̪̣͝e̶̹͙̳̼͍̥̪r̡̙̟g͉̝̟͘e̸(̺͉̺̕n͍, ̬̲ "͈͔̝͙ͅș̲̘̱͘ț͠r͙̫͠i̗̭͉̝͎̤̻n҉̮̹̞̘̩g̲̟̖͓̕" ̺ = ̖ = ̜͙t̸̥̠͚͔yp҉̬͍̗͎e̳͕̲͚o̺̥̺̘͉̱f̨̺̻ ͙̞̫̻e̡̤͚͚͇̟̗͍ ? ̸̯̱̜̮͙̺[̀e͚͓̟̖̯͇̹]̵ : ̫͔̗̱e̘̝̣͓͈)͍ : ̪̭̭̥̹̖u̫͠.̸̹̹͔͉c̷͓̻̱͖̭͉̺a̧̺͇͉̤̯ll̙̻ͅ(̙̪̠̩͙̥̙́n̛̩̝͈̠͎͙̺, ȩ̖͉)̢̻͍̞̞͓̰)̖͇͔̼͔,
            ̳̦̰̀n̴̘̗̬
        }
        ̧̼̹,
        ͙̬̲̻̻͓͈i̵n̡̫Ḁ̴̙r̺͉̜͖̦̲̠̀r̴̰̥ą̰̬y̞: ͏f̨͈̮ͅu͍͓͍̭͟n̪͍̦͖c̪̬͉̲͍͈͝t̤͢i̛̩on̨̥(̫̮̱͙͞e͔̠̠, t͕, ̝̦͟n̠͍̼͖)̛̙ {
            ͖͎̬r̷͎̼̲̜͚e̼̘̼̦͍͈t͎u̹̟̹͖r̭͎͚̪̜̦n̸͎̖ ̶̜͉̜̩̻̬n̘͎̯̮̙͉u͇̟̱̙͇͔l̛͉̮̝̪l̢͎͇ = ̡͓̼ͅ = ͙̫̙͞ț̼͈̮ ? -̞͔̘͉̫1̞̱ : ͓̱̥̗͢i͙̫͉̰̬.̖̻̙͙͍̕c̸a͖͙̘̰̮̦l̟͓l͇̱̤̫͍(̝̞t̪̩̹, ̙͎̺̝̰ẹ̲͕̺, ̗̱̮͚̗̦́n͓̭̝̜͕͠)̡
        }
        ͍͈͉̞͚,
        ̰̟̲͠m̢̦̳̰̤̬ͅe̤̯͎͎ͅr̯͚͎̙̰ͅg̥̟͍͔͈͍̥͞e̝͝: ͖̺̠͇̼̯ͅf̻̤̖̫̯͖̯u̠̩͙̱̩n͉̥c̣̻̲͓ͅt̪̺̖i̼̘̗͍͉o̭n̹̱̯̻͖͇̤̕(e̠͙͔͘, ̫̱͖̱̥t͔̟͙̘̱͓́)͉̻̦̙͔͙̥ {
            ̮̺f̢̫͍̜̹o̬͔̘̲r̺͕̠̭̯̱̜(͈͡v͎̳͉̤͖̩ar̕ ̩̤͎̥ͅn̬̩̪̩̳̪ͅ = ҉͈͈̪͚̣ + ̞̬ͅt̢̠͙̟̞.͕̩̲̲̖͎l̖͙̜̰ͅe̯̹̝͚͓̞͞ͅn̹g͉͔t͍̱̠̻h̪̘̺͓̳, ̧̥̱͔̬̥r̹̫̕ = ̵̬0̵, ̰͉̤i͈͕̗ = ̘̟e͖̼̥̟.̬̙͢l̵̥e̦͕n̳g̣̺͟t͔͉h̵͕̫; ̳͈̱͖̖ṛ̀ < ̱n͍̞; ̛͈͍̱͓ͅͅr͇͔̗̩͓̕ͅ + ̙͕͙̦ + )̸̠͉͔̺̯e̘͖̳͕͙͙̣[͔̝̝̳͙̭͡i͈̗̺̙̣ + ̗̭͚̲ͅ + ͎͇̥͇̩̥́ͅ]҉͔̠̖͔̦͉ = ̟̲͙̲t̵[͚̥̫r̗͍̪̭͡]̭̣͞;
            ̴r̸͓͈̤̼̯e̹̦͖̪t̰ṵ̻̬̤̜rn̵̖̞̯ ̧̘͖̺̫͉ȩ̠̯͓̳.̧̣̠͚̟̫̭l͚̗̼̘̜̠͍e҉͈͙̝̱̺͎̩n̯͉͔̟̤g̨̤͉̟̬ṯ͉̝͈h̝̰͕͉ = ̘̹̺̘͉̘͖i̮̮̭̼̥̗̜,
            ̲̣̞̞͎ę̥͚͇
        },
        ̸̮͎g̱͕̗͘r̫̯͍͙̖e̢̖̪͉̝p͉̲͍͖̳: ͍̱͘f̴u̞̤̰͉̟̠̞n̼̗̪̥͔̤c̝t̙̖͘i̗͕̝̤̬ͅo̹͍̺͚͎͔n̬̮͙(̡͓̦̙̖͔̬̫e͙, ț͔͈͙̝̭͓͠, ̛͈͉͇̺n)̶ {
            ̭̼͍̼̭͔̫͟f̖͎̺̰̣̩͔o̷̪̘̬r̘̪(̷͓͙̣̰̹̣v͔̰͚͈͠a̧ŕ͙̦̺̹̗ ̗͈͜ͅr̭͖̝ = ̡̙̞̘̹̳̫͚[]͙̥̥͙͖̟, ̤̜̦i̷͎̼ = ̞̝̟̼͓̱̙0̠̞̬̪̫, ͉͖̩͇͔͕o̭̹͈̩ = ̬̘̻͈̠e̙͓̦͖̩̼̱.̖́ͅl̬̩̤̫͖͇e̦̖̠̤͉͕nģ̤̩̹̞ͅth͙̠̘͚̰̱͔, ̺͉͡a̘̠̱͙̝̣̗ = ̺͈̻͍̭̱̞!̶͇̯̯̥̞n͉͡; ̯͕̮i̗ < ҉͎͓o̞; ̛̟̭̘͕̲i̲̮͖̩ + ̭̩̫̘̖̭͡ͅ + ̭͓̲̥̼͉͠)̝̲͞!̯̱͇̦̮̩̀t̯̹̦ͅ(̺̮͓̝̦̞ͅe͍̣̘[͏̲̗̠͕̰ͅi̢̪̤̦͍]͏̰, ̨i͓̱̻̞)̠̻͕͢!̝̬̙̣͎̱͟ͅ = ̨̹ͅ = ̗̝̭͈̪̗͝ͅa̶̙ & ̵̫̙ & ̯̺̳̯̼̀r̖.̞̖̱̟̟͈̬͢p̰͔̩̹̣u̩͇̖̦̭̰̦͞s̸̖̖̺̖̪̟̰h̟(̙̰̼̲e͙[̡̞̲͙̬̟ͅi]̶)̸͔̪̞̳;
            ̳͎̟r͈̣̭̣͇e͎t̪͚̙̰͍̺̻u̶͓͙̩̣̝̱r͖̯̯n̸͖̯̜̱̖͕̖ ̼͔̰̲̜̝̺r͈͉̩̕
        }
        ̜̯͜,
        ̥͍̣̙̯͡m͔̥̥̗a̫̩͉͙̮̳̠p̸: ̰̠̭̲͙̕f̭u̺̙̹̟̮͡ṋ̭͔̠̟̕c͈t̯̺̗̦̯̞̰ì̠͉̩̞͖̟̣on̛̪̰̱̩͎͙ͅ(̺̯͙̬̳͔e, ̪̙̥ͅṯ̡̤ͅ, n͔̝͎̖̮͙̕ͅ)̯̫ͅ {
            ̗̞̺v͖̼a͓͠ṟ̺ ̨̖̭̪̳̪̱ͅr͉͔̜̙̹͟,
            ͜i̘̖̘͈͍,
            ̗͔͠o͙̭ = ̵0͍͙̬̭̩,
            ͇̩͔a̴͕̹̞̥̻̮ = [̰̜͓̥̮͉͝ͅ]̨̫;
            ̦̪͉̬͝i̵̯f̛͙̳̭̣̜͍(̼͉̮̣p̬̞͇ͅ(̮͕͚̗̲ͅḙ͚ͅ)͈̻̟̙͎̕)̣͟f͏o͚r͖̺̩̮̣̠̹(̼̥͎̦̀ṟ̖̙̪͢ = ̩̯̯̮̭̝ͅe.̵̹̼l̴̰̬̥̥e͏̱̖̩̺̺͖̙n͕g̖̠͙̰͝t̞̥͇͍̥̙̟͘h̨͚͕; ̹̳o͙̘̘͞ < ͔̙̘͉̪̗͕r͉͇͇͓͚͞; ̝͓ọ̘̲͘ + ͏ + ͉̞̼̹̙͚ͅ)̗̼n͎ṳ̝͞l̝̱̬̹͍͉l̗̩̞̦ͅ!̷̭͙̙̘̪̞ = ̞͞(͞i̟̭̩̯̼̻̘ = ̠͓̰̣̦̭͓t̯̺(̨̤̟e̶̗[o̧̙]͎̺, ͕̹̩o̶͈͚̮͉̻ͅ, ̦̼̟̯͇͍͇ṇ̸̱̗̞͇̯)͏̠)̷͉ & ̸̟͉̖͇ & ̛̤a̴̰̯̟̭̣̲͓.͈p̢̦̰̼ṵ̞̰̙s̲̹̠̺̣̦h̛͓̼̤͉͚̲(҉͔ị͚)̷̦͉̯;
            ̗̗͔̹̣͚e̠̯̺̪̝̳͝l̰̪̪̰͉͙s̙͔̻̙̕e̵̠̫̹ ̤͖̥̲̖̩fo̬͇͕͎͔͘r̖̪͕̠̯(̜̼̘͈̞ọ͘ ͉̫̰̻̼ͅi̜̠͉n͏̟̘̜ͅ e̫͢)̹͍̙̦͖͓n̢̼̥̱͔̱̹u̦̥̙l̯̠̳̯̙̹̲l̤̘̯!̱ = ̢(͕̩̭i̛̲͙̞̩̮̫ = ̖̙͍͍̘̖t͏̱͇̭̹̗̳ͅ(̯̘̻̬̙̮e͔̮͙̲̮̯ͅ[̳͕͎̲o̢̝̩̯̙]͉͈͇̫͙̜, ͓̖̝̙̺̻͟ò̟̖̺, ̟̟̖̗ǹ̯̬̩)̷)̝̩̻̰͡ & ̬̭̻̠͈͈͜ͅ & ̡̺̳̰͍͈̙̠a̮.̢͕p̼̼͚̫͖ṳs̩̩̟h̝̳͈͔̱̮̕(̛̰̱̟̦̬͕i̥̕)̷͉̝;
            ̧̬̻̮r҉͖̗̠e͎̘̮͍͖͠t̪̲̜̜͖̦̠u̜̙r͎n͏̰͓͕̣̗͔ ̞́g̘̻͓̙(̘̟̳͎̮̹̬á̬̜̞̗)͓̤̝̼̫̀ͅ
        }
        ̼̦̭̫̕,
        ̵͍͓g͇̖̞̼͝u̖̰͍͇̜i̜͕̱̠̗͠ͅd̛̗̫̭̗: ̰̖͖1͇̲̳͢,
        ̪̼s̭̭ù̻̘p̟͖̺̝̖p͎͚̤͓̭̰̞o̖͞r̳̖͇̠̤̮̺͜t̠͉̤: ̧͙̜y͍̻͠
    }
        ̲͍̤)̭,
    ̺̳͈ "͚̰̞̗͇f̯̙͖̱̙͚ͅu̳̳͕ņc̞͖̲̞͡t̤͙̝͇̣̩̰̀i̤̩̭̺̥͈o̻̪̕n̴" ̳̺̺ == ̣̦t͎y͔͉͈̹̺̠p̰̭͙̻͈̫e͔̱̖̫̪̹̕of͚͔͇̜ ͔͍̪S͚͈̤̭̰͘y͇̠̫͖̖͜m̩ḅ̵̥ͅo̮͍̕ļ̱̬̼̳̘̦̦ & ̣̣̬̘̘ͅ & ̜(̭̳̜S̸̰͔̖̦͙ͅ.̘̫̙̖̫f̵̬̰͉͍n̼̟͕͢[̘̗S̯̘̱̣͇ͅy̗̙̤̪͠m͇̘̲̦̦͚͎b̖͎͙̣̟̤͟o̹̻l̼.͓̭̟͟i̙̬t̸͍̞̦͈̜ͅͅe̜̤̲͕͉r̭̠̲ͅat͉̮ͅo͉̤͈͈̰ͅŗ̳̗͍̺̩] = ̼͙͚͙̠t҉̘̝͈̮ͅ[̱̬̯̘S̫̙̥̯y̶͖͉͔̦m̷͕̩͚̰̭̙b̢̖͎͓̹o̬̻̝̫̙͈l̞͚̪.̡͍i̢̦̱t̻̻͡er̠̝͎͖a͔͕͖͔t͔̺͍̦̙͍̲o̠͟r̲̞̖̞͟]̱̲̠͔̥̜̳͡)̩̮̜̖̮,
    ̯̫̗̬͉̦S̥̺̘̖͟.͔̫̬͚͎̖̹e̼̪̠̙̟̳͝a̮̯̤ć͚̗ḥ̰̻͇̻̺ͅ(͝ "͠B҉̝͖̜̦̙̝o͝o͖͈͡ͅl̪̺͈͎ea̷͍͚̙n̴̼̥̻͓̝ͅ ̹̲͓ͅN̴̩̬̦̲̯͔̣u̙͘m͔̫̥̦̰͔ͅb̘̖̖̱͜e̱̬r̸͚͔̬͙̪̲͎ ̖̬̜S͇͖t͕͓̬̼̀r̳i̟n͙͙̬̹͘g̲̜̠͝ ̡̞̱F̺͙u̝͉͔̻͚̜̼n̝̻c̻̝̯̠̤̺t͙̹͈͖̞̘̹ḭ̲͍͚o̩̩͇͎͜n̫̖̯ ̲A̱̻̝͎̪͖͟r̮̜̩̪͘r҉̬̬̲̝a̴͖̼̩̺y͇̯ͅ ͙͓̮͇̗͠ͅDa͚͔͉͕̲̰̗t̻̳̪̭̜̖̳e҉̮̪̹̤͍ ͖͖̭̥̼͟Ṛ̦e̤̣͍̥̹͜g̢̥̻͈͖̻ͅẸ͎̮͢x̧͇͇̲̦̬͎̳p̷͍ ͍̯͈̠O̻̗̣͇̺͓͉͡b̶j̟̞̪̺̕e̼͕̣̖c̼̱̪̖͜ț̲̱̞̟̪̗ ̟̤̘̭ͅE̥͚͘r͓̲̻̠̦r͎̼o̗̞̺̞̟͍̝r ̴̭̘̯̗̞̜S̡̤̩͈̹̲y̖̳m̗̺̯̮͍b̹̙͕͙̬o͍̙͈l͈" ͓͢.̨͙̼s͈̦͓̜̹̳͜p͕͉͠l͓̟͓̩i̢̫͔̙̟̫t̫̙̯̙̀(͖̞͔͍͖ "̱̘̩̭̝̬͓ ̪" ̢̝͍͉̬)̴͎̫̳̹͚͙, ̺̟̳̩̤̪͢fụ̷̪͖͉̟̖̪n͉̗͉̹c̫͡t͎̞̘̤̦͉̤i̶on̢̮̦̥̙͕(̣̣̗̞͚́ę, ̰͜t̶̯̭)̥̪͡ {
        ̶̭̦͙̠̹n̘͕̤̫̞͔[̨̩̩̩̥͈ "̬͉̝̫͕ͅ[̥̦̖̫̱̯͕o̜̟̹̫̘͞b̪̤j͓ẹ̝͍̰͇͇̞c̲͉͜t͔͖̣̲ ̤̬̼̟͔̣̕" ́ + ̧̩̟͙̺͚̘̩t + ̵͚͈̲̖ "̭̺̰̕]̞͔̼͖̤" ̢̯̝͙]͏͓ = ̷̱̰t͔͙.҉͖͈̺̻̬ṭ̮̯̞̝̪ͅo̬͓͍̳͚̦̯͝L̼̩̞̹͉o͚͔̬͚̬͞w̡͖e̩͉͉͈̘̜̠͞r̛̮̰C̖̗̯as͡e҉̜͔͈̘̺(̫̪̀)̴̯̣͔̱̹ͅ
    }
        ̺̜̟̦͖͖̻)̜̮̜̻̠̥;
    ͇̠̹̟̞̣v̫͎a̙r̟̯̗͕̯̻ ̭̳̘̦̫̕d̷̼̟̗̪̞ͅͅ = ̻̰̝f̶ͅun҉̩͉ͅc͔̦̞̹t̡̹i̙͔̼̠̭͟o̦̲̹̱͇n̳̲͙͔(̡̥n̥̥͉)̙͎̲͓ {
        ͏͍̜͎̣̜̙̰v̀a҉̮r҉̹͎̘̣ ̳̞̞̜̯͠e̤͇̮̞ͅ,
        ̢̻͇̝̠̭ͅd͔͇̰̮̰̥͓,
        ͈̜ͅb͉͉̪̝̬̱̳̕,
        ̹̼̬̪̹͍͟o̧͎,
        ͍̤̫̱̪̳͝i͈̼͕,
        ̝̲͝h̛͈̰,
        ̮͠f̱͇̻͉̗̼,
        ̧̰g̰̥̺͇͕̦̦,
        ̶̮͙̼͔ͅw̻̲̕,
        ͢u̘̝͍̣͠ͅ,
        ̨̱͓̟̦̺͓̝l̼̙,
        ͇̺T̘̪͚̲̺̭,
        ̪̘͉̗̼ͅͅC̰̲̙̳,
        ͖̦̙͕͖̘̭a̪͉̼,
        ͚̜̯̪͙E̷͚,
        ̨͖̯̜̤v̶,
        ̴̮̼͇̦̤s̞̙̀,
        ̠̼c̼,
        ̯̰y̮͓̹̬̩,
        ͉̬̫̩̟̪́S҉̫͔̱ = ͚͈͉̱̳̲ "͙̻̬͕̬s͔i̵͖̯z̲̫̗͞z̫͉͈̝̹̝l̼̠̙͖͡e̟̖̫̼̜͉ͅ" ̷̰͍̠̞ͅ + ̦͕1͙̭͎̠̪͍͠ͅ * ̶͕̼ne̱̥̲̪̜͉̕ẃ ̀Da̵͓̺t̯̣̦̳̮e̮̞̗̥̹̝͢,
        ̵̖p̴͈̬̩̳ = ̩͓̰̻̖͎̭n‧d̛o̗̯̳̼̟̜̱c̝͙̀um̖͚̬̤͖e͕̻̪̻̣͙n͓t̝͍́,
        ̦̟̱̜̦͔͝k = ̹0̼͇̙̝͉͎̮,
        ̡͕̟̱ͅr = ̱͖̰͓̤̦0̮͎̯,
        ̭̠̫̮m̖̖̻̖͠ = ̪̭̰̜͕̬͜u̠͓͇͚̯e͍(̩͔̲̟)̟̹̱͕̙ͅ,
        ̘͚̺x̹̰͡ͅ = ̗̳͕͙̺̯̬u͢e͇̜͚̩͈(͔͢)̖̭̠̱̝͙͚͟,
        ̪͚̀A͏̘̭̮͔ = ̳̮͜u̧̺̜̙e̱͖̠͉(҉̖͉̰)͈̮͚̭̥̳,
        ̬͔̣͓͇̺͉N̙̻̝̗̬͙ͅ = ͇̺̺̞̠̕ue͇̖̱̪̦̞͘(̴̗̣̯̲̗̩̳)̯̯̤̯͕̻̠͡,
        ̀j̹͖͉̭̭̘ = ̬̣̫̩͓̝f̢u͔͙̹͓̕n̼̘̯̩̰̼͔͞c͍̤t̸͈̻i̗̱͍͟ò̱̭̹͕͇ṇ͕̙͉͉̫(̺̫ẹ̗̮̘̰̰̱, ̷̮̖̥͔t͠)҉̲̜͉͔ {
            r͙̫̭͚e͚̠͕t̩̯̥̲͘u̻͍̝̪̹̟r̮͔ṋ̯ ̫͓̟́e͏̠̣̻̫̟̹͓ = ̪ = ̢̖̙̟ = ̪̫ț̶̫ & ҉̦̦̱ & ͚̯(͓̝̟̼̼͖l̠ = ̤͙̜̼̹̫!̲͍̦0̛͈̻͈̥̹͇)̶͔̘̟̪̤̠ͅ,
            ͎͈̳̥͚͞ͅ0̠͕͓
        }
        ̭̬̙͉͇̦̭,
        ̦̠͍̹͈͉ͅD͕͇̦̥͍͜ = ̹̜̱̜̯̪̹ {}
        ̫̭̭̗̩̹͞.̦͇͎̳͉͈̲h͕̰̬͔a͝s͚̦̺̯̤͠O҉̻̰͙̪w̯͚͓̖ṇP͎̜̫̯r̴͙͓͈͖o͇̘͔̹͖̞p͙̥̱̰ͅe͎̣̠͜r̝͘t͕̪͇́y̗̞̗͈͍̞,
        ̰̫̙̯̹̤̱͢t͏̭ = ͘[͚̺̟̠̮̹̀ͅ]̰̻̩̝,
        ͇̦̻̙͕̱q̤̰̥ = ̶̞͍͙̳̜̳t̨͉.̜̱p͚͖̲̝̠͉o̮͖p̨̮͔,
        ̤͕̙̮͇̳͍L͍̤͚̻̜̭̜ = ̬̩̥̤̻̹̦t̰̬͈͕͙̖.̻p͓̘̥̪̫̼ṵ̶̮͍̰̬̯s̸̻͔͕h͞,
        ̭H̬̥̪͘ = ̭͉̞͇͚̞͞t̼̘͍̥̯͍̝.̲̗̻̟͇̪̝͟p̷͖͖̣̖̞u͈͖̠s̘̥̟̪̬h̰,
        ҉̭̬̖̩̤̗O = ̙̟t̙̥̫͠.͖͓̗́s̲͕̱̺̺̲l͍̰̼̤̩i҉̹̥̖̱̖͍̠c͔͉̭̝̮e,
        ̷̯̼̞̜P͇̞̝̳ = f͜ṷ̞n͞c̟ͅt̵i̸̼o̟̫̙̙̮ͅn̻̰͖(̨̜̺̳̟͔͔e̙̥̝͔̝, ̗̙͓̖t͚̻ͅ)̯͉̦̰͉̺͙͘ {
            ̠f̺̬͜ͅo͔̘̲̰͕͔͖ṛ͈̹̫͕(̸̘̳͉͙͎v̵̭̥a̹̟͓̱̟̮̕r̪̣̪̗̖̗͞ͅ ͕̘͘n͠ = ̬̲0, ̨r̡̝̫̼ = ͕͈̝͚̞e̟̖̖͔.̸͖̱͉ͅl̻̀ͅe͓͢n̻͕̦͔͉̗g͏̖͎̬̹͕̹̯t͕̬h̺̳̀; ̮͖̘n̷̶̤͔͚͈͙͎̱̞ + ҉̻̙~̬̮̮̹̥̕] | ҉͈̫̩ "͙+̶M̵̞͔̭+̬͚͈͇͡" ̴̬͓̺͉̮̪̙)̱̼͞ "̪͇̰͈̱́+̼̮̱͕̣͘M̨͍͎̼͔͚̲+̺̣̭̻̗͚" ̤̲̦͢ * ̣̝͎̲͓͉̤͘ "̻͚̬̫̖̼)̳̜͚͙̭̹,̧̳U̙=̘̺̦̥͙͎̱n̰͚̟̝ͅe̲w̨̥̗̹ Rȩ̬̪g̫̖͕E͙̳̤̱̲͎x͎̩̥p͓(̢̙̙͖̳̪͙M̙̰̩̯̼̹ͅ+̮ͅ" ̖͔̱̱̗̣̣ | ̹̩͖͕̻̦͙ > ̜̣͉̲͘ ")̲̠̱͈͍,̥͙͖̘X͈̬̜͡=̢̥͎̬̼̫͙̺n̳̣̞͎̖͙e͓̹̺w̡̯͎̱͓͔̟ ̺R͍̞̻͎e̜̻̜̙͍̹͙͞g̳E͢x̶p̴̞(͘F͇̩̯̮͖͕)̣̥̘̜̠̖ͅ,͏̞̘V=̬͔n͡e͡ͅw̴ ͏̤R̝̥͓ͅe̷̠̲g̢ͅE̘̣̘̣̜̤̦x̤̗͓̺p̠(" ̺́ ^ ͖̘͇̱͚̦̤ "͕̳͕͈̙͉͝+̫̭I̴̦̹̗͓̟+̥̟" ͔̖̼͠$̻͉̼͚̙ "̬)̷̤̳͓̩,̴̮͍̘̫̬̠G̘̼̤≠̠̱̳̬͙͔͚{͕I͔D͈̘͕̣̘̟:̘͍̤̯̼̕n̞͇͕̥̱e̵̳̱̯̬̖w͈͘ R̶͖̳̠e̼g̜͚͕̳̞̘E̤̙x̢̤̦̘͎p̨̻̤(̺̺͉͚͍̥" ̟̘̳̲̘͖͜ͅ ^ ͓̲͘ # ͜(̯̻̲̳ "+͎̥͍͓͉I+̹̫̺͓̫̪̝͞" ͎̦͖͠)̬̗͔͈ "̴̺͙͎)̛͈͈̠̫,̡̦̹͙̺̙̻͓C̥̞L̫̗͔͓̲A̖̰S̥S̙̺̱̥̻̤͕͜:̲͈͎͎̘n͙̲̯̗̩͢e͎̩̯w͚̟͙͎ ̤̫̮̲̺̟͠Re̟͙̼g̳̞̥͚E̮x̸̻͕̦̝̤p͏͙̻(̧" ̯͎̹͚͟ ^ ̝ \ ̯̀ͅ \ ̤̝͉͇̪̫̯.̜͔̩(͔̘̟̼͝ "+̯̰̟̬̞͔͠I+͏̪͓̗" ̳̞̰͞ͅ)̣̣̖͠ͅ "̶̠̞̜̤͉)̫̼͇͕̫,̦T͜A͈͈͈̯͕G̴͉:͔͎̮̱̯͈͓n̸̻͎e̦̙̤w҉̣̰̙͇̼̹̗ ̧̤̰͔R̳̬͖̳e͔g̦̰̟E̫͘x͕͚p̻͖(̬̲̯͓͙̮" ̳̪͔̹̺̟̹͜ ^ ̗̹̠͙(͍̤̭ "̣̰̟̣̻̞͕+̟̤͓̠̫I+͚̯͉" ͎̲͠ | ̙̹̲͔͓̻̰́[̦͉̮̣͎̮ * ̨̥̲̼̺̹͎]̼̥̱̲̫͈̀)̤̫ "̛͓̻̜͓)̨͓͎̠̪̭̭̘,̰̖̞̕A͖͕͙̬̻̝͘ͅT̲̙̦̫̼͈T̯̘̟̮R̝͎:̖͔̘̬̼͍͇͘n͇̯̭̭̺̜͡è̖̪ͅw͍ ̫ͅR̖̫͈̘͞é͎̹͕̹g͎͞E̮͇ͅx̤̣p̞̩̼̖͚̣̯͢(͈̹̜̞̼ͅͅ" ̷̗ ^ ̩͍̥ "̪̹͉͙͕̞+̫͈͇̫͠W̱͉͖̦̞͜)̦̪,̡̼͚̹̜P̝͖̦̗̺̱S̻̝͔̻͕E͙̬͉̭U̯̜D͇͚̻͡O̢̯:͎̖̪̠̦̩ͅn̬̺̗̙̻͔̯e̹̜͖͟w̯ ͚R̨̳̱͖̰̜e̯g̳͉͕̘̯̙̭E҉̫̙̻̝̰x̥̖̹̩̰̯͙p̖̺̭̖̹(͖̙̺̯͕̰" ̺̬͉͙͚͢ ^ ̘͍͔̯͡ "̡̜̭+̼̼̖̮͠F̦̜͙)͎͎̖̺͈,̧C̲̪H͉͈̩̬̣̯I̫̩̮͕L͙D̹̖ͅ:̠̼͔͙̟͎̦n̗̠̜̜e̸̻̰͚̘͉͙̭w͠ ̟͎̱̹͘R̭̠͔͉̫̻e͙͈͔͕g̀Ex̷ṕ(̞̬͇̮͎̱̭" ̤̲̤̠̯ ^ ̖̹̥̥͓̙: ̱̖̘̺͕(͈̥͉̣̠̲̣o̺͕̯̯̞ͅnl̤͖̘̜y͍ | ̢͉̻̪͈f̸i̴͕r̭͇̟̪̫̠̻ș̤t̻ | ̧̩̼l̴̘͔a̛̯̪͇s̫t | ̪̤̜̯͉̞n̻̟̭̖̤͓͘t͏̮̯͚̜h̨̗͇̜͔̙̞ | ̼̗͇̬̪n̻͕͉͉͠t̮h - ̵͔̜̩̹l̠̘͖͕̤̞á̩͍̘ͅs̗̗̪t̙̬͝)̙̯̩̱̞̳ - ̫̖(̨̠̝̱̝̟c̛͇h̀i͕͙͎̣l̞̰̟̳̻̗d̺̫̟ | ͓̣͓o̢̻̠̻͔̬̬͍f̟͕͖͔ - ́t̳̪̖͎͠y͚̦̲̥͔͜p̟̭̹̝̗̬̫e̟̗͚̙͚̰̳)(̨̲͍̭͉̰͎͚ ? ̣́ :  \ ̸̰̖ \ ̸͇̤͎̪̦(̱̣̱̼͘ "̵̖̗̤̱̜̩+̖̩͈M̮͉̞̤̠͉ͅ+͎" ̛̙̱͖̮ * ̳͚(̷͖̩͓̹ev͍̣̣͎͇̦̮e͖̜̕n̡͈̜̪̼ | ̡͕̯o̦̟͔̭d̯̣͔d͎̥́ | (̧̤̯͉͕̼̤(̺̱̟̣̀[+̦ - ̛̝̭̱]͖͕͈͈ | ̞̩̱̮̺̮͕)̡͖( \ ̘͚ \ ̷̖̺͖̺͓̦d͘ * ͈͉͠)̥̜͙̀ͅn͟ | ͇͓̭)̵̹̘̬̟̦ "̤̟̮͍͢+̩̭̺̗͟M̱+҉̜͍̺̹͍͈ͅ" * ̹̭̝̟̙̤̗(͈̖̭̜ ? ͙̘̹̱̙̠̫͜ : ̝̜̫̬(͠[͉̦͜ + ͔̼ - ̝͕̼̼̳̖̰]҉̤ | ̯̭͇̩̪̩͜)͖͈̠͈̗ͅ "̳̲̮ͅ+̗̰̼̭̖M͓̯̗̲̞̠+" * ̗̥͇͙(̲̺͜ \ ̸̪̲͕̹ \ ̴͖͚̫̞̼d̸͓̮̫̱ + ͈̮͎̫͜ͅ)̼̯͓̤͖̩ | ̷̮̻)̲̤͕)͈̰̦̳̫̰̳͢ "̬̲+̞̞̲̮M̤̼̥̻̲̀+̴̦͓̘̰" ̮ * ̥͖̞̰̩ \ ̻̳̼ \ ̨͈̩͔̲̣͔͉)̶̞̠̪ | ̶͇)̺̹ "̫,̩̙̯͇" ͙̫̹͕̳͖i̵̭̥̫̗͚ "͓)͈̥͕͚̖̫,̢͓͍͕̲̫̥b̟͚ͅo͍͍̩̗̻͞o̸̖̻̜̣l̝̦͙̘:̹͇̤̝͓n̖͞e̢̳̺̻w̙̗̲̦̲̥̭ ̣̣̲R͖e͇̤͉̬g̵͎E̹̝ͅx̦̳̣p̱͍̹(͈͍̼̠̜̱̞" ^ ̺̦̭͙͙̙(͉͚̪͖ ? ̱̻͘ : ̛̤̗̗͓͕̬ "̭̳̳̺͚͇+͉͍͔̰̩̩͔Ṟ͕͔͜+̥̮̝" ̨̟̗̺̬̖ͅ)̟̜̖̹͙͘$҉̪͙͙ "̛̗͓̺ͅ,̲̬͕͚" ̥͎̺̫i̹̙̫̮͇͘ "̪̦̹)̳,͈ne͘e͙͞d҉͎sC҉̞̩̘ǫn̹t͍͚͔̠̙̣e̳͇̥x̪͠t̳̰̘́:̣̠̝͙̯͟n͚̬e͎̫̳̜̞w̷̼̳̜͍͙̮ ̣R̛e̵̹̪͖̲͎̘g̘̱͜E̱̘̞x̺̖͎͝p̢̗̲(̨̦̰͓̳̦͓͈" ̹̝ ^ ͠ "̷̣̮͍̠+̫͍̟͉̦̖̼M҉̣̬͉̫̦̥̩+̵̱ͅ" ̢͈̤̺ * ͇̮̩[̢͓̜͖̦̭ > ͖̤̖̦͓̬ + ͓̣̰̞̣~̱̝̗̖̖͚̕]̺͙ | ̣̲̭̣ͅ: ͎̟͉͈(͟e̱̘̫͝v͎͎̮̥e̗͙n̯̘̭͍͇͜ | ͎͎͉͞o̼͇̹̣̫dḏ̜̞͖́ | ͈̟̖̗͎e͢q͕̥͍̰ | ̦̹̤͍g̖̰̞͎̖̲t | ̨͙̥̣̱̰̦l̵t̬͉̞̪͉ | ̮n̷̰̭ṭ̶̻̦̞͍̣h͔͙ | f̵̣̬̱ͅį̟̖͖̥͇͕r͈͓̬͙͙͖s͙̟͉͖t҉̱̘̺ | ͝l̼͍͎̳a͓͓̯̫̭s̼͉͕̟̼t̰̤̀)̭͞(̴͚͕̺̻ ? ̸ : ̠̠̥̳̝ \ ̲̘̗̘͈̥͍ \ ̤(̴͉͎̥ "̧̗+̯̭͖̜M+͔͚̜͉͍̣" ̱̻̱̼͍̬̰ * (̘͙̥̙̙͇̪͜(͟ ? ̜͓̬ : ͅ - ̕ \ ͠ \ ̧d̕)̲͎̼̣̤̥̹͡ ? ̢̻͖͍̲͎ͅ \ ̮͓̤̦͚ \ ͔̼̱̲͇̜d * ̞̬̳̫̠̪̫͟)͉̱̟ "̷̤͓̬+̢̺͇̹̳̖ͅM̜̮̥̝͎+̵̯̥͍̤" ͖͖̲̮ * ̷͔̣̻̖̲̯͇ \ ̢ \ ̘)͓͉͕̜̳͈̱ | ̸̜)̷(̣͇̩͠ ? ̳̺͖̠͘ = ͈̫̣͙̦͙[̴̝͇̪̘ ^ ̷̥͍̝͎ͅ - ̩̜]̢̤ | ͎͙͚$̳͇̠̺̻́)̘̞̖̮̣̳ "̳̗̭̳̭͙̭͠,҉̗̺̹̗̮" i "̖̬͙̼)̥͎̖̤ͅ}̦͇̮,Y͉̳͍̩͖͟=̞͔͉̙̮̳/͓̯͙͖̝Ḥ̢̳̫TḾ͖̺̱͖̬L̮̳$̗͖̠̞̝ͅ/͍̮͓̣̰i̳̝̗̪͙̙,̢̻̮̲͎͉Q͙̼̪ͅ=̤̞̣͞/̯̫̠̗͍͙̪͢^̷̖͎̦͓̰͎ͅ(̧͚̖̟̦̠͎ͅ?̡̗̼͕̲͍̹:͉͉͙̞̖͖͘ͅị͓̟̞̝̘n͇͍͓͇̟͟ͅp̛̬͖̯͎ú͎̠̞͙͇t͈|̰͎̺͕̫͞ş͕͚͎̲͍̯ͅẹ̲̖̲̘͚͟l̗̥̞͎̤̝e͓̯̦c͙̩̤̟̪̟t͏̞͕͇͔̭ͅ|͖͙̟͔t̲͎̖̥̠é̗̪͚x̹̗t͔a̙̻̼͚̩r͇͉͇̫̺̠̦e̹͎̺̟̺͖͙͞a̯̝̩͜|̦̭͇͉̖̲b̵͔̱̭͙̱͕u̼͉̜̣̙͙tt̛̰̲̰̗o̕ń)̡͉͉$̭͙͈̞/̮͓̫̭̥̙̫̕i̫͎̫͚͡,͏̺̹̖̖J̣=͜/̻̮͍̰͞^҉h̼̣̥͕̻̼̺\̴̤̫͓̙͖̰͕d̴̬͖$̛̮̘̖̯͕̙/i̬̯̙̮̲̞͝ͅ,͓̯̞͎̥͢K=͍͍̰͉/̮^̤͕͔ͅ[̦̻̥͍͈͉̰́^͍{̤̥̰͇̦̠̞]̬͎̜̫̙͠+͇̘\̝̜̞{̪\̼̙͓̪͝s̙̺͠*̢̟͓̯͇̫̙\͙̠̠̖[͈̭n͔̞̖͉a͔̩͔̮͢t̺͍̖͠i͡v̷̻̖̪͔e͕̞̩͇ ̘͉\̶̲w҉̮̤̘/̥͇̯̮̱̘͈,̝̤̮Ź̦̥͔͎=/͏̣͙̳͈^҉̠͖͓(̡?̘̜̪̰̀:̺̖̭#̣͎͉̀(̸̜͚͎̙͈[̥̳̙̳͓͙ͅ\͕̙w-̹̮̭]͉͍͍̪̭̙͟+͝)̜̯̟|͖̫͇̖ͅ(̫̘̺̱͠\̫͕͓͞w̳͎̻̜͙͈̻+̪̝)̛̹̻̦|̠\̵.̪͉̦̦̥̰(͈͙͎[\͠ẁ̲̮͖-͓̝̫̹͍]͎͓̣̤̞+̗̱͕̀)͉)҉͔͕̱̖̣̫$̷̬͈̠/̨̱̲̤̻̦̪̜,̯̩̥̱̗͙͟e͇̝̣͔̫̟e=̙̜̙/̗͚̩̠̙[̛̪͔̞̞̠+̛̱͍̬~̢̙̹̻̘̪̱͚]̮̦̪̱̫̝̀/̫̬́,̺̖̘͕̣̗ͅt̡e̢̦̮͓̱͈̩̲=̥͖̭̜̘͓n̹̥͓e͢w̧̙̖̞ ̸̞̮̠͍̱͖̫R̲͘e̠̩̲̰̱̣g̗͔ͅE͓̰̼̥̜x̬̩̠p̦͈̲(̛͙͎̙" ̷̼͚ \ ̗̝̻̟̯͇̫͟ \ ̢͈̥̬̰ \ ̬̙̗͇͢ \ ̜̫̪̺̭͡[̝̼͇ \ ̣͚̝ \ ̥̞͓d̡a̸̦̖ - ̖̞̯̲̹f̖Ạ̧͖͓͕̼ - F̢̩͈̩]̘̕ {
                ̞͕̺̠͉1̷̫̙̯̤̣̪,
                ̩̦͠6͏̼̺
            }
            ̴̟͍̭̻͔̖̱ "̭̲͕̺̝̜+̩̻͍̙͎̱M͓̝̭͔+̶͈̘̗͈͇" ͚͙̮͞ ? ̩͉̰͎̲̖̥͡ | ̱̠̪̟̯̠ \ ͏̗̘͎̻̰ \ ̭̬͞ \ ̺̪̥͎͈͢ \ ̯̰̭̮̬̬̬(̷͔̮[̘ ^  \ ҉̻͚ \ ̼͓͇̻̩̦r͎̱̺̣ \\ ̶̻n̗̰͘ \ ̹ \ ͙̗f̳ͅ]̪)͕ "̪̼̜ͅ,̣͉̰̯͝" g̰̥ ")͖̲̫̹̲̳͘,͙͚̪̼n̪̬é=͘f̗͙̭͚u̝̠͇͚̦͔n̖̱cti̲̗̕o̩̙̦̦n̩͔̭(̱̱̜e̜̖̬̖̯̣̠͡,̨͔͕̞̮͈͕ͅt̝̻͎̦̪)̘̜̗̼̙͎̬{͇̩v̲͓̯a̬̘͟r̝͈̖̠̬̩̰ ̠n̥=̦́" ̳͜0̲̠̤ͅx͏͓̙̺̥̬ͅ "̙͓̹+̦͓̮̱̝̥e͏.̷̜̞̻̹̞͔ş̬͕̫̦͈l҉̣i̤̟͓͎c͉̦͇̰e̯̺(̧̺̤͕͇͚̮̳1̸̰̰̙̥)̬̘̣͉̼-̪͠6̜̟̱̘5̱̪̘̞̫5̥͇͉̪̬̕3̶̩6͎̀;̝r͏͕̥͙̙̼͙e̘̘̖t̬̻̯͔͙̗u͎̤͉̖ͅr̠͈̥̻̯n͓̤̘̺̖ ͉̯t҉̗̣̗̫̤̜|̨|̘̫͖͔̹͍(̴̦̩̮ń<̗̟͓̩0̤̤̱̠͉̠?̯͖͞S̫̘̱t̛̖̹̳̱̣r̝̫͚̯ͅͅi̟̪͉̘ͅng̶̯͍̙͇ͅ.̯̫͉̼̩͟ͅf̹̤̙͇̠́r̴o͍̙͈͚͝ͅm̜̘͎̘̖̥̣C̞̪͠h̘̗͖̙͇͙̠a̛̘̠̝rĆ͚̺̞̤̜o̪̮̺̭͈̲͕d̠͍͡e̵͈̝̺(̵̳̜n̞̺+̞̘͇͈̗͇6̘̠̜̳5͏̲͔̯͇̪5̷3̦̣͓͕̀6͚͓̹̩ͅ)̳͖̟:̮̟Ș͚̮̥̝ţ̟r̲i̳͕̬͕̩̤̱n̻̪̼g̰̳.̛̰͍̰͔ͅf̤́r̥͇̹o̷̩̳̩͚͖m̳̻C̩͎̪h͍̳̹̭̮̦͡a̼̖͘rC̱͖̪̯͍̻ͅoḑe(͚̦n̬̲>̛͔̼̤̯̪͕ͅ>̟̜̜̺̣͉1̙̖̻̥͔̯͝0̸͍̖̗̻|͟5̗̪̤͚̫̘̦5͏̺̘͖̤ͅ2͏̜͈9̟̰̤͉̤͇͓͟6͉͉͎͓̤͓,̴̦1̹͔̫̜̜̯͜0̯23̼͇̝̦͖͉ͅ&̦͖̤̻n̰̝͈͉͈|̭̗5̡̭̥6͓̮̼̹̟͙̘͢3̖̩͉͎̥̝͘2̦̻̭̻̬0̟̟̳͔͈̀)̰̠͟)̧̗͍}̘ͅ,̞̀r̵̬͉̬͙͖̳͓e=̲͈͓̯/̯̯̭̱͎͟(̜̯̤̠̗̮[̼̠͚͜\̮́0̬̞-̞̳̰͓͠\x̸1̷f̵̭͕ͅ\͈̥̞͟ͅx7̷f͔̥͓̤̣͓]̫̘̬̹̯͓ͅ|͘^̘̖͘-҉͔̫̺?̭̣͎̝͔͈\̠̣͔̞̝̖d͎͕̩͇͔͡)͓̱͖̺̩̗̥͡|͉̤̗͈͢^̹̩͚̣͎͢-̪͞$̸̹|̼̪̪̟̻͚[͏̰̥̜^̵̺͇͈̘͓̳̟\̨̭̠0̲-̫͍\͓̥̮̥x̘̳͞1͔̟̯̤̪͚̩͜f͟\̘̱͍̟͕x͙7̥̜͓̫ͅf-̹\̻̘̲ͅͅu͙̪̹̫̕F͎͓̩̥̭̕F̤̜F̳̙͇̲͝ͅF̨̩\̭̹͚̮̬͠w̶̙̠̞̮͕-̖̺̻̫̥]͎̻͈͙/͎͕͡g͉̞̤̻,̥̳̩͇i̵̬e=͡f̞̕u̬̩̙͖̗̯͈n̡̯̟̣̭̹̘c̩͇̤͉t̵̗̻͖̭i̴͇͚̘̪̟͔͓ơ͙n̵̦̠̭͈̞̫͉(͚e̬̼,̙t̵̝̹̰̳ͅ)͏͍̼̝͕͓{̹̬̤͎̟̝͙͞re͡t̻͙̻u͖̦r͏̦͍̼̰̞̦̰n͍̥̺̱͘ ̞̤̦͝t̹̩̬̦?̹̤̭͡" ̺̞̜̝̜ \ ͔͍͈̤͚̜0̞͙̼ "̛͓̯=̥͖͉==̟̩͎̘̣͍e̫͓̬̥?͍͔" ̴̬͚͎̮ \ ͟u̺̞͔f̧f̱̩̬̬̥̙̦͡f͏̲̤͓d̡ "͓͍:̱̱͡e̠̬̘̭͚̩.͏͔͙̪̫̥͓s̮̙̤̝̭̲̜͘li͖c̵̮̱̳e͔̲̮̳̱̤̰(͜0̹̱͓,̞͖̖̰̻-̫̺̖͖͘1͈̕)̢͉̰̠̮͕͖+̘̳̩" ̶̩̝͕̪̦ \ ͓̹ \ ̟ͅ "͍̟͕͔̩+̜͇e̼̘͉̭ͅ.̢̪̠̖͍c̹̣͖̲̭͖̝h͎̫͉̖͓̦̳͝a̘̻͇̞͖r̦̩̟̻̠͕ͅC͔̰͚̳͟o̼̫̦͖̦̼d̸͕͈͕̘̘ͅe̞͕A͇͖̟̭̕t͎(͚͔̼͚̰͓͝e͈̩͡.̛̪͓l̜̘ḙn̲̪̰͖̗̯͚g̼̬̼̬̲͚̝t̹͍̖̪̤̪̞h̤̝̞̝̜-1̞̻̤)̻̤̣͖͈͓.̺͠t͍ͅͅo̡S̺̤̣͈̲̜̭͠t̹͔̜͢r͍̩̞i̢͙͔͚̣̰͇̝n̢͕g̠̣(̹̠́1͠6̰̮͙̝)҉̭͙̯̥̜͈͉+" ̕ ̻̝̳ "͏͉̰̫:̴̙̥̱͓̻̤͔" ͕̦͎̞͉ \ ͚̬̰͙͚̘̜ \ ̩͍ "̬̠̭̪̠͡ͅ+͏̱͇͖̦̮ͅe̟̗̥͚̣̣̯}͎̮̟̪,͍̩̖̳̹͙ọ̴͚e̪̻̙̖͓=̱̝f̨̞̖̭̝̤͓u̖̲̜̺̮n̞͇͚͈̝̦͟ct̲͈̲͕͉i̬̹̠̦̲ͅo͙n̟̼͉̰̮͙̯(̡̻̘̪̜̩)͚͇͠{̷̲̤͇̙T̀(̹̻͕̹̻̬͝ͅ)̣}̜̳̫̼̭͖ͅ,̺̘̣̙̹a̷͚̹͓̳͓̗̭ę̤=̡͙b̧̮̳͇̘̺e̦͙̺͓̬(҉̤͉̠͍̘f͢u̧̙̖n̞̫͡c͖͙͔t̥̰̪̰̱̘͇i̮̞͍̳̪̗̲͠on̰͠(̤͉͉͎̹̭͠ͅe͙͞ͅ)̧{r͔̠e̝͚̮̺̯̙t͍̟̹͖̩͕u͎̖̲̣̻̳͍r̕ņ̻͙̗̤ͅ!̺͎̜̤0=̶͍̲͚͚=̯͝=̯̺̫̱̕e̙̭͕͇̜ͅ.̙̘͎̠d̝̤̟̤i̻̯̰͕̠͝ͅs̯̠a̵b̼͕ḻ͇̦̣̣ͅé͎̺̤̪͇̮d̟̬͔̤&̱&̮͕̳̻̬̯̭͡" ̤̺͞f̫̹̗̯̦͙̩i̵̬͔ȩ̯̹͚̟l̳̲̮̘d̮̼̠̠s̮̗͍͇̗͟e͍͞t̥ "̹͓̣̜͇=̤̣̤̱͓̠̳=̦͙̻͞=̺e̯.̙ńo͠d҉̞̞̩̬ͅe̷N͖͉a̙̩̪̺̕m̕e̹͍̤̭͓.̨͈t̼͞ơ͕L͇̰͍͕o͖w̥͓̰̩̜̦e̪͎̙̗͓̜̕r̼̺̭̮̤̩͙C͓͘a̫͎̘̜̮̗͠s̵͖͓̦e̺(͔̞̞ͅ)̼͕}͏̩,{̵̱̞͕d̖̲̱̼̦̤͇i̴r̬:͎̕" ̞͞p̤̳ͅͅa̭̫͕̣̥̜̲r͇̝͘en͈̱̘t̮̀Ṇ̡̬̪̺̭͉͓o̥͍͠d͉̠̰̞͇̟e̷͓̜̰͈̭͇ "̼̹̬͍͡,͎̙̞̞̜̰n͏̼ex͘t̬̬̠̣̳̰:͖͕̲͎̻̟ͅ" ̳̰̖̤̭l̩̠̳eͅͅg̨͚̘͈̮̹̗̙e̬͇͈̩n̶̼d̳̱̪̯ "̲̞͕͓̼́}̲͕͔̻͚)̮͖;͢t̴͍̲r̻̥y̟̞͍̳̻͓̠{H͉̘̫̜͘.̟̰́a̱̳̗ͅp̪̹̲̼̥͚̝p̪̹̩͍l̪̣̼̭̗͜y̮̹̭̝̙(̰̼͝t̩͔̩̯̰̯=͉̱͕Ơ͕̲̺̫.ͅc̪͓al̦̻̼͝l̺͇̬̼͞(̼̫͇͈̹͚p̛̭̤̯̮̺̻.̮̲ç̞̦̪̞h̦̗̥͈i̗̹̞̗͖̺̕ͅl̯͠dN̨̝̭̳̳͙͇o̦̹̤̠͓͈d̟̭̥̩̣̼e͍͓̞̼̬s̷͍̩̰͇͈)͈,͚̖p̠̮̳̟̻̖̰͜.̣͈̬c͔͠h̺̪͠i̳͕̻̜͔̺ḷ̜d͏N̳̣̤̰͙̯̞o̘̯d͖̙̠̟̯͓͡e͍͡s͉͍)̦͞,̜ţ̼̠̟̫͙[̟̟̠̮͜p̫̪̲͙.̬̩͕̤͉̪c̗̝̻̹͔̮͡h̜̯͔͘i̵̟̯̤̰̜l̻͞ḍ̲̙̬̖̘̪N̹̘͝o͔̗d͇̖̹̮̭e͎͓͝s̙̗̬̙̖̠̥͘.̖̹̻l̶͖e̳̠̰͔͡n̶̜̩͉g̥͈̻͖̝̀ṱ̸̣̼ͅͅh̵̗͕͈̫̣̠͙]҉.͉͙̠ṇ̢͙͉̙̱͔ͅo͎̝͓̮͠d̦̞̠̼e̛̼͙T͠y̩̥̮͙p̟̯̘̺͔e̢͙̩̥̘}̝̲̼̖͜c̝̣̝̻̘ͅa̟̹͕͉̩̳̖͞t̪c̨̖̙͇̬͈ḫ̹̠̼̩̲(͚͉̦̤̭e͔)̻͕̼̟̮͇̱{̡̺͍̘͎̫̬̠Ḥ͇=̰͓̙͚̦̱͘{̧a͕̟̫̖̩̭p͏̟͖͓̜p̣̦͖l̜̬̜̫̫y̤̯͓̜͎͓:̰̩̦̼̫̥̞͘t̤͚̹̗̰.̙̫̺̳̹l̩̭e̯͢ṇ̷̞̻̫̟ͅg͍̤̻̺̬͠ṱ̴h͏̲̫͍̪̟̘̳?̻̹̺̣̥̦̥f̺͙̬̩̘͡u̬̰̤̪ǹ͇̙c͏̣̗̬̤̩̦̥t̤̥̟̳̪i̯͈̝o̢̹̞͇̥̳̪n̳(̸̥̙̹̭͕e̼,͏̗ṭ̺͠)͚̜̬͈̭̕{͔̙͈̝̠͎L͖͕̺.a̞p͓̯̤̗̦p̰̘͈̙̮l̙̤͔̟̟̻͈͘y̨(̤̀e̹͔̜,͈͔̥̠͇͞O͉̞̱̝.͏̥̱̺̣̭͉̻c̳͔̠̥͓͙ͅa̹̺̺̤̳̞̙ḻ̻͓̼l̴̪̘̗̦(̻͡t̳̗̹͙ͅ))̨}:̻͉̯͔̖̟̦f̴̞̼͉̰̦̭̞u͎̭̪͖n̖ct̻͈͇̫̻̱i̙o̹͈̗̠͓͘n̯(͚̯̦e͎̝̦̮͎͇̺,̴t̶̪̳̠̮͈̘̘)͍̱̠̪{̸͉̱͇̙v̷͎̦a̴̙̝͍̰r͕͚͡ͅ ͕̟ņ̗̯=̩͡e̳͓̮.̠͙̝̞͖̟̠l̡̖̘̝͔e̘͚̦̫̠ņg̱͍͇̭̹̳̖t̮͚͔̜͠h̢̠͉͓̲̭,̘r̟̪̣̳̲̙̻=̤̠̤̰͉͔0̷̩͉̺̟̲;̰̳̳̻w̵̻͓̻̺̗h͖̳̫͖̮̞i̪̯͚̪͕̤̹l̗͎͍̗͞e̸̙̳(̗̻͖͕̝̙͡e̵̮͖̫ͅ[̧̬̗̭̦̭̫ṉ̪͍ͅͅ+͜+̼̳̬̼̠̕]̷̣͇=͉t͔̙̹̤[̝̤̤̮͙͓r+̘̪+̹̰̖́]̷)̮̲͖͢;̯̕ͅe̟͔̤̞̜͖̭.̫̖l̛͕ȩ͍̳̪̹̭n̫ͅg̦̦t͇͎̪͚̖͢ͅh͚͎͉̱̺͚=̨̮͎͕̝͉͎̩n͉͚-͙̜1͞}̧̮͉͍̭̪͔̼}̮̙͖̬͇̀}͕̺͚f͔̲͍͖̺ṷ̮͉n҉̲̹̝̼̦̞̝c̶̹t̪͈͚̺̲̜̹i҉̖ơ̗̣̹̫̟̮ṉ̶̣̺͓ ̼͍̖͉̺͇͘s̤̯ę̙̦(̯͉̥ͅt̟̲̼ͅ,̮̳͖̣͚e̴̜,̵̘n̥̦͝,͍̝̺͝r̦͉͍)̝̫͓{̮̬͇̞̳̬̖v̙͕̬̤̯̥̠a̢̯̰̝͈r̜ ̵i͖̩̣̱,o̯̟͉̘͚̙͠,̖̠̹͔a̞,͚͇͜s̤,̷̙̱̱̺ͅu̥͇͉͓̫,͖̻͖̖̦ĺ̤̩,̸̦͍̻̮͚̻̮c̦͚̥̤͓̞̫,̺̝̥̙ͅf=̶ḛ&̟̝̬&̥̻̣̟̹ͅe̦̖̭̰̖.͕̝̯̻͔̜͕o͉̘̹̰̖̲͞w̜͚͕̻̲̠n̞̟͕̺̥̺ͅe̳̲̞͍̠̤ͅr͖̬̬̤͚̹͔D̳̮̤̦͜o̫c̳̩͎͓̪͢u̞̯m̴̞̱̲̭͉ͅe͉͈͖͔n͘t̛̠̻̤̟,̼̭̘̥͕̤p͚͇=̜͖̟̭͎͕̟ḛ̷̬̲̠?͖̙̭e̸̮̦̼̟̼.̡̻n̵̤̞ò͓͎d͇͓͕͕͍͢ę̬̯͚̩T̴͈y̬̲̺͘p̲e͕̜͡:͔͝9̵̺;i̪͉̳̹̙̥f͓̖̯̺͚̟(͚̱̫̪n̪̗̫̦=̘̺n̺̼͓͢|͍͍̝̯̭|̪͢[̨͉͔̲͓͎]̪,͖͔̼̹̟" ̥̙̝̻͍͔͞s̶̥̠͚̦ţ̘̠r̖͙̱̰̝̘̱į̠ͅn̗̲̱g̺̻̦̞ "̘͚͠!̩͖̺͘=̩͟t͏͕̯̼y҉̖p̶̣ͅḛ̫̀o̷̯͓̹͕̱̺f̥̠̥͎͍̫̮ ̨̟̝̼̹̺͍ͅt̖͍̠̟̺|͍|͇͎͖͖!̙͝t҉͉|̷̳̹̹̠̻|̘̞͍1̧̻͉!͡=͙̼͞=̖̺̹p̪̗͇͓̗̰&̲̻͍͇̮̭̣&̷̬̳͖͖͇9̞́!̻̖̪͢=̼̩̜̞͓͚ͅ=̠̞p̜͎̳̘͎̰̤͠&̲̰̼̠&͏͙̞͖͓̭͇1͇͢1̫̪̝̳͙̱!̢̞̰=̩̤̥͈=̞͔p͔̞͕͜)̜̼̟̯̫r̷e̖̪̩̻̬͖͜t̸̞̺̞̬͚̼ur̸n̖̝̹̩̲ ̲̲̗͢ṇ̜͕͕͖̠;̸͖͈̙̗̝i͉̙̪̻͓͕̜f̟̫͎̭̫̲͢(̮͟!r͡&̴͈̝̝&̰̠̹͔̫̖(͝T̸̻(̞̞͖̼e̤̦̣̣͠)̟̹,̤̬̯̩͉͈͈e̖͜=̷͈̰͓͕e̸͇̞͇|͖͈͔͉͟|̵̤̰C̯̦̼̰͟,̨É̯̖̟͍̠̭)͙̜)͕̩̲{̷̗̩̖̪̟i̮̙̖̗̜̰̕ͅf̭̻(̡̘1̼̗͕̜1͇͎͟!͍̳̺̟͢=̰̭͕͔=̥̺̬p̥͚͇̰̼̬&̲̲&̶̜̱̖̩̭̫͔(̼̀u͏̺̣̪=͓̜̩̻̩̝Z̢͉̟̠̭͉.̤̯̥̲e͇͍x̴͙̩͍̯͓̰e̢̹̹c̠͓̰̩͓̜̀(̱̘̱̦̮̯͈t̜̲)͍̞)͖͚̮̞̩͘)͙͜i͕f̧͔͚͖͍͓̙̩(̥̭̣͔̞̘͘i̖=̲̩̼̬͜ṵ̣͍̘[̩͚̫̩̲̕1̮̤̝]͖̭͓͕̜̫̯͞)̧̰͇̲{̩͍i̧͉͇̞f̪͎̘̩̝͕̻͘(̞̲͚̀9̤͎̲͚̹͢=̢=̬̬̞͖̥̞͞=͖̞̣̥ͅp̢ͅ)̺͔̦̯̳̗{i̪̞̞͈̟͟ͅf̥̦͍(!(̞̩͔͉͉a͉̙̹͔̣=̟͙͔e̛̗.̯̹̼̜g̠͕̫̘̗ͅe͕͇t̶̟͔̤̠̖̠̯E͖͉̝l̻͖͍̭̥͢e̳̣͎̭m̷̟̞e͕̼͡n̨̫͈̣̞͚͙t̻̯̮͇͔͢B̤̘̹̱͇̟y̞̦͎̕ͅI̬͓͝d̮̼͎̠(̣̣̯͟ì̤̭̘͍)̛͇̰̬̟ͅ)̜̭̼)̸̦͉͇̭̝͎r̰͉̙̻̠̀ͅe̬t̘̺͠u͘r̯n͍ n;̠̙i̷f҉̮͙͚̩̹̮͔(͙͍͉a̶̫̲͔̺͉̮.̡͇̙i̸̱̪͈̖d̝=̭̖̘͇͚̪̟≠̗͈͎̦̫̩=̮̤i̹̖̫͟)̧̩̦̜̘̺r̮͞e͔̼̬̙̰͝ţ̬̹̱̮̗̪̼u̦̫͈͔͓͎̼r͖͜ṉ̙̲ ̷̙̮̹̭ṇ̣͔.̰͎̱̺p̧͓̙̞̩̟͙ư͓͎͉̰̖̣s̙̻̮͎͎̺͚h͇͡(͕̖a͈̖)͕͢,̴͉͖n̗}̩̤e̷͔̜̦̲̣͇͔l̖̰s̬̫̭e͎ ͕͓͍͓̦̞̩͞i̠̞͖̜͉̖f͍̰̫̯(̞̝̙̖͜f&̰͠&͕͖͉̱̮(̧̞a̲̪=̡͎̭̣̟̣̩f̱͓͎̦̀.̼͚͓̭͖͝ͅͅg̴̹͓̼̟e̼̳̬͖̰̬͟tE̤͉̹̯̻̼̖̕l̬e̘̞m̨̖̘̠e̠̲̹̘̙̫n̷͖̜̰̖̭tB̲̤y̢͍͖I̗̳̙d̴̗̭͙̯̘̙̭(͕͈͝i͜)͉͍͕͓̦)̞͈&̲̪̫̺͓̹̱&̖y̧̬(̯͕̙̺͔e̳,̮̟͔͕a͖̫̜̘̺̖)̨&̙͙̺̘͉&͍̥͈a͍̮͍͎͓͠.̵͎̖̝̪̗i̢d̹̮̮=̠̺̦͍͙=̟ͅ=̺̙͎̣̭͇̪i̯͠)̴̣̞̥͎ͅr̝̦͟e͕͉̤͓͙͎t̤u̫r̡̫̝̠̰̘̮ͅn̦̻̬͙̲͕̼ ̩̭̗̥͖̥͍n͖̥.͟p͇̜͇u͍͘s̺̱̲̩h̘́(̸a̘̠̳͈̦͙͠ͅ)͚̕,͎̜͇̝͎̭ͅn}̫̣̮͇̗͕ͅe͈͕̲͈ĺs̥̜͚̞̫e̜͕̱̮̱̬{͎̱͓͎̜̀ḭ̪͚̞͓͝f͠(̨̦̖̤u̝̤̝͍[̮2͈̳͓͔̝ͅ]͓̘̭̙͔̠͙͘)̹͇̩re̱̪̰t̺̪̗̯͕ͅu̴̩̜̮̳r̢͎̼͖̟̲n̺̮̞̱̖̼ ̶͉̝͇̠̫̳̬H̨̦͈̮̼.̥͓̣̘͢a̯̹̻̬̖̘p̀p̜̗̻͇̩l͠y̺̖̖(̖̺̲̮́n̮,͚è̝̖̭̞̳̰͈.̲̰̻̜̭̠́g̤͍͕̼͔e̖̖tE̠̬̟̙̹ͅl̥͙̤͈͠e̯̩̗̹͢m̢̻e͖n͍̥̝̻t̹̗s̙̭B͕̺̗̩̰̙͇y̦͇̟T҉a̸̗͔̱g̥̹͈̙̻̭̀N͢a̴̼̳̯̥̗m̠̮͍e̢͈̤̲͈(̻͜t̠̗̘̱̯))̢͚̱,̸̪͈̱̻n͈̹͓͉͇;̼̬̠͙̩̱̠͠i̡̜͓̙̼͇̻f̻̠̥̱̱̬(͖͉(ḭ͇̥=̛̲̺̙ú̙͈̗̺[̶̬̪͎͔3̨͎̣̱̯̞]̕)͚̲̩̘̣͖͚&̻&̟̣̲͖̟̹̫d̛͖̪̰̻̗͕̲.̠͔͍̯͞g̥͝e̝̘̺̦̭̬ţ̟͈̺̥͙E͚͓̭̩͚le͍̥m̵͍͉̟̘̮͔e͏n̞̤͈͚̰t̡̠̝̳͙s͇͈͔̭̫͍̮B͚̤̹̤̦͝y͔͓͇̦̠͎̬C̜̪̜̬͔͉l҉̠a̮͎̜͙̙s͇̬̫͟s̤̥͜N̙͖͙͍̺̟a̢͎̟͖̞͓̱ͅm̦̣̪̲̜͈͞è̜͎͉̲͔&͢&̶̮e͎̥͙͈̻̹̹.̫̘̖͠g͇e̳̫t͓̘̳͓͔̰̞E̩͇l̞̹em̮en͏͇̥ṯ͕̮͍̺s͇̦͎͝B̛̬͚̙̞̦̪ͅy̯C̴͓͉̭͔͎̦ĺ̻̪̙͓̼͍ͅą̞̟̮ś̞s̶͕̯N͕̲̹̳̦̼am̼̥̠͙e̫̫)҉̟̻r̫͚̹̘̳͠et͔̯͇͉̬̝u̪͓͖ṟ̫͓̲̦ǹ̤̫͓̹̮̝̩ ̙͖͔H̫̦͎ͅ.͇̖̹̜̲͔̲͢a̮̳̦p̙̪̬̟̙͢p̠̺̹͎͘l̜y͙̗̝̖(͕͖̠͔͇̕n̝̹̦̯͖͓͔,̸e̞̞̦̘.g҉̯̭̻e͎̳̗ţ͙̤͓̹̖̗El͈̻e̸͍̥̟̼̞m͙͙̲͟e̵͎͙n̴̰̲̟t̠͎ͅs҉͓̝B͈̠̻̙͙ͅy̨͎̣͎C̢̺̲͚̩̹ĺ̖̘̩̩̘͇ͅa̛͕s̙̱̘̭sN̢̖̺͇̭̻a̡̖m҉̪̹͇͕̖̣̼e̦̖̖̜̰̙(̤͚̮̗̳̤͖i̵̟͎̲))͇͇̘̺̫,̣̜̮͓͇͈̲n҉̻͍̥̩}̷̱͍̦̗͕ͅi̬͘f̛(͉̱̯̪̰̠̪d͍̘̣͖̺̬́ͅ.̝͙̲̦q̪̫̥̳̖̀s̹ͅa&̠͢&̜͕̤̮̙͙̕!̵N̩̕[̟͉̼t҉̦̭+̞̭͍" ̙͍̞̭ ͎̩͙̞̜͕̀ "̸̭͓̻]͍̼̖͔̭̼͖&̹͕̤̙͇̱ͅ&̭͇̞͈(̵̦̦͈!̰̬͍̙̼̩̕v|̝̞͎̱͙͟|̛!̤̖̣̬͚̳͕v̦͍̥̬̣̟.̯̺̻̗͔̣t͚͖͍̹̱e͢st̹̗̣͘(͓̝̞̥̯͓̙t̨̫̼͖͈̬̲̰))͔̹̤̟̮&̝̣̰̮̰͞&̤̱(̸͍̰̰̝͖̟1̶͙̼͎̙̗̯̬!̗͔̪̺=̴͉̥̖̺=̴̲̗p͖̤̬͔̯͉̠|̬͟|̛̻̤̥̬̙̝" ̛̙̹͕̻͍̠obj̵̠͕̘ec̛t̞̰̙̦ͅ "͈͙̰̜̱̣͓!̝=̮̞͖͕͇̱̣͞=̭è̞͇̣̖̩ͅ.̡͖̱͇̺ń̘̺̟o̜̦͈̻̙͠d̬͎̳̫͕̟̜e̹N̡͈a̠̳͇̻̝̥m̥̱̳e̡.̧͖͖to̶̜͔̪̰͖ͅL͜o̼w̲͎͘e͏̪͔̻̳ͅr̟͚̲̼ͅC̱̮̘͖̞̗a͉̝̺s͖͎̘̦e̴͈̥(̶̰̗͖̻̜)͉̟͞)̰͚̜ͅ)͇̘̰̱̠{̸͚͇͖̰̟̻̙i͍̠f̛͍͈͕̺̤͉̱(̸̫̙̥c̯=̬͖̜͙̮͠ͅt̺͖͚̼,̴̬f̙̯̭͎=̞̪̯͇̤̪̘e̷͚̰̩̫̭̪,̷1̬͖̜̹̣̻=̀=͏̮̗̦̖=p̸̭̼̖̝&͍͙̭̩̮&͝(͟U̷̲̺͎̻͎.̟̦̮ͅt̻͕͈̲̕és͙̰̻̘͔͘t̫̼̤̩͕̲(̕t̖͖̠̱)̺̮̝̮͍̝|͚̤͈̞̯|̥̪͍͖̗̞͖z̩̗͙̲̕.͉̣̳t̡͎̘ͅḛ̰̣̹̻̱̰s͔͖͓t̮̗̱̞̗̦(̵͔̦͎͔̥ͅt̶͕)̵͎̭̲̖͓)̻͖̺̹͙̣)͖͉͠{̜̦̲̬(̴͕f͕̮͎̰͎̭͎=̳̮̹è̦̮̝͖ͅe҉̫͓̟̤̯.͍͞t͍̦e̱̳̮͍̗̦s͓͓̩̹̝̩ͅt̜̲͚̯̫̥̳͞(̘̙̗ͅt͖̻̦̫͢)̫͍̠͎̼&̝̫̪̗̮̘̼͟&y̸̱͓̱͕e̟(͎̬̫̲̯̖͝e̖͉̟͎̰.͙̹p̴̺̣̻a̡̙͍͓̤̣r͔̺̖͖͜e̞̤̗͕̰n̟̪t͙̗̻N̬̪͎̼͇̤̭o̧͈̱̙̰̗̰͎d̼̦͇e̳̣̪̙̦̦͓)̶̲̬̮|̬̗̦̭́|̵̮͓̲̫̣̤e̙)̼̭͖̮=͍̞̦̳̜̫̙≠͉=͉̱̠͈̦e̠͎̱&̜͈͓̖̱͝&͖d̥.̯̗s̻̫̘͜c̪̠͙̬͈̮̱o̼p̹̪̖͚e̶̗|̝̟̠͠|̷̥̣̲̼(̟̖̟͙͔͇̮(̩̖͙̥s̥̜̻̀=͏͇̳͈͙e̢̘.͕g͈e̖͎̩t̤͍͜A̵̼͙̱̩t͇͔̖̮͍̰ͅt҉̜̙̰̖̟̙͔r̛i̳̱̲̩bu̼̺̪͉̼͓t̠̣̝̙̞̪̥́e̪̟̘̹̖̙͢(̛͖̣" ̤̟̻͔̱̘͎i̻̠͍d̳̬͢ "̰̪̠͜)̶͎̯͈)̗̫͕͚̘̞?s̩͉̹͕̰=̶̝̠͓̘̗̙s̨̹͖̘̼͇.͎̙͚̯͔̰ͅr̤̙̰̀è̞̘̪p̮͈ḽ͖̜̖a̴͚͔̮c͙̫ͅè͙(̳r̨̬͈̳̭̺̣͎e̙̗͔̙͔̻͡,̯̜̠̦i͍͙͓̣e͇͇͙͍͚̙̲)̡̝̤͈̙̱:̰̥̹̳̙̩e̦̙͎̥̪̻̤.s̟̗̗͠e̳̺̳͕t̗A͕͍t̡̳͖̝̩͈t͎̯̙̞̞̜̲r͈̜̮i͕̳b͔͇̤ut҉͓͈̙ḙ̼̻̪ͅ(" ̵̙̳̗̮̬i̤͖̼̲̦̦̳͠d̜̩͇̲̟͔̟ "͔͈͟,͉̙̖̜s͇̲̲̺͘=S̺͈͕)̨̼̩͎͔̖̖)̭͔͉́ͅ,͎͔͇̺̹̳̹ò̱̪=̯̦(̲̣̯l̹̣̗̝͞=h̗͖̥͕(̮̗͖̮͚t̨͉͉̗̺ͅ)͞)̹̣̼̭͜.͎͡l̘͇e̩͘n̴̺͈̩gt͙͚h̷̹͕̲̼̦;͇̭̠͚̞̩͕͝wh̛͚̼̦͎̩̼il̤̰é͎(̟̜͚͍͖͖̹ọ͇-̨̙͔̺-̵̤͚)̯͇̼̕l̵[o̩͎͔͚̣͘]̹̗̘̺̤̭=̖(̼͉̞͠ͅs̪̰͚̼͖͖̥?͙̕" ͈̰̤̀ # ͅ "̲͢+͔̫s̞̱͙̹̰̫:̱̤̥̳̺ͅ" : ̟̭͔͔̭̱sc͕͉o̧͓̘p̞͇̞̥͈̖̘e҉ "͖̮͍̫̯̩͝)̛̺͔̥͚̳̤+̷̘͈̼̣̗" ̝̭̞̤̠̞ͅ ̶̰̝̥̜ "̷̹+̵̭x̺̜̠̠̳̦e̛̲̹̤(̶̹̲̘̞̦l̙͈̰̙̻̗͔[o̻̺͔̕]̳͔͕͉̻̖͠ͅ)͍͇͉̻̙;҉̱c͏̰=̡l҉̲̹͓.̨̯̙͍͓̙ͅj͈ó̳ị͖͕̻͓n̲̣̜(̧͖̱͎̬͎" ̡̦,
            ͇̙͡ "̷)}͎̻̰͈̰͢t̬͕̩̤r͟ỵ{̧̹̹̬r̶͎̖̗̥͎ę̞̤̖̲͎̲t̺u̧͕r̢̠̼̟̫n͚ ̠̪͓H̵̘̼̦̝̖͎.͈̝a̧̗̤͖̙̺̻p͈͓̪̝͕̩p̴̤̜̰̖͇͕ĺ̥̯̦͔̮y͘(̠̗͚̘͓̫̗n̨,̷̦̬̱̦̫̟͔f͈͇̱̬͚ͅ.͇͘q̢̭u̧͙͎̱̖̪ͅe̳̠̪͝r̼̦͇͜ͅy͓̦̻͚̤̱̹͜S͎͈̝̱͘e̠̭̗͇̣l͔͎̻e͖͙͍͢c͕͞t҉̼̬͇̱̬o̫̰̲̺̻̼̥r̭͖͠A̬̦̜̙̘l̙̥l̸̜̙͍̞̪̲̤(̡̱̫̫̞̦̩c͖͙̬))̪̜̮̼̲,̮͞n̤͡}͞c̱̙a̫̱͇͔͝t͏c̙̖̗̜̥ͅh̷̬̟̭(̰̯e̤̹͉͍̹̙͙)̮ͅ{̖̤͍͔̠̳N̶̞(̬̻ṯ͝ͅ,͇͉̟͘!͔͎͚̥͚͡0)̙̕}̸̜̻͙̗̟̜̬f̷͕͙̭̜̳͓ìn̩̥à̞̪̞̠̟̫l͚͕͇l͏̖̭̞y{̸̦̣̹͍s=͔͇͍̠̳̘=͕͘=̱̭̹̙͍S̘̙̙͍̫͟&̡͙͕͎̞̮̥&̩̘̝̲͇͇e̝̩͓̦͉.̡͎r̹̜̫͓̕e̳͈̲̤m̭͖͙͇̘̱͢o̬͙̖̩͔̯̕v̬͍̳̘͙͍̺ẹẠ̦̙̤̖t͈̝̗̗̯tr̲̫ḭ̢b̶̟͔̺̹̦̮u̖̗̩͈͓t͉̙̤̰͈̰̱e̲̜(̲̟̹̹̘̥̦́" ̨̩͖͇̫̙i͈d̕ "͉̰̞̟̰)̥̰̖̪}̹̬̠̝͓͍̰}̩͓͓̺͖̕}̹̦̬̕r̼̻̝̯̥̻͟ͅe͏̟͕t̸̪̹̻̹̬̭̦ụ̩͈͇͖̙ṛn̤̗̺̥͇̻ͅ ̸̼̗̹̲͕̘g͎(͓̼̘̞̳t̷͕͚̩.͟re̮͕̫̼͎̻pl̺̪͉a͈̗̹̪̭̲̯c͇̲̰̱̰e(̷͖̪̙͖͍͇$͈̖͔̬͔̻̝,̠ͅͅ" ̵̱̭͕͔̥̱̹$1̖̮̱̺͍͎͜ "̝̝̘̮ͅ)͙̮̟̯͇̭,e̞͔̗̠͉͕ͅ,̹͘n͔͈̲̞,̵ṟ̶͓̗)̭̲̝̤̼̙}̣͕̩̲ͅf̯u̵n̨̻̯͖c͙͇̹̞ţ̬̦̰̫i̺̤o̢͔̖͕͇̘͕n͢ ͕͉̲̼͍̭u̻̺̣͕͉ͅe҉̲̭̬̥͔ͅ(̵̰̥̙̩̜ͅ)̛{̙͔͖͟v͇͙̱̩a̖̝̜̘̼̙r̨͖ ͏r̠͎=͕ͅ[̢̮͕̣̗͔̗͖]͕̟̳̟̤;̞͍̪̣r̨̳͈͇͚̞̪ḛ͇̜̜̞̹͚̕t̨͔u͕̤͔̗̳r͏̦n҉̙̤̙̗͍ ̗͍̥̗͓̘͚f̢̘̼̠̲̻̺ͅu̬̺̯̜̪̙͝n̛̤c͉̰̬̘t͎̜ͅi̵͈̼̟o̞̗̻n̜͚̳̬͖ ̼͓̘̖̼͡e̗̞ͅ(҉̱͍̭̠͍̩t͖,ǹ̳̝͙̜͚)̪{̢r̞̥̙̰è̩t̗͞ͅuṛ͖̼n̪̬̫͖͈̦͈ ͔͍̗͓͚͈̕r̩͎͖̺̲̙͡.͇̬̹p͕̥͞u͏̜̘̳͙̼̳sh͙̘͍̟͓̳(͙t̤̺͙̟͝ͅ+̯̺̹̫" ̯͉̙ ̴̗ "҉͇̘̻̜̤̺̬)͔̝̝̝̠̯͕͟>҉b͙̫̦.̳c̠̜̩a̟̺̜͘c̺͎̩h͖̤͙̹e̻̪̪̬̫̩L̜͙̮̳̤͙͕e̙̘̱ṋ̱̟̩̪͉g͚͔͉th̺͇͢&̺͇͕̬&̩͡d͖͖̞̬͕̠̬è̹̺̠͖l̤̘̪͈̺̜͘e̞te͈̙̥̺̥̳͖ ̸͇̙̗̦ȩ̰[͏͕̯͚̥̹ṛ͉̙.̯̺̥s͕̫̟̻̥͉̱h̠͇̤̦͎͓͈í̞̦f̙̻͓ṯ̵̖͖̝͓͖(͓̜̜̯̻)͈̙̣̞̼͔̲]̳͉͕͍͚,̘e͇͢[̧̺̣̝̖̦ṱ̛̘͓ͅ+̸" ̢͎̩̻͎͚̟̣ "̣]̟͉̙̩̼͢=̱̩̻̀n̴̰ͅ}̠̣̪̲̮}̣̻̘̳̱̼̀f͢u͓n̺̭̱̻̺̰̤c̠͡t̟̳̘i̯o̞̹̠̼̘͢n ̤̙̣̼͇̲͓ļ̦̳͇͔e͎̘̠̺̰ͅ(̷̗͈̗͔̮e̛̬̞̫̘͎)̡̙͙̭̜͍̼ͅ{̸͈͍̥̪ͅr̩̟̣̯̼̹̲e̶̪̭͙̭̭͔ͅt͈̹̝̫͎͓̼͘u̵̞̪͓̪͍r̼͡n̵̩ ͍ͅe͕̬͍̣͎̰͕[̣̹̻̳̗̯̗͟S]̨̩̮̜̣͙̭=͉̭̘̣̲!0̵̖͍̼,̞̜̮͍̹͝e̝͈̱̙̲̱}̫̺͕̟̤͉f̯̤̼̻u̵̮̳nc͎̝͖͙t̻̝̗̼̬i̮̼o̗̱͈n̞̝̞̜ ̥͍̩̫ce͕(̘̩e̹̰͉̖̱̹)̟̫̣{̳̤̙v͟a͉̙͇̬̥r͎ t̝̭̺ͅ=̮̫C̵.͕̜̫͇̪͓c̤̤̲r̖̪̻̩̤̯ȩ̟̲͔̯a͓̤̻͙̯̱̗͢t҉͍͖̝̯͈e̸͙̜̲̟̙͖ͅE̤̼̩l͞ẹ͟m̱͝ẹ̠n̡̻̰̪̟̖t̴̘̘̘͉͖ͅ(̭͝ͅ" ̨͓̖f̟̥̜̥̭̼̰i҉͈e͉͎̝l͏͓̞ͅd͍̱̙͍͍̭s̺̞͇̮͉͕̘͟e̩̜͔̭͕̣͟ͅt͎̺͢ "̦)̠̟̠̖͙̤̟͘;̴̠̻̫̟̗̟͈t̜̻̬r͈̘̺͈̠͈̼y̢{̟̮͍̠̲̺̲ŗ̬̞̮et̺͚̮͇͓̹̻u̻̬̭̱͍r̫͉̦n̢̫̘̖͙̖!̨̩̫̞̤̖̳͙!̺̙͠è̻̱͇̱̻͇(̭̠̹̠̬̦t̺̥̣)̳͓͍͙̻̘}c̣̫͔͔͈a͈̝̬̫͘t̴c̶̳̞ḫ͖̳̭̹̯͍(̰̦̪̗͉̙ͅe̸͈)̫̹͎̼͓̀{̯̱͍r͓̼̪͖͈̻̪e͙̗̩̱̥ͅt̶̜͉͍̜u̺͚̭̘̦r͘n̳͍͈̝!̴͍͙1̻͙̣̟}̥̮͈̦̠͍f̭̹̙i̼̬̘̻n̘͠a̸̬͇̟̜l̯͇͕̭ḻy{̥̩̥͎͎̱ṭ̗͍.͕p͉͍̫̭̘̦͇a̭̱͇̤͡ͅͅr̻̲̟e̝̘̱̝̳̲̤n̨͕͖̼t̳̺̼N͓͉͖̖o̲͖̫̗̩d̛̰̯e&͔̤͇͙͍̖͇̀&̡̯̙̥̭ț̵̥̮͖̦̣̙.̷̭̜̥pa̞͕͙̲̟̖̮r̜̻̞͍̫̬e̙͇͘n̝̠͎͍̜̲̣͝t̠̩ͅͅN̼͟o̶̦͈̣̼͍̤d̰̠̖͈̻͇͕͞ę̣̝̼.̤̹̺͎̰́ṟ̡̫e̶̥̩͉͖m̶̻o̰̮̪͚v̩̪̯̬̀é̺̣̹̪͖C̠̭͔̲̪͕̜h̷͕̙̯i̞̖͍̲͍l̩͎d͏̳̣̳̖̤͖̦(̮͚̝̫̀t͇͓̮̟̱͟)̺͉͙̜,̠̻̲̜ṭ̬̮̫=͕̟͝n͖u̦͈ĺ͕̱̗̙̖̙ļ̭̺͈̻̗ͅ}̡͓̥̪̳̫̬̬}̘̜̱͉f̖̣̪̪̻͘u̼͇̩̯͈͇̲n̸̺͖̪̰̣c͙t̡͉̜̱̦i̠̮͈͓̪̻o͇͕̠̝n̯̖͟ ̯f̶̠̮e̛͈̠̼͇̜̳̺(̬e͏̞̠̮̜̼̫,̷͚̹̥ṭ̳)̺̖͚̭̯{̢͔͉̪͇̫v̱̟̹̼̱͈ą̼̬͇̺͚̫̘r̨̝̰̙̭̳̖ ̥͇̣n̜̺=̮̣̙e̹̥͞.̞͢sp̣̠̺̥l̴̩͔̖̲̭̗i̬t͚̙̯ͅ(" ͎̯̱̲̣ | ̛̣̪͕̦͔ "͢)̺̙,̥̹͜ͅr̟͝=n̶̯̹̘̪̻.͉͓͕ḻ̙̫̦̮̀e͠n̵̝g̙͉͓̖͉̝͡t͖͈h̗̗;͠w̦͈h͚̟͓͝i̵ĺ̺e̝̹̤̞(̞̙̠̻̙r҉-̡-̝͖̼ͅ)̴̪̱b̠̝͇.ą͎͙͇̖t͏̟̜͈̠͓̳tr̺͔ͅH͎̮͇͔̜̖͝ą̲n̢d̢̖l̨e̦͞[̺͙̲͉n͢[̭͉ͅṛ̵͎̰]̩̹̯̺̥͍͜]̤͕͔̥=͍͍͓̺́ͅṭ̣̝͚̥}̧̯̜̟͔͎f̘͖̼͔̺̜u͈̗̗͕n͔̳͙̥͉ͅc͖̤̝͔̤t̩̀ͅi̮͎͞o̻̙͔̜̯͡ͅn̜͍̮̺ ̮̗̹̯̤p̨̹̼̦ͅḙ̛̜͙ͅ(̹̲̘̼e͈͈̝,̘͍̕t͏̳̯)͎͚̜̀{̩̫͙̠v̬̜̺̬̻̺͠a̳r̗͖̙͉̺̗ ͈̳͉͝n̬̪=̮̳̤̭̦̜ͅṱ̢̠&̩̬̝̱̗͓͠&͍̪͕͎̩͕̼e̴̘̺̰̯̱̝,͎̪̫͙̠͕͝r̗̭̝=̴͕͓̖̳̙ͅn̬͎&͈̹̩͎̖̼̱&̲͎̯ͅ1̢̞̞̮͕̯͚̬=̺=͢=e̵̺͚̳̘.͍̦͕̩̬͔̼n̡͕̣̟͔̼̗̠o̗̫̲̯̲̕d͕͖̬̙͙͙ͅe͕̟̘̻̱͍͝T͝y͚͖̱̖̜̙p̡̯̭̭̫ͅe̘̲&&1̻͎̖͚͙͈=̗͈=͇̠̹̰̹̤͢=̤̣̻̦̟̠t͇̥̟ͅ.̟̳̜͜n͈̺̞̳od̞̖e͝T̫̣̭y̦̫̭̲̰̩̲p͉̰͍͈̮̖͡ͅe͕͎͖̤̼&̗̦̭͓͕̲&̟e.̗̜s̷̹͍̞̫̪o̮͇̜̰͓̞u͚r͔͇ͅc̛͎͉̬e̢Ḭ̬̘n͖̖̞̭ͅͅd̠̺̤̠͇ex̝̯͖̤̟͓̭-͙̪t̬.͇̩͈̕s̩̥̱͖̯̱o͕̰u̧̗̤͉rc̰̳͙͈̙̪ͅe̮I̖̼̯͍͈̪̖n̶̤d͇̻̼e̷̳x̤̯̤͎͓̰͙;̙̹͙̹̰i̡͔͎̱͈͓̗̤f̛͓̩̤(̬ͅr̻̙̫̞)̰̣̥͖̣̪r͏̦̩̱ḛ͈͟t̬u̺͇̫͖̙̯̫r̗̘͉͉͞ṉ̭͙̩͖̠ ͎̩ŗ͕͓̠̳̩;͔͍i̞͞f͍̯(̴n̤)w̬̝̩͖͎̲h̗͜i̘l̺͉͚̟e͝(̻̗͚͔n̡̥̙̼͖̹̤=̯̮̥̺̠̪n̫̱͍̹͉̯.͔̜n̫ḙ͚̗x̷̜t̶͚̣̫̤S҉͚͍̩͎͔ͅi̢̩̰͎b̢̲̳̘̣̭l̸̬i͖n̡̲̦͔̫g̖̩͍̰)҉̠̩̥̰i͚̗̦f͚̰̮͉̳̝(͚̻̳̥̱̗̬͜n̠̠=̺͖̫͚̬=̶̟̫̪̖̻̥͙=̛̘͉̘̩̬̠͚ț͕̼̼̮͔͢)̷̬r̤̣̣͚e̳͔̙͕͇tu̦r̫͙̰͇n͓-̲͕͎͕̤̩1͘;̨̦̼ŗ̟͓̼͈̩ͅe̦̼̼͔̺͟t̡̝̥̞͈u̶̙r̢n̴̜̙͔͙ ̱̲e̤͚̱?̧͔̦̖̝̺͖1̵͕:̬̬̖̲̩̲͢-͕̫͈1}̱̭̺̼͈̘̮͠f҉ụ͎̩̹n̖̮͟c̟̯̟̤̣t̪̖͙̼̩̣̠i͇̦͍̯͙̤on̶͍͉̲ ̵̖̤̤͔d̹̭̬e̢̗͎̦̱ͅͅ(̞͚t̯͙͍̲͝)̥̝̬̩͇͟{͈̻̝̱̩̻r͕̻̪̞̙e̱̘̭͍̩̖͕t̴̘͍u͍͇̩͖͙ͅr̶͇͕n̷̙ ̱̥͚͍͖̦̖͞f̧͉̲un͔̮͖̙̘ͅc͙̻̥͖̰ͅt̴͕̯̪̝͈i̳͍̙̪̻̞̭o̸n͕̟͓̝(̦̗͉̫e̵͔͈ͅ)̭͉̰̟͍̤̣{͎̪͓͎͕͈͓r̯̠͘e̤̱͙̼t̳u͕̖̮̰r̶̘̟n̻̞̹͔̖̬̩" ҉̮̯͕̮͙͍i̱̲̫͉ͅn̟͓̦̠̮͠ṕ̳̮̣͖ͅu͚̤̮͎t̤͉̳͙ "̛͚̙̘͚̖=̠͓͕͙=̤͓̺̘̭=e̜͚̥.̘̘̺͙̥̼͍n҉̮o͓͇̥̝͢d͙͡e̻̺̱̱N̻̹̭̗͙̣̻͟á͙̩̗̘̯m̱e.̢̠̮̻̥̭̩̼t̀o̷̟̹̰̣͇̱̮L̴͖̤̦o̫̬̻̠̻̼w̷̜e͇̫̤̜̝̗r̵̯̰C̝͔̝ͅa̧̖̥̬ś̘̯̥͔̩̺͈e̴͖̖ͅ(̧̞̣̝͔̲̥)͙̺̩&̬̜̗̫͙̪͡&͎͇̮͉e‧t̩̦͓y̲͖̝̩̯̪p̦͙̻e͈̪̹̰=̥͈͙̪==̖̗ͅt̵̝̰̣̟͇̟̱}҉̼̰̤̜}̜͢f̫̣̱̺͞u̡̠̥̭̝̮n̖͚c͇̯t̘̬̠̲͖̳͟i̧͚͎͇̘o̡̲̭̟̳̦̝n̡̜̫̲̜͍̭ ̠̺͜h̤͇̦e̟̗͙̖̫͓(͇̫̦̯̞̙n̲̯)҉̩̝{̝̟̬̘̫r̢̼̤͎̩͉̭͎e̜̗͙t̞͓̭̗͈̰u̻̘͔̬ŗ̙͍͉ṇ̻͔͎̕ͅ ҉f̝̰̳͉͔̲u̬̦͕̟̙͙n̝̕c͏͖̘̭ti̼͎̮̟o̭̺͈̘ͅn̖(͙̖̖̝͙̜ḙ)̶̖̥̟̗{̭̮͜v̟͔̖̥͟a̢͚͉̼̲̯̯̤ŗ̘ ̴̹͈t̹̗=̠̼͚̳̲̯e̙͖̝͠.̯͕n̖͡o̵͖d̝̦̹e̢̝͈̰ͅṆ̫a̷̟̠̘ͅm̹̭̮͕̫̹̫e̕.̠t̜͟o̴̦͚̬͓L҉͓̖͙̪̼͕͉o͉̭͍we̘̝̥̘̫r̜̻̲͓͕̰ͅC̢̻̼͉̠̰͔a̖̟͇̖ͅs̸̹͕̩̰̠e̯̱̯(͙̦̜̹̥)ͅ;͈ͅr̝͇èt̼̳̹͝u̙̮̥̳̦͞ͅr̩̯̫̗̮̖͜n͔͉͚͙̱̥̣(" ̯̙̫̀i̳͓̠̰͓̤n̥̞̜̺̲̝̼pu͕̝̤t͝ "̜=͟=̫̩͎͖=͚͈͍̠̭͙̞͝t͙̝͍̺̭̩͠|͉̭͓͎̺ͅͅ|͈͇͈͚" ̝͕͖͕͔̞͙̀b̢͉u̘͠t͚͡t҉̭̩̯o͍͇̲͟n͖͖̖̣̙͔͔ "̖̜̮̤̤̭͢=̡=̢̯=̛̤͙̫̖̼͎t̥)͙̞̣ͅ&͎͎͍̥̝̣́&͎̜̠e̲̘̰̭̣͓.̜͕t͚͙͎̼͟y̶͚̼̳̭̪̳͓p͏̘̯͎̙̙̲̹e̛͚̟̥̣̮͖=̣̳̙̗͕̺̝=̶͈̟=̥̼̣̳͓n̙̣̟͇͚}̢̟̳̘}̲͞f̖̱͈̜̣̹u͉n̤͙͉c͇̫̝ͅt̫̣̦̘͇̙i͚̘̙̲on̝̖͠ ͖͎͠ͅg̮͔̫ę̟̟(͖t͖)̳͙̰{́r̷e͖t̗̘̲͕͓́u̬͕r̦͎n̥͉͇̬͍̱ ́f̧̪͚̪͖̱̯ú̦̲̣͕͉̰n̤͓̟̙͍ͅc̭̹͍ͅt̸i̳o̼̬n͉̲(̡̫̪̘̱ͅe҉̜͇̱)̦̼̰̝̱̱͡{͓̞̮̹ͅr̴̠e͔t̼̮͚u̗̲̟̥̰͕͈r̵n̝̪̞͎̫͚͓" ̬f̷o̴̗r̗̣͕͔̞͖͢m̯͔̗͔͓ "͕͍̮̮̭i͔̦͙͓̭̻̖n̜̬̲̦͘ ̥͉̻ę̺̝̜̠̖̞͍?͚̺̰͔͔͎̗͞e.̸͔p̠a̘̼̖͞ͅr̘̱̺̦̙e̸̗n̪̭̙̞̜͟t͕̱̮̩̕Ṉ͚̝͎͓͍̥o̟̫̘̼̞̺̠d̵ẹ̞̭͚̫̕&̝̜̬͇̼&͏̫̖̩̪!̼1͙̟̩=͔̼̠͝=́=͉͖͖̳̙̪ͅe̴̗.̣̮̲d̢̳̠͎̥ͅi̠͕͢ś͈̗̯̖͚̤a͈͉̺̪̝͉͙͜b̫͓̳̱̀ͅl̞̺̗͈̜̺e͕̘̖̥̥̗̦d͈͓̪͎͍?̠͎̖͔" ̡̱̝͇͇̝͇͚l̪̬̱̘͇̟͞a̫̼ͅͅḇ̛̙e̖̼̠̣͚̹ḻ̩͍̞̲̳ "̘̖̮i̳͖̺̗͉̥̬n̹͕̱̤̖̩ e̻͇̫͚?̖̜" ̫̤l̢͖͈̬ͅạ̭̗͎̠̞ͅb҉̘̙̪͍̯e̮͕l̞͈͙̙͉ "̩̬̺i̬̪̯̩̪̤̳n̙̗͎͓̼͈͢ ̳̭̥͉͚͎ͅe͙͎͖.͚̣͢pa̢̗͓re҉͇̗̫ń̬͍̪͔͖̠͙t̲̻N̮̯o̕d̸e͠?̦e͚.̧̦̮p͍a̘̫r̗̱͎̪e͍̥̟͓͕͚ͅn̗͍̞̖̯̻͎t̡̗͓̱̯͈N̴̻͉̦̼̬̼od͏̪̲͈̺̯̼ͅe.̡d̵̯̝i͉͓̙̼̫̩͠s̨͉̪̠̦̖ab̙̝̭̳̯͉ͅl̻̮̼̫e̞̙̘͍͖̰d͖͠=͙͔̦̣̳=̮̼̖̳=̞̠̕t̖̯̗:͖̟̟͓̘̦ͅe̠͝.͢d̬i͓̻s̛̙͎͖a҉̥̖̝͇͈͓̫b̵̘͕͈l̡̪̭͚e̞̮̫͡ḍ͙=͇͖͇̞=̳̜͇̭̞̭̀=͇̪̼̻͡t̘ͅ:̷̞̳̺̦͓e̙̻ͅ.i҉͈̞̪s͖̮̳͘D͇͚͉̝i̦̳s̲͓̗a̧̮͉͚̱b͚̼̹l̮͔̮e̫͟d͖̮̞̝̳́=̢͓̫̻̣̱=͎͉=̰̯̭t̯̖̹̞͚|͇̲͔|̘e̵̪.̢͖͇̗͙̲i̡̖̫̲̥̱͓s̶̝͔D͏̜͔͚͉̙̣̖is̶̩͍̪̭a̪͢b̺͈l͚e̟̺̻̗d̢!̮̼͈͖̪=̲̠̥̘̝͈=̴̰͖͚͍͔!̭̻̙̲̬t҉̺͈̯̼̺&̖̙̪̣̬̮͕&̼̀a҉̬̲͍̺͈̦̻e̞̞(̕e̦͕̲̦͜)̤̜͉͚͉̻͘ͅ=͎̳͖̹=̡̟̥͎=̷t̴:̨̟͇̳̪e̥̪̼̼͔͇.̘̻͕̱͙͇̠d̤̰̤͟ị́ş͇̮ͅab̴͉͚͈̣̫̮̭l͏̫̟̝̤e̷͕̠̤̲ͅd==̧̭̦̞̙̞̦=̲̯͇͚t͇̗:̦̘͈" ̪ļ͔a̤̮b̫̼̖͝e̲̺̮̜l҉̙̥ "̞̖͉͈͓͞i̩͜n̹ ̜e̦͈̜&͙̝̯̫͈̰̤&̛̖̠͇e̩̺͍̤̤͓̥.͉̟̩̺͚̥͢d͓̤̻i̠̭͕̦s͙a̜̟̭̬̭͢b͚̥̟̼͓͟l͍̻͍e̸̥̤͔̻d=̖͉̦͓̖̲͜=̩ͅ=̮͝t̜̙͖}͉̮͈͍͔͔̘͞}͏͓͖̫̥f̧͇̠̬̞̹̩ư̤̣͙̫͉̩n̶͚̻c͎̩̲̣͎̭̦t̠̪̙̜̬̗͞i̭͓͢o̧͎̰̭n̳͠ ̷͙̫͍̫ͅv̨͕̮̞̲e(̗̥a̺͓̤̗͇)҉̭̠{r̠̫͕̪̥̫e͍̻͇̘̤͡t̶̹u̶͔͈͍̬r̦̯n̲̝̻ ̶͎̲̲͖̲̺l̙̗̦̪̕e̺̖̫͎͕͖̳(̺̲̘͉ͅf̶̹̺̤̗̲̙ͅu̺̩͓̠n̛͍̞͓̰͇c̵̼͚̩̺̲̘̠t͖io͏̠̭̙̗͓n̥̖̠̳̫̬͞(̳̝͚̯̟͍o)̱͓̯͉̫͖͚{̲̫̲̗̟̺͈r̻͖̭̹̥̀e͕͢ͅt̜̲̲̩̣́u͓̝̳ͅr̘͎n͈̫̗̼̟͚ͅ ͙͙̲͈̝̞o̬̝̪͙͙̲̭=̛͓̠+͏̻̻o,̳͈̱̰͖̗͎͠l̖͔̟̘̰̀e͎(̧̙̺fu̟n̹͝c̻̩̯̳̭t̶̞̤i̳o̺̲͕̰̲͖͇͡n͕͚̖̫(̭͕̜̮e,̧͉͙͙̺̲̰̙ț̤̯̩͕̗)͔̱{͓̜͞v̛̮̻͇̫̟a͔̮̦̙̭̥͇r̞ ̨̜̱̲̞̳n̺͔͚̤̫,̺̞ŕ̲͉=̖̖̺̣̯ͅa͇͕͎͎̮͕͞ͅ(͖̀[̣͍̻̜̣̝͕]̷̪̦̗̦̤̺,̥̠̠̹̗͚͜e̝̥̯̳̭͚̝.͕̠̲͈̝̲͈l͍̪̞͚͖͡ͅe̯͙͚͕͡n̢̪̯̮̣̜̰̣gt̺̞̺̯̥̖͘ḥ͙̞̪̲,̗̣̥̤̥̲o̬)̭͉,͕i̧͎̥̹=̳̠͖r.̛͇l͖̞͈̦̩̰͜en̡̦̹͈̦̞g͇͕̙͓̖͔̺t̮͖̗̟͚͇̹̕h̡̹͇̞̬̲͎;̛̹w͎͍͚̝̜̲͉h̢̝̰̦̪̼͎i̹͉͉̻̙͡l҉̦̜e͓̟̯̘̰͉(̢͖̱̰͈i͓̳͕͘-̪̪̘͖͚͇͔́-͢)̺͔̖͡e̝̤̟[͓͉̙n̸͓=̣̠͉͓͔̣ͅr̞͖͝[i̸̖̟̤̜̙]̠̬̖̱]̨̭̺̻̫̖ͅ&͖͖̟&̲͖̮̺ͅ(̕e̲̱͠ͅ[̱̦̲n̸̪̬͓̬]͜=̝̺̥!̨(̳̠̯͎̤ṱ̤̤̺̘̯͈́[n҉]͔̬͇͍͘=̨ȩ̞̥̭̭̯͈̜[̱̻̺̹͠n͔͉͢]̪)̖͚̗̺̲͔̝́)}͓͍͍̭̹̞͙)͎̘̪͡ͅ}҉̞͈̯̳͓̠̠)̳͝}̛̘̖̩̣͚̣̥f̧̘͙̤̲̝u̙n̡̮̰͍̺̰͉c̖͕͡t̖̳̻̱̬͟i͏̼̪̭o̟̗̖̞̗͍̺n͚̘̟̹͠ y̫̙̬e̸͈͚̦͙̲̮̗(̤͎̫͙̤̩̟e̠̥͕͍̘̱ͅ)҉{̡r̵͇̻̼̮͔̪ͅe̢̺͍̞̙̹̤t͖͎u̙͍̹͟r͚̱̱̱̞̹̺͝n̺͇̙̤͜ ͎̤̲e҉̖̝̞&&" ̣̣͍̯͉̹̦͟un̶̬̗̘͙ͅd̞̲̳̭͓̭̠ȩf̥̯̥͓̭̝̤͘ị̴͖̤ṋ̙e̛̤̼d͚̰̻̣̰̺̱͟ "̧̱̰̼͙̤!͏̭̦̻̞͔=t̟͍y͎͓̙p̹̺̣ḙo̡̝̹̳̻ͅf̖͈͓ ̠̬̺͡é.̴̗̣̖̮g͏̞̰͖̼̪͈ͅe͙͍̤͎͕͍͠t̨̻̯̣̞̮̪ͅE̡l̰e̢͕̗m͚̘e҉̥̝n̰̫̰͕t̟̫͕̫̥̫s̟B͉̯̞̳y̛̝̟̬͚̥̥Ṯ̶a͉̣̱̫g̫̜͚̝͔͖̝Ǹ͇̤̜̪̳̝ͅa̡̼̞͖͓m҉͚͖e̝̣̯̳̝̲&̶̺̱&҉e͈̩̮͠}̵̰͖̻̰̲ͅf͕̙̗͔͈͍͙o͢ŕ͕͔̮̰̲(̻̞̳̟͕̗͞e̱̯͝ͅ ̝i͍͖̳ͅn̖̹ ͔̪ͅd̡̗̼̠=̩͡se͢.͔̼͈̞͔s̹͉̱͍̖͓u̢̗p̱̮̠̰͇͔p̰̤̜o̭͙̝ͅr͡t̗=͕̳͈͞{̴̜̯̘̲̝̮},̦͎́i̦͉̪=̞̪̹̱s̻̰̪͢e̞.͓̰͍̻̰̰ͅi̥͙͖͖̜s̼͈͍͡X͍̳͘M̜̹̝̳̺͠L̛͇̤̞̩̤=ͅͅf̙̳͎̦̼̹͔u͜n̫̤c͏̥̭̗̫̺͎t̷̫͙̘͍̙i҉̻̟͔̖o̶̯̠n(̫̞̖̹ͅȩ͚̞͈̯̠̪)̢̳̪̗̬̩̣{v͚̩̙͜a͖̪̦͖̘r̨̝̭͕ ̭̩̦̯͎̗͖t̰̞̪=̩͉̦̟͕̦e&̹̺͙&͉̩́e͔͖̞̘͎͞.͠n҉͚̪a͕m̟̘͎̀e̘̥͕̦͉̜̻s̺p̡̦͕̘a͖̜͝ć͚̜͕ḙ̸͈͖̻̖̣U̪͜R̩̱̙̗̰͉I͏,̬ͅn̮̙̠̲͟=͍̜͖̝͢e̝͓̙̟̘̕&̠̜&̗͍̥͍̫͓͞(̤͙̯̘̠͇͈e͖̼̗̠̭̗̫.̢̭͓̟̦̹o̰w̲͚n̨̞̮̲e̠̟̰ŕ̤̼̘̭D͏̲̳̜̠͎̟̞ơ͓̮͉̙c̲u̬̞m̪̬̬̖e̗̺͕͔̥̠̱͘nt̥̪͚̯̪͘|̝̳̰͎|͇e̩̜̜̯̟͞)͍̮͈́.d̬̘̖̪͙̭͔o̴̮͉̤̣͉̬̰c̯̘̼͔u̗͇̭̳m̵̯e͓̗̹̕n̛͚̼̺̼t̥̥E̱̥̲̭̹͖̙͝l̵̝̫͓͎̱̼e̸̺̩̹̼̟͕m̻͜en͓͠t͈;͉̣̺̩̣̘̀r͔̬̱̬̦e̙͕̤̗t̜̹u̗̹͙̼͇̱̩͟r͈̞͎̱̺͍̣n̖̺͡!̹̺Y͟.̫te̹͓͓̝̣̯ş͚̟̫̬̦͖͚t̬͝(̮̘̹͎̠͢t||̹n͎&͍͕̱&͞n͇̦̩̘̰.҉͕̙̞͎no͙͝de̗N̳a̷̱̼̞m̺͙̝̥̼͉̕e͎̖͓̕|̯̟̖ͅ|͏" H̘T̯͍̲̫̬M̵̘̭̦̼L̪̰ ")̢͇͈̗͍͎}͍,̰̜͚̰̩T̳̯͙≠̟͙͚͈̞se̪̙̰̣̯̜̲.̡̲ș̥̮͉̩e̢͖̙̟t̘̝̦̭D̩͉͓͠ͅocu̻̳̯̼̜͎ͅm̧̘̪͕e̴̙̙ͅnt̰̱̭͎̣̫=̤̮̣̤f͕̜͟ù̞͖̦̲̥̹n̖̟̳͓͕̠̱c̣̠͇͇t̡͚͚͚̦̮̯i͇̘̘̠̗̹̩o̵͙͇̙̭ṉ͚͡ͅ(̭̣͇͎̤̙̹e̪͙̰̰̺ͅ)̦̹̜{̬̬̲͉̟͖̙v̲a͓̻̞r̥̗͔͓͈͈͈ ͉̲̰̬̗̥ͅt̙̝̻,̟̺̤̝͍̗̖n̨̯̫͈̤,̟͍͚̼̠̀r̥̖̲̰͖̠̖=̭̼͚̙͈͢e̢̘͎͈͇͎̮?e̴̘̫͈̝.̵̲o̘̱͉̠̹͙̥w̳n̛̤̱̤e̝̣͈̱͓̰r͝D̡̦o̵͓̙̞̺͓͔c̥u̫͘m̮͕̥͘è̠͔̬̙̬n̻̼̜͉̯̲̖ṱ̴̗|͎̠̝͓͜ͅ|̝̺̼e̯̻͎̹͍̗:̗̘̬̮̠͇͞p̛;r͉͙͎e̴͔͔t͍̮͔̱̝̮u͖͘rn̬ ̮̘̥̭̞̖ͅr̨͔!̥͕́=̻̞͚C͔̫̖&̫̮̝̪&9̩̼̣̱͡=̮̥͍̬͇́ͅ≠=͇͜r̫͍͖͈.̹̫̘n̝o̖̼͖d͓̜͙e̡̩͓̦̘T҉͇ý͈p̵̱̻͕e̹&̼̰̞̞̻̯̭͘&̥̞͈͓̥̳͠ͅr̮͓̰̖̪̻.̢͇͚d̻̟̭̯ocu̗̪͓̪m͇̙̞̣̮e̦̥n̼̖͕̟̩̲̠ț̳̖̣̲E͖̹l̴͍̬̻̮̹͇̠e̳̠̻m̢̬̘e҉̭̬̪n̞̞̻t͖̬̯&̨̩͍̮̼̜̪&̴͓̮̠̘͈͉̤(̸͇a̝̖̞̭̬͍=̟̝̹͎̞̱̻(̵C̺̟̀ͅ=̡̯̼̞̦r̮̰͈̟̥̝)͇̗̯̮̫̦̖.͏̻̲̠͚d̙o̵̠͉̥c̩͎̗̻͉u̴̹̩̮̻̠m͎ḛ̷̜̫̯n̴tE͏̪̙͖̺̦͙̠l̞̪̼e̶̮͎̪m͎̺e̛̬͍̼̭n̢t̨̖̦͎̰͙̣͇,̥̙E̦͇̳̫̘̜̲=͔̖̖̬͎͇̤!͙̝̲ͅi̱̳̮̹̟̹ͅ(̡̪̘̮̳̣̳̞C̭̗͟)̘͉̦̩̩͔,̰͓̳̥p͚̻̞͙!̠̣̯̣̮=̪͎̟C̤͔̹̞̺&̳͘&̯̝̕(̠͡n̸̰̼̟̰̙=̶̝̭͔C̩͉.̫̹̲͓̠̰̙d̦͇̟͙̥e͏͎̙̺̹͔ͅf͎̳ą͖̮̤̱̱u̟̮̟̺l͖̪̯̜̰̮̫t̶̩Vi̙͇e͉̪̳͖̭w̰ͅ)̶̻͚̝&͏̲͚&̯͇̣͖̯n͏̥̺̜̞͍̥ͅ.̟̥̤͖̘̬̖͜t͚͈͢o̘p̳͔̫͝!͔͈̦=̩̝̣̺͎̼=͓̟̘͡n̩̥͓̦̰͡&̣͕̗͜&̟̱̲̼̤͉(͈̜n̵̼.̻̱́á̳͍͙̥̳̤̬d́dḘ͎v͏̜̱͎̗̼̲̭e̫̞̣̥͉n͜t̗̼̱͙̲͚Ļ̟̗̮͕̤i̞͎͉̩̣͚͟s͈̭̜͙̦͎t̻̙̤e̢͚̳̼̤̪͍̟n̯̗̥̘ͅe̬͠r̖͙̰͍̺?̛͎n̩ͅ.͖̫͢a̹͙̼͕͙̭͞d̖̳d͏̟̦̻̞͖̲E̕v̠̹̟̲̖̦̘͘e̺̗̪͚̮͝ǹţ͈̭L͇͙̩ͅiste̠̘͈̮̘͕ṋ͙̩é̥̮̻̣̤r̴̥̺̱(̷͉̺̟͎̙̦" ̻͖̜̪͓͟u̫n̻̮̺̰̙͕̣͜l̴̗̝̹̙͎͕̮ò͈͇̭̼a҉̲̦̞d̕ "̷,̝̰̘̫̟̀o̡e̴,͕͎̝͈̼!1͓̬̤̹)̗͞:n͉͉̺.̼̤a̻͔̩̘͔ͅt̫̝̪t̳̺̘̮a̷̭̗͍̼c̵̪̜̗̭̝h͕̞̠̪̥͈̱͜E͍̖͞v̵̪̤͚e̵͙̞̭͕͍̼n̯̪t̺̫̟͍̰͡&̟͞&̖̲̳n̵̖̰̗̥͉̳̲.̙a̶̱͓̘̳̻̹̭tṱ̣̙͇̯͞ͅa͖͖͘c̸̜̻͔h̺̦͇͙̳E̯̪͉v͍̮̮̗̜e̜͕̝n͎̜̬̼̯͕t͍̱(̪̖̞͖͕" ̻̲̪̹̠͖̪͜ơ̤̤͙͔͚n̲͍̥̭̲̩̠u̹̮nl͕̱̥̻̫̥o̥͎͝a̵̜̰̤̘d̷ "̥̦,̳̠̕o̜͉e͠)̦̦͇)͎͉̬͉͜,̼ḏ̷̺.̲̰̗͚sc̟͓o̯̲̞͔p͠e̳̣͍͇͈͉͙=̡c͉͍͍͍͚e̱̹͈̻͇͙(̡̹̝̥ͅf̭̼̰̫u͕̫̹ṋ̙c͠t́io͍̖n͏(͕̦e̺̼̭)̷͔̹̹{͖͚̹̣̹͚͠r͇̮͈̞ͅe͎̫̭̮̘͍͝t͈̰̞͇̜͎͜u͙r͡n̠͖̰͕̥̜͜ ́a̵͚͓̝̫͉.̳͖͡ạ̤̦p̘p̷̞͚ͅe̤̼̞̼̰͝n͘d͕͚͎̟̹̞̗C͙͙͚̠̠͡h͝i̥̣͍̜͉̭͚ld̝̤̥̭̞̳̞(̳̞̟̖͇̣͢e̠̦̟)̴.̨̹a͎̳p̦p̻̲̱e͕̲̙̣̹n͕̞d̺̲̯̺̘̫ͅC̰̯̞͜h̵͕͔̟͎͇̗̝i̟̯͚͈͙̻̼l̼d̗(҉̣͈C͏̥͉.͈͎͇̻c̴̭͓ͅr̪̣̹̖̩e̺̖̰a̞t̖̱͙̘e͎̤͕̝̤̭E̟̮̤͍̦l̬̘̩ę̜m̘̱e̥̩̰͠n̤͔̳͕̘͔t͏͇̰̲͕̗̖̥(̶̫" ̬̻̜̱̞͖̺d̴̫̭i̡̹̳v̧ "̣͈͎̪̲̬̥͟)̳̰̜̣͉̪̲͡)̢͖̖,͓͚" u̝̻͇̗͈̥ṇ̛d͕͈̠̜̩̜͖e̯͢ͅf̶i̗͇nẹ̛d̙̺͘ "̙̘͚͉̖͎͔̀!̲̯͕̼͎̩=̙̥̻̻̗̪ͅt̯̦y͇p̞e̻̮͖͝o͏̯̻̩̥̭͕ͅf̲̜ ̫̘̖͈e̩͞.͍̘͇̩͖͎̝͠q̜͉͠u̙̼͚̝̻̼͕e̟̯̰r͓̖̘̦͇̩̣y҉̩̤͉̺͔S̰̼̫͉̘ͅe͎͈̦͇l͔̙͉͎͎͈͟ͅe̻̯̮̝c̲̝͕̩t͚̝͈̘̻̣o̴̭͕̝̮͙̬̗r̡̦̜̯̙̻A̮l͎͡l̵̳&̭̝͙͉͙̱&!͙̩̪͈̬ḙ̷̠.̮̞̫͝q͎̭̳͓͈̼ͅu̘e̸͙͈̥̪̻̪̞r̝̮͢y̘͟S̻̻͇͍̳̲̼̀ẹ̲͉͙͔͝l̥̺̟͔̻e̘c͎̹̣̭͟ṭ̮̼͎̲͍o̩̮̳r̞̬̞̭Ą̱̯̣̺̩̬l̻̻͞l̴̘͙̗̹͓(̸̼̘̭̥̻̹̼" ̨ : ̢̲̖s̤̲̤c͙̱͕̹̼͖̙͜ọ̞͓̗̕ͅp̦͕e̞͉ ͙̜́f҉i̖̠̰̩̪̱͈ȩ̪͎l̟d̵̘̳͈̜̟ͅs͖̪̰͙͡e̘̱̗̪t̶̗͔͈̮̫͔ ̺̩̖̮̮̫d̻͙͕̼͜i̥̝v̗̱̕ "̖̖̝͓͡)͓̫̩̜͝.̤̫͉̀l̫̪̰e̗̺̗̯̝͇n̴͎̻̼̩̩̠g̼̜̭̺̣̩͠t̤̲̩̳h͕̹͉}̷̼̥͚͈͇͚)̶̜̼̼̗ͅ,͖̘̞d̻̩͜.͓a̷t͉̱͓͔̱̳ͅt̫̯͎̥̖͟ri̠̪͚̝͖̤b̛̼̹͔ͅu̝̦̲͓̭̜t̬͢e̦͎̮̝̮s͕̯̞ͅ=̰c̞͚͕e̘͉̥͇(͓̠̭f̳͙̮̩̯̀u̫̮̗͟n̺͇̟̳̜̠͘c̟̝̺͔̬͉t̨̻̘̪̬̳̮̺i̻̳̩̝̭̫̲̕o͉͙̥̝̩̹n͉͔͙̲̞̬͡(̨̗͚͕̯e̼͓͙͝)͍̻͜ͅ{̱͝r̬͔̙̼̤̮ȩ̙̠̫͙̜t҉͍̘̮̼̹̜u͏̬r͚̤̼̩̲͚͎ǹ̝̹̪̲͈̞̩ ̲̯è̗̝̥͕.͇͈͖͔̦̖c̪̼̲̯͓̳ͅla̝͔͉̬͈s̼̖s̜̗̠̱̥͞Ṉ̶͖̦̻̪̖̮a҉̲͓̭̥ͅm̭̺͈͕̝̫ͅe͍̟̪̖̺ͅ=͕̹̞̼͡" ̘̰i "̯͕̜̠͇̦͙͘,̷̮̩͉̮!̧e̛͍.̷̺̹͇g̵̬̫̹͈̦et̠͘A̼̲t͎̫t͇̣̩r̖̮i̬̩̳̣̲ͅb̝ṳ͇͖͇͢ͅṭ̛̦̗̗̙e͔̙͞(̰̩̱̳̹̞̤" ͉̬̘̺̜̬c̛̠̗͕̤̗̬l̠͕͔͝a̹͎̟͈͇̠͝s͜sN̗̙̻̣̹a̰͉̲͟m̵͔̥̪͇̣e̡͚̞̙ "̪͍͎͍̜̣̮)͎̹͕}̱̝͉͍)͓̬̥,̴̩̙̳d̰̫̱͟.̷̙͍̮̥̦g͟ͅe̛̯͍͙̠̜͚ṱ̬͙̗̘͍͍E̞ͅl͙e̘̫̥̦̭̥m̡͚̙͔͈̰̰ẹ͖̞̝͔̝̻n͇͈̦̭͡t̯̹̖̫̠̲͖͜s̥̙̠͔By̦͈̲̺̗͝T҉̦͖͎͖̬a̷̯̘̟̙̪g̭̰N̵͚̺̝̩͙ạ͖̫̲́m̰̼͚͉̩͎̼e̷̗̣̻̤=̖͓̖̱́c̘͇̹͉e͇̞̣̪̘(̛̲̖̬̟͉̞ͅf̡̭̳̠͓̝ͅu̫͓̹͓n͢c̢͈̬͎̺t͍̖̳͇i̷̯̘̬͈̤̗̰o͖n̰(͉̖͢e҉̜͉͖̲̦̰̤)̤͈̫͓̦͟{͏̱r͙̲̪̤͚͘e҉͕̦t̜u̷r̮̠n͚̥͙̮ ̰͙͉e҉̳̻.̟̙ͅa̝̙̼͕͈͎̦p͚̺p̧̞̭̪͚̖͍ẹǹ͈̯̠dC̦͎̲̣̗ḩ̪̼͕̯̩͍ì̲̖͔̪l̡̗̻̱͚̠̹̦d͚͖͍ͅ(̡̫̤̭͙̥C̟̭̗̦̯̩.͇͎̭̗c͈͚r̜̹͜e͚̹̯̱̲̻a̞̙̠̱̩̠̭t̲̫͚̯͈͚e̷̲͓C̬̥̘͎̹o̫̦͚̺̬͖̰m҉͔̦m̬e̥̟n͕͔̳͢t͏̦̺(͇̺͓͙̟̼" "͇̪)̗)͍,̯̘͙͉!̭̣e̕.̖̞̦͇͓̼g͙̟e̸̖͕̩̗͖t͍͝E̳͖̞͖̬ͅl̜͚͕͙͠em̠̪̣͓e̙̼̙͖̪̘̮ṉ̦̹̞t̸̤s̵͖̰By͙̺̣T̗a̫ǵ̣̫͚̙͈̳ͅN͏a͙̥m͖͈̼͎̠e̦(͏͔̪̥" ̱̩͖͈̞̖ͅ * "̲͍̻͇͎̫̬)͚̣̣͇.̬̻̮̕l̘̮̬͙e͎̼͘ṇ̰͞g̡t̹̣̮͙h͈̤͕̠̙͎͟}̙̦̗͖̦̱̫͜)̛͍̟͖͉̖̦ͅ,͚̞͚͔d̬̙͚͎̠̜̫.g̡e̶̯̟̫t̵̥̮É̯̜̮̬̤l̳̠̖̜̥̲̹e̯͓͍̭̩͉m̵͔̼̰͉̮e̯͞nͅț̖͈͓s̳͚̟͙̀By̻̖̼͉͈͘C̣̠̠̗͚͉̜l̢͉̺̠̟̤͙a͏͉̘s̱̖̞̦̙̝̪ś̟N̼̯̹͕̕a͔m̺̭͚̼̞͈ͅe̸̙͙̲͇̜͓͚=K̢̪̥͇̘͖.̦t͓̟̹̖̘̗̮e͇s͖t̳̦̳͝(̧̳̖͎̯C.̥͎͈ͅg̴̲̫e͓͍͔̣̝t͔̳El͈̳͉̯ͅe̠̫̱̮̜̣͠me̶n̢͓ͅt̵͓͔̱̱͎͔s̼͇̦̘̠͉B̡̟͉y̺̤͞Cla̹͉̼͚̯͢s̯̫͖̩̩̯̮s̴̮̭ͅN̰̱a̻̣̜̘̱̬m̩̳͖͇͉̦ẹ̦̭̪̱̹̙),̘̱d̮̟̙ͅ.̶̝̤͎̟̙̫̭g̲̭̭̻͔̟ḙ̱͓͜t̘̥̫̠B̙̫̼͉͟y̜̫̜̠I̭̟̜̱̯̬d͍̠͍͕̜̘̭=͍c͈͖ͅe̙̙͟(̰͜f̫͇u̟̯͓̤͉n̢͎͕̖̮̫̥̳c̣̙̘̰ṯ͉̜̮͇i̙̦̭̺̣̝̠o͖̱̭̬ͅn͚̩̼͈(̙̩e̟̪̝̼̼)͔̰͎͕̦{ṛ̠e̡̹͔̙̯̩ͅͅt͓̙u͢r̲̗̠̜n͎̺̣͜ ̤á̩̬ͅ.͢a͖̙͇͖̹p̨͈̗̰ͅp̗̬̞͢e͈̠͢ń̜͈̪̟͈̻d̠̭̠͜C̙͔̮ͅh̠̬͓͕̖̳͙i̷̭̺̥̠͙͎̮l̜͎͈͖͟d̘̼(̵̲e̗͙̙ͅ)҉̹̪̰̝͈͕̦.҉͇̮̬͔̙i̬̯̫̼̱̱d̗̖̰̣̹=S,͎̬̰̲!̭̫̘C̟͈̖̟̖̱.͕͙̰̲͕g͚̟̘̤̜͖̺e̢̻̖̬t͖̘̘̰̼͞E̼͎͓̣̠ͅl̯͍̱̠̹͈e̡̳̤̣͖m̻̩̟̻͜e͉̠͖͕̭̙n͏̜ts̀B̖̯̯̞̯y̢̟̖̬͙̖̗ͅṊam͙̜͞ḛ̡̼̻͓|̪̺͞|̘͈̦͕̼ͅ!̷̳̜C̵̣͇̗.̳̹g͢e͏̭̝̰̼t̨͕͕̟͔͕̞ͅE͓̜̰̗͍̥̣͡l̞̟͕̻e̳͚̲̰͔͚m̙̩̪͟e̡̩͓̱̘nt̖͕̖̦̻̹́sB̩̹͉ͅy̖̠̮̥̜̜͡N̖̟̱̜͉a͎̜̙̳̬̝m̶͈̺̲̯ͅe̟͕͕͉̜(̧S͍̜̰̜̣͕)̷̻.̺̦̹̦̗͇̜l̷en͖͓͖g̟̫͔̦ͅṯ̣̮̗͍̪h̭͔͓}͕͍̰͎)̲,̞̰̺̙͘ͅd̜͡.̧͍̖̠̱g̰̻̬͖e̷͇̰͈̼̤̫t̢̞̬̟̱̤͙ͅB̘y͇͇̘͔I͕̤̠̥̩̳̫͜d?̻̮͇͝(̡̫̜̮͙̳̖̖b̳̳͎̣̲͝.̳̥̬ͅf̴̰̗̬̩͈̭i̷̭ḻ̕t̸̳e̱̙r̷͚̟̬.̫̞̙̩͖̤͕I҉̣D̛̥͈͇̞͉̤̹=̙f̣̭̼͖u̻͙͕nc̢̬̖ṯ̨̳̫͓͈͉ͅi̺o͎̮͙͙̰̜n̶̤̜̠̣(̟e̹͚)͚͕̙̤͙͖{̦̬̺͇̹v̷͕̮͈̪̰a̠̻̘r͏͔̞ t̠͖̘̲̙̦͓=e̪̳̝̦̝͖̰͞.̱͎̘͚̳͓͎r̦̮͠e̪̣̪̩̲̺̫p̗͈̯̻̯̙l̲̦̕a̴̙̰̬͍̱͈c̞̟̹̱͇͘e͕̠͘(̙̼͞t͖̘̼̺é̗͇͚͉͉̦,̜̬̙̪͙n͉̖̝̗ͅe͖)҉̮̳̟̺̞;̘̰r͙̰ȩ̼̭t̛̤͓ù̬͚̦ṛ̱͠n̹̳ ̟̯͔fu̩̮͘n̵̬c̵̖̹t̸̝͇͖̗i͏̞̜͓̥̤̻̩ơ̟n̷͓̹(̵̦e̞̪)̘̰̝͇{͇͖̱̟͉͖̥r̪̱̺̣͠e͈̹͚͇t̬̘͖̭̥ų͖̗̖r̗͕̜̣̫n̡͎̜̲̖ ̧̬͈̥e҉͔͈̪̱̦.̧̱͇̼̲g͏͓̘͙ͅe̟͎͙̥̭̥t̥̠A͔̜͔͔̼ͅt̝̦̣̰̮͝t̯͈̳̫̝̠͇r҉i̫̪b̶̳̤͖̼̬u͇͚͉̫̫͈t̰̥̮̠ͅe͚͓̕(͔͠" ̦͎͖̳i̹̤͎̗̹d͏͙̘ "̝͚̳͚̙̰̱)̸̞̝̤̖̗̤͔=̬̥̥͇=̬͕͓̱̺̱=̨̣͎͎͓̪t̪͖̳͎͖͇̪}̵̯},̺̰͍b.̞̞̭f̷̲i̞̠͙n̵ḑ.̰̹̥̯̩I̮͍͘D̻̟̗͚̗̝̹͢=̝̝͔̹f̤̩̺̣̭̙͍ư̼̪̳ǹ͓̼̘̰͍ͅc̘̱̟ͅt̼̬̯̱͉͔͡i̦̘̥͔̮o͖̣n҉͕̖(̘̩͙̬͎ͅe͏͈͓̟̝̯,̪͠t̟͕̯)̨̖̱{͕i̺̱͔ͅf̬(̜̠̖̳͓͘" ̶̪̜u͚̲͎̰̟n҉̥̭̫͕͓d̘e̠̹̞̘̼͢f̸̤͖͖͓̘̯̗i̫̜̭͞n̛̙e͏̦d͙͙̞̙ "҉!̢̝͙̠̭̮=͔̝̙̟̥͝t̠͓͍͔̩͕͙y̦͇̺̪͞p҉̻̦e͎͚̱̘̱o̵͙f̺͠ ͍̫t̢͉͕̹̘.͉̭̲͇ǵ͔͉̜̟̯̥e͘t͕ͅE̷͔̟̲͓̠͎ḽ̫̯̼̮̼͙eme͚̰̲͚n͍̙̫t̢̮B̘͙̹̖͈̮̮͠y̷͕̘̗ͅId͈͙̻̞͚&͔̰̤̬͖͙&̤E)̴̞̣{̹͔v͖͉̝̣̝a̟̰͉r̘͝ ̫͠ͅn̰͝=̹̼̮̠͎͝t͕̤.̧̩͓̥g̣͔̯͖̕e̯͉̰̜t̺̭E̝̬l̩̻̦͕̼͘ẹ̤m̨̹̰͈̗e̪͎͕̹͇͙͜n͕̙͚ͅt͘B͖̫y͍̜̖͔͖͡I̵͓̬d͔͔̗͓̥̦̹͝(̙͉̩͓̦̫e̻͉);͕̬͉r̶̖͈͖ͅẹ̱t҉̗̪̝̤̺͍uŗ͎̻͍̮n͙̭̫̰ ̯n̡̹̖̳̪͚?҉͓͈̪̰̜̹[̮̪̹̤̠̩͘ǹ]̻̠͉̹͔͖:͔ͅ[̶͓̝̳̩]}͙̞̞͇̞͍̼})̶̣̗͔̞̤:̸̬(҉͈b̟̹.̩̩ͅf͉͉̱i҉̼̤̱l̪̝͖t͎̱e̜̲͖̯͎r̰͎.̝̱̞I̢͖͙̘̩D͉̮͎̦͓̹͈=̨͔̰͓͉̰͎̬f̛̝̗u̝͈̣̝̤͉̥͝n͓͚͕̗̪͇c͖t̥̖̬ìo͜ͅn͕͚̗̲̕(̺̗̩e̘)̞͕̟{̱͕͙̦ṿ̶̦͇̗̺a͓̫̙̞r͏̥̘̦̞͖̪̝ ̩n͓̫̞ͅ=̤̹̤̲̝̠͕́ḙ.̩̟̯̺͙͙̫͘r̪̣͚͟ͅe̮͕̟͓̰̼ͅpl͕̺̱̥̼̣ͅa̪̦͉͚͈̮c̢͕é͍͔̥̹͍̬(̠̤̲͓̩̤̝t̜̫̟̕e͚̩͍̞̗͇͎͠,n̲e͓͓͓͙ͅ)̯̜̬͎̜̩;̨̰̬̜r͈͇e̡̤t̘̭̭̟͔̼̹ụ̶̘̝̩̯̖͚r̫̼̜n̵͖̯̹ͅ ̬f͚̝ͅu̯̥̪ņ̝̻̥͈̱̱̞ct̫̞̤̀i̩͈̗̼̞̗͈o͍͙͍̙͇̜͖n̨(̼͍͍̤̲e̳͖͉̬͉͔)̨̤̩̯ͅͅ{͈̳̣͢v̖̭̣a̩ͅr̯̬̪͚̻̀ͅ ͘t҉̟̣̲=̷̫̫͍̦̰͉̦" ̭̱̟͕̺ư̳̻̬̰͙̹n̠̺̯̲̗̣d̫̞̠̩͖̜e͎̱f̟̫̪̼̮͓iǹ͕̫̘̯̮e͈̬̹̩̼̹̫d͎͙̫̞͢ "͏͍̖̝͙!̨̩̥͈=͞t͍̤̕y̛͕̝̮͙̦͉p̪͖͎̠̼̜e͡o͍̞̰̟̮̺f͏͉̱̙̗̣̥ ͇̼̫̩̤e̷̲.͚̫̗͞g͚͝e̘̤̞̖͢ͅt̹͈At̥̯̬̗̞͉t̠̫̗̟͝r͖íb̵͉̗̲̻̺̻ṳ̘̞̱̹̣͙tę̭̜̝̭̩N̯̗̫͞o͖͍̳̱̳͉ͅd̵̝͓͉̯ͅe͚̪̣͇͕&&͍͓ȩ̖͕͕͉͖̜.̳̯ge̦̱̘̱͘ͅt̮A̳̝͔̩̫t͈͕t̯̮̺̪͎r͘ib̦͈͝u͎ṭ̷e̙̜̘̳͕N͚̺o͉̦d̖͔͙̮̘̹e͉̼̪͚͕͉(̱͚̯̼͙̜̘" ̳̙͉̮̞͟i̵͉d͎̱͚̪̖ͅ "̸̩͓͕)̻̘͇;̹̼ṛe͏̣̞̜tu͔̱̱r̗̪͕̭̞̬̦n̴̳̮͉̲ ҉̖͇̯̭̯̥̮t̶̝͇͖̟͔͍&͖̰̱̖͡&͎̘͇̳̖̱t̵̟̜.͓̱͖̬̫͓̝v̫a͖̥ļu̠̼͍e̥͍͞=̨̺=̭͙̬̞̕=̭̬͖̘n͎̭͖̕}̜̖͖̀}̳̬,̥̪b̲͓͚̝.̲̙͈f̢̦̝̠͍̙̠i͕̥̲ͅn͔̥͙͓͖͓̕d̖̯̬̳͠.͟I̵͇D̸͈̤̩̦̬=̬̣f̧͕̞un͏̖̣c͔̝̰̪̩̗͙t̸͈͉̩i͖̪̙͘o͚̝͡n̩̤(̝̭͓̪e,͈t̞̫̙̠̱̣)҉͇̼̤̤̻͔ͅ{i̼͍̣͉f͈(͍̜̳̝̬ͅ" ̢͖̟͎̠̭̞ͅu̮n̨͕͈d̢̫͔͔̟̭e̻̹̺fin̷̠e͢ḓ̵̻͉̻͓ "̡͙͉!̸̮̪̺=̡t͔̩̱̼͙y̴̪͔͍̥̦p̤̘͉͔e͍̻͠o̴̙f͖̱̻͍̘͡ ̮̣̻̭t̠̗̲̩͕.̻̗̦͖̯̖g̯̺̜̠̳̯̰͡e͚t͎͎E̗̝͖l̷̬̠ͅe̙̘͉͞m͢e͡n̖̼̦t̫͕̩͔B̥̹̻̮y̵I̸̟̼͈d&̜̩̘͇͙̠̮&̨̪̩̜͚̼̫͙E){̼̠͡v̧͈̯a̶̮͕̖̮͈r͚ ̷͈n̘͓̟,͏͈̼̹r̡͉̟͕̖,ḭ̼,̬̣̫̞̰̹ó̗̘̬͚=͙̩̫͎̘t̞̭̫.҉̝̰͙͕̜g̰͎̗̭̹ͅe͙̮̼̗̜͢t͠E͚̯ͅl̷̤e͈̣̼͝m͖͇͙̞̰͖e̹͚n̩̲̩͎t̜̝B̬͔̥͞yͅI͘d̹̟̲̞(͏̤̹̲͔̝͙̘e̜̜͉̞͕̩͘)҉̳͙̺̩͙̪̜;̷̹̹̯̯͇͈i̞̹̘̼f̧͚̭͕̩͙(̳̳o̸͍̭̯ͅ)̤̰̹ͅ{͘ͅi̛̙̜̖̯̭̲f̗̳͓͘(͏̫̩(̨͎̼̗̼n̼̙̮̘͈͡=̷͎̱̩̰̫̣̼o͠.̭͇͎̞̼͘g̹̩͎̖e͚̳ţ͚͇̝͓A̲̙̱t̪̫̥͡t̝̗̗͟r̭̺̬̰͟i҉̫̱͙̼ͅb͉̰͝ú̟̘͎̱̖t̮̮͉e͕̙͖͖̙N̴̤̖̤͍o̡̱͙̠̭̬d͎̱̺̙e̤̯͘(̭͕" ́i͈̘͓̻̖d "҉)̯͖͔̤̥̯̗)&͏̣̺̭̺̟̰&̥͠n͍̹̮̯̗͕.̗͖̣͚͔v҉̩̮a̰̫̗͓̘l̘̜͕̤͈̳̭u͔̰e̶͍̻̣͉̳̯=̗̯̖͖͜=̠͍͖̰=͕̣̦̻e҉̹̼͙̱̲)͉͙͇̩̝r͚̟̪ȩ͙̬̞͉̯̭͔t͇͙͔͚̲̝͘ͅu̸̪̥̹r̸n̘̲̦̯̯̜͞ͅ[͉̱̲͉o̺̪̘̙͞]̸;̷̩̲̦͙̤̟í̯̞=̞̮̫͎̞t̴̻̙̜̪.̷̼̼͇ͅg̩̥̗̰̩e͔t͇̹̭͜È͚̬̬l͍̜̼e̯̜͔̬͈̼m̘̦̠͖̰̳̥e̡n͈̝͎̬t͈s̴͎͎͖̼By͏͙͇̻͇̤̮N͚a҉̰m̥̱̮e̻͙̩̞̥̱͕(͖̘̤͈̺̕e̴̘̫̰͙)̛̼͙ͅ,̭̥̳͖̤̙̖r̶͖͕͙̗̼=̪0̸̤͓͉;͙͇̭̺̰̘̤w̰h̞̗͙͖̤͝i̗̺̙̖̯͉l̫̠̜̲̜͇ḙ́(̭o̴̞̣̠̻=͎̱̖̹̯͍i̼̘[҉̤r̬̝̤̞̫͔̩+̛͚͈̝̝̫͉̥+͈̦̦͍̀]͕̼̺)̺̜ị̷͇̠̖̺ͅf̝̻͘(̬̲̻̼(͍̟̱n̺̫̳=̴͇̹͉̗̗o̢͔.̨̥̝̯͎̗͉̻g͔̜͖̤e̫̯t̙̦A̴̦̬̣̟t͎̹͈̝͍̠̟t̛̥̱̬̲r̖̘̱͖̲i̵̠͍͎b̪̜͚̺̩͝u̙̞͙͉̯t̝̖̗̮̘̯ͅe̻̗̲̻̩̱̤͞N͉̺̻͙̥̕o̟̣̗̬͎͎͢ͅd̥̼͍̱̘̹e̦͕̝͍͜(̟̦̫̣̭͚̮" ҉̼i͟d͓̹͉ "̵͕̘̹̟̯)̧̹̠̝̘̦)̲&͕͈͟&͏͙n̟̰͇͖͘ͅ.̛̥̘̝͍͇̬ͅv̠̟̫̬͟a̖̗̖͇̲̲̤l͖̥̖̩̹̻ue̝̱̱̟̣̗̦=͙̪̬ͅ=̡=̥͈͍e̖̯̮̤ͅ)̵̬r͖̬̳͈̫͕͡e̟͇̱̼̤t͖͔̳̼̣̙͝u̺̹̪̪͜ͅr̪n͇̥͍̖̬[̧̙͎̘͉͚o͕ͅ]̭̗}r̪͍͚͝e͕̜̘͔t̫̦͈͚̜̭͜u͖͚r͓͇̠͈̼n̗͚[̫͇͇͖̕]̗̫͍̰̲ͅ}̱̰̭̱͎͉͠}҉͓̭͖͔̪͉̞)̡͇̟̤͓̬̟̖,̲̫̼̫b͈̺͇͎ͅ.̹͕̻̪͙͙͢f̸͙̺̖in̬͓d̲̦͎̰.̲̱̙̦̼͖T̷̩̪͎̣̹ͅͅA̺͚̺̯̮G̢̦̮̻͕̗=̲̭̥̠d̤̦͍̱̩̩̙.̙͕̯̹g͇͠e͖t̪̩͍͚̪͍͈E̗̬͟l̛em̝̝͕̟͚̭̫͢e̴͔̗̪̻n͘t͇̫͟s͔͇͇̝͟B̰̠̪͕̘y̲̘̥T̴̻̜͈̼͓̙a͖̣ͅg̠̗͇N̺̞̲͖̞a̧͇͕̪m̷̹̙̼̙̱e̶̯?̞͔f̶̩̦ù͚̰̺͉̟͇͇ń̙ć̻̜͕̩̠͕̖t̸̬i̞̭̰̼̝o͙̠̱͓͎̺n̵͓͚(e̲͍̣,t͏̪̜̩̥)͖̤͜{͇̼̥̪̞̭r͏e̲͍̗̠̺ţ̫͕u̡̺r̹̝̣̩̜̪͢n̸" ͈͓̳͕͎̘u̙͉ͅn̛͕̺de̘͙f͙͉̬̼i̦̫̕ǹ̗̱e̤̳͚͔̣ͅd̀ "̛͈̩̟͔̘!̠̜͍̖̝̝̩́=̵t̼͍͔̭y͖̮̯͞p͏̦̻̖͈̯e̟̘̻̻̭ó̩̯͍̰̱͓f̜̯ ̵̺̙̼̻̺̯̟t͍͞.̣̝̙͜g҉è̪t̯̙̮̞͠E̼̲͇̗l̝͕̀e̦͓͙͕̪̝͈m̕ͅe̯͎̱͕n̯̱̪̝t̨̞̱̤̣̠͍̭s̬̦̗̩̮B͎y̫T̸͎̻̭ag̮̘͖̲̻N͉ạ̼̟̤m̢͖̠̠͓̪̘e̞͖̞͟?̻̜͉̬t̠͉.̞g̺̬e͇̫̣͠t̵̪̭̫̳̜̳̫Ḛ̰̤̠̯͘ḻ̸̘͖e̛̞͓m̧̙̹͇͕̥̞̻e̜͉̥͎n͇t̶̞̗̼̲s̸̼̱̞̼̝B̀y̮̞̗͓̹̲T̨͖̤̯̹̜̺̜a̞͖̲̟͞ͅǵ̹N̞̪̗a̜͍͉͔m̥͕͞ẹ̜͖͉͇͔(͓͞e͚̞̦̗̘)̰̤͟:̠̰͎̗̞ͅd͖̘̝̺̪͝.̲̬̟̤͇qs̨̗̝̼̪ͅa̸̼̳̜͓̙̖̻?̩̞͓̬ţ.͕̟̲̘͍̼̝q̤͕̝̹̹u͖̭̠̗̤͇̹e͈̤̥̫̫r͇̪y̝͙̞̭S̝͈͚̯̜e̲̟ͅl̻̗̦͙̗̹̱ḛ͜ͅc̭̯̬̺͡t͖͞o҉͔̬̮̥̻̥r̴̤̼̥̖̠͚͈Al͙̻l͘(͏̤̤͙͚̪̭ẹ̺͖̜͢ͅ)͍͓͉̮̼̥͞:̡̣͔̳͓̲̗v̠̰͚̩̘̬͝o̟͕̪͓̯͜i͕͖͈̙̳͖d̩̝̟͇͕ ̥͈0̢͚͕͚̮̩}͔̪͍̲:̞͍̖͇̬̗̫͘f̨ṷ͡n͈c̥̙̙͓̝t͏̦̻͙i͎̙͉̤̝̳̼o͢n̬͚ͅ(̢e͜,͎̹̥̗t͓̗̞̠̪̼̞)̖̜͓͝{̬̥̘̝̟v̛̜̮̘̱̺͕̮aṛ͎̬̫ n͚͇̦̣,̭͈͍͙r̮͕̭͍=̙[̼̩̪]̜̠̪͘,̧̱͖̲̗̩i͚͇̪̜=͔͙̹̮̯0̺̼͖͓̯͕,̶̫̮o̻͇͕͘=̵t̖̩ͅ.͇͓̱̘̮g͜e̹͔̩t͓̱̥̜̥E̸̜̝̩̣̖l͍̠̩̙̦̬͡e̝̦̣̤̜me̶͈̖̱̲̜̹͖nt̙s̡͍͈͖̩ͅͅB͉͝y̨̦͉̙̻͓͍Ta͍͓̖̬g͇͚N͇̲̘̳̦̯̻̕a̧͙̞͎m̧̜e̙͉(̯̥̦͖̙̖ę)̭͚͍̪̀;̪̞͈̣̝i̞̯̯̖͚f̠̗̹(͇̟" ̹̥ͅ * ̝̺͇͉ "̡̦ͅ=̗͘=ͅ=e̴̫̝)̡̫͕̠{̧̫̦̞̗wh͙̗͚̮̖̘̙i̩l̯̹̜͓͚͉e̵͇(̲̮͖͓͇̬͙́n͔̬̰=̩͖͔͠o̲̩̖̺̰[̫̘̜͉̻̪̥i͖̗͡+̶̣̭̫̼+̩̟͢]̧͈͇)̸̦̲̜1̺̼̖̥=̞̩̬̠͖̰̬=̙̦͔͉̠̻͚=̬n̮̠̖̠̣͓.͕͕̮͕̺̻͢n̥͎̮̪o̘͎͓̖̳̕d̤̙̺̣̳͍̜e̤͙͜T̠̲͎ͅy̩͎̕p̬̠̪͓e̦̬̲͔̠͜&̤̰̮͎&͉̹͓͜r̟̞̝͍̫͇.̳̪͎̩̤̣̙͝p͞us͓͓͉͚͈͇ͅh̴(̠̩n̦͖̙̞͎̪͎)͉̟ͅ;͢r̺̗̖͙̜͜et̜̬̟͇ͅu̖̱r̸n̲̪̖ ̰̫̖́r̵̬̫̯̝̩̯}͕͈͍̙͓re̫͉͚͙̜t̮̖̹̳̞̬ṷ̰̤̗̘r̲̞̲̩͙n̨ ̸̰͎̭͕̼̰̭o̯͞}̢͕̹ͅ,̳̭̮b͚̞̼͎.̦f̠̩̠̩͇̣̣͢i͓̙̭̳͈n̳̖̣̘̖͝ͅd̩̪̙̦͕̞̬.̨͖͇͓͈̺̤C͕̠͇̖̖L̩̙A̶͍͉͔̤͉S҉͕̳̰͍̗̙S̸̳̺̙=̱̪̝̕d̨̳̞͕.g̞̺̖̤̲̱̳͢ḙ̗̟͈̟̟̟t̶E͉͇̮̠l͖é̜͕̘̼̹m̙̹̺̠e̴̟̺̰̲̺ṉ͖̥͇͟t͖̤̝s̴̳͈ͅB҉̘͕y͚C̛̪l̫̲̘̥͖a͚̗̝̭͈͔̝s̝̖̣̻̪͉s̼̙͇N̲̦̠̖̗͠ám̨͎e̴͎̪͔&͖̻̘͉̳͎ͅ&͏̱͕͇̳̣͙f̪̺͡u̷̳̜͇n͏̗̺c̜͎̙t̵i̭o͖͓͇̥̩̘͡n̫͚̖͚̥͞(̛̝̳͉̟͓̯̦e͇̝͙̫,͈̝̪̦̭̙t)̠̘{̭̥̼̺į̳̺̱̮f̖͔̫͞(͜" ̨͖̫ú̙n̰͕̦̠̪d̮͢e͍̟͢f͚̞̟i̫͜ͅn̸͇̺̗̞̱̩̹e̠̹d̮̞̲͠ "̮̘̜̭͖!̼͡=̬̯t̰y͔̩͞p͇e̵̠o͎͇f̙̮͓͈ ̸̻̪͔t͍̦̮̱̳̕.̺̖͎̪g͉͍̕e͙̹̖t̖̹̩E̞͠ḷ͇e̡̩̼m̢͓̬̰͉͇̼e͎̦͈̲n̸͔̪̣̗̣̞̫t̳̫̯͎͕̟sḆ̘̻͞ͅyC̷̫̮̹̮l͍̳͈̮̰̞͝ḁ̛s̩̣͔͕s͔̬͍͈N̟͚̬͔ͅa̝͖͚̺̖͚͡m̳̗̙̻e͕͔̫̻͜&&̤͍͓̮̜E)̙̪̖̕ṛ͓ͅe̡̼̳t͓̯̭͓͈u̕r̴n̺͚͕̯͟ ̷͙͓t.̩̳́g̺̟͚̳ͅe̝͉̝͙̝ṯ̲̮̼̘͍̺E͖̪l̟͔̠͞e̟͎͔͉͖m̱̰e҉̟n͟ͅt̨̫͖̺̯̠sB̢̠̝̲y̧̮̰ͅC̴͚l̯̰̘̣̮̲̜a͈̭͔̼̞͝sṣ͖͔̲̫͜N̥͎̤a̶̙̜͖̳̗̼̭m̴͉e̬̪̭(̗̱̹̙ḛ̝̪̖͈̞)̮͓̦̀}̡͙,̪ş̥͎̖͇̟̹=̴̥̫̞̭̰̻̜[͏̖̝̗̭ͅ]̼̺̘͔,̝͓̥̮̻̱͢v̷̩͉̘̠̰̮=̴̙̥̻̟͔͓[̼̫̠̫͝]̮̫̻̞̮͟,͈͍̠̗̟̥(̸̼d̨̠̲.̷̜ͅq͇̜͈͙̼̬͢s҉̗a̝̪̝̪̲̲͠=̡̝͔̥̮̲K̯͢.̛͖̥͕̹̺̞t͟ȩ̜s͜t̺̦͡(̺̹̠̜̩́ͅC͇͕̦̹̯̲̹͠.̡͓̥͍q̶̤̮̟ųḛ̛͚̣͓̜̪̠r̦y̕Se̞̘le̵͔͕̮̭c͙̥̻̩̞̖̗t̴̻̼̳̗o͉̘̙̺̲̻̹r̨̭̝̲̟̖̰͖Al͔̪͡l̰)̰̮̩̟͙͈)̵̭̤̘͈ͅ&̣͚͎͓̳̠̼́&̷̖̻̥(͕̭c̛̯͎̩͉͔̞e̪̥̯̳͍̼̘͠(̴͍̗͍̺̮̞̼f̹̦u̧̝̣ͅn̝͇͕̼̻c̮͕͍̲̦͇t̫̺̯i̖̞̟o̗͘n͚͔̫̯͖̼͕(͖͉e̗̬̤̤͢)͏̳{҉͈̠͓̤v̜̻̯ͅa̠͕̯̠̦̳͟r̯̼̩̱̞͚ ̘̲̯̤̺t͙̰̱̙̯̩ͅ;̸̙̻̮͉͇̩̲ạ̸̱.̤ạ̷̞̩͖̯̭p͔̖̩͇p̟͉̬̞̖̗̰e̘͍̝̼̗̜ͅn̲̳̲dC̴̞͈͎̼͍h̴il̛d(͎̙̬͍͕̼̹e͟)̥.̣̬͖̲̪ị̫̙͍̮n͉̞͈͎̳ń̬er̛̪H̱̜̤̟̤̞͘ͅT̟̳̥́ML̢̮̩͎͓=̨̺̤͕̜" ͍̘̕ < ̲͉̻̰̞a͎̮̜̣̦̘̤ ͍̞͓͇̣i̺̖͉͙͎̫̲͝d̸̺͓ = ̫ '̝̭͖̀"̥̦+̜̯̫͓͙S̠̳̩̯͓̟+̭̣͎̳͢"̲͉' ̵͉͖͇̙ > ͓̠̦̟̙͉̫ < ̧͚͎̮̺͉̱̘ / ̟͚a̛̯̳ > ̢̣͚̱̣̱͖̲ < ̛̹̙̭̗̣s̰͔e̬̩͈̹l̴̙̪̹͍̘̯ͅe̶̫̫̗̦̗͓c͓t͚̫̻̮̫̖̀ ̛̬̩i̳̣͇̥̬̦͇͢d͖̦̞͈̖ = ̵ '̝͙͖͈͙"̵̖͙͎̣͚+̦͙S̫͙̘̭̝͓͘+͔̱"̢͖͓̦͙͕͓-̟\̫̪̪ͅr̴̳͇̯\̪̠̯̻̻̖\͈̫' ̬̻͕ ̷͇̱͍̜̲m͎͈̹s͚̻͎͇a̱̦̕l̛͍̯̟̥ͅḻ̯̤̺̩̞͢o̻̦͈͔͎͔̫w͓̜c̝͖̬͖a͙̞̩̝pt̷͍͕͓u͕͡r̦ẹ͜ = ̛̮̹ '̛̗̲̗̭̰' ̮̲̘̝̳̩̹ > ̥̯͕͔͜ < ͇͇̲o͉̗̼p̨͕t̤̙͇i̪̖̜̮o̠͘n̘ ͎seḷ̦͕̼̰̕ͅe͘c͟t̺͓͈͙̻e̜̥d = ́ '̸̤̳̗̥̹̭ͅ' ̹͠ > ̠͚ < ̡ / ̹͈̜̱o̫͖͉̪̫p̨ti̡̮̬̲̼̼͕o̲͙̟ͅn͙ > ̕ < ̀ / ̬͍̟̦̰̟ş̩͙̺̙̻̬̹e̠̥͇̦̻̤͖l̪̺̱e̴c͏t͞ > ̴̣ "̯͕̦͖̞̯̤,̬͍̞̘̘̻͢e̥͉.͖͈̤̦͕q͍͚̩̬̦͞u͔̩̻̥eŗ̦͚y̖͉̲Ş̟͍͓̟̺̙e̹̣͎͢ĺe̶̜̝c̸͓̩̫͉̰̼t͔͠ͅo͓̖̞̣͉̯͝r̮͕͉̮A҉̻̻̱ͅll͍̟͉̘͉̹͇(̣͇̻̜͎" ̘̭̝̼̫͇[̀m̹̬͈̤̰͔̙͝s̞̱̙͔̼̗͈a̮̹̘̞̭̣l̥̤̦̀l͖o͠w͕c̥̙̺a̶̝̝͓͚p͕̙͈͔̜͜t̹͚̲̯̹̤͓͠ṵ͎͉͚͈͇̲͠r҉͈e̺̜͙̟̻̻̱ ^ ̲̻̗͖͔ = ̼̼̗̠͞ '' ̪͖]̦ "̗̀)̖͕̞͕̺̩͞.̤̤͕̘͔͡l̠̙̻̥̜̫̕ͅè̼̝̹̤̤n̡̬̖͙g̳̖t͈̳̙͔̥̰h͙̹̣&̩̤̫̬͇̜&̲͖̘̳͘v́.̤̤͎̤̼̘̮͡p̲u̺͓s͉̳͚h̺̠(̢̰̬" ̶̩͖̱[̻̬̞̺͟ * ͕͙ ^ ̥̰̣̮̯̲͞$̠]͢ = ͇͙̥̞ "̶̞̬̗̪̰̫̯+̨͕̩̯̩̮̝M̷͇͉͖̦͓̲+̰̠̞͔" ͏̠̣ * ͍͈̪͉̹̻̞͠(̜̲̣͓̹ ? ̹̺̀ : ̼̻͎ͅ '͚̜̺̝̖' ̧ | ̛̳̖͎̼͔͎̥ \ ̯̰͕̥ "̠̤͙̪̩̬͝ͅ\̱ͅ" ҉)̤̗̹ "̡͕̖̺̮̠͉̥)͘ͅ,̥̠e̗͙̘̼.̝̤q̷͍̙̻͎̫͉͈u̦͙̘͔͙̕e̵̫̬̖ͅͅry̴̯̠̙͍͕ͅS͏̩̮e̛̤l̛̞̮̫͇̳̮̘e̯c̩̰͔̺̪̻͇̀t̳̘or̰͔ͅA̻͓͢l̨l̦͇(̣͖̪̞̭" ͈͕͈̣[̳̰͚s̩̭͖̙̪e̖̳̝ͅl̢̝ḙ̳͎͇̬c̷̠̖͇t̹̗̖͝e̬̗d̢̟̙͍̪͉̺ͅ]̡̙̞̖ "̶̰͎̰͚͓)̯̞͎̼̮ͅ.͏̝̻͙̼̠̪̲l͎͟e̯̠n̻gt̤͖̺ḫ̬̘|̜̮̺͍̻|̤͍̠͝v̯̠̘̣̼̀.̬̜̻̣́ṕ̫u͈̺̟s̕h̛̲̻̣(̭̝͈̯̣" ͚͎̰͇̼ \ ̙̹ \ ̝̤͓͉[҉͇̠̞̼̬̩ͅ "͈̣̯+̨M̧̯̭̟̹̰͓+̝̬͖̼̗͙̰͞" ̳͟ͅ * ̩(͇̺̯̖ ?  : ҉̫̥̫̱͚ͅv̨̺a̙̜ļ̺̭͉̜͎u̧̠̪̰͚̱̪e̪͉̠̜̝̭̕ | ̤ "̛͇̙+̺͈͚͔͙͎̤R̢+͇" ̙̥)͡ "̵͔̫͈͚̬̙͔)͖̫̠̙̖́,e͎̺̪̲̲͝.̼q͟u̦̦̩̹̲͠e̯r҉̦y͚S̳̬̦͓͔̠ͅe̪̙͈̦͔̥͇ĺ̼̝̯̻e̲͙̗̳̘͇̰c̲t͓o̼̗r̯A̗͘l̹͎l̲̲̺̪̯̯̻(̞͍̠̼̖͉̤" ̻͔͖̮̜ͅ[̙̹̦i̘͙͉̫͍͙̳͝d͎̰͍͉~͚ = ̢̰̭ "̡+̴͎͕̺͕̜ͅS̡͚̩̱̘̖̙ͅ+̖̫̳̜" ̦̺̫̰̼ - ̪̼͙̟̰]̲̹͕ "̕)͞.̠̹͚̫̲l̫e҉̹̺͈̱ng̳͔̝͈̹̦t̮̺͍̺ͅh̭̟|̡͉̰|̸v̛̲.͍͍̖̲͍̯̤p͇͉us̜̩̞̟̮̥̝h̯(̳̫̩͔̥̰͞" ͈̖~̺͎ = ͓͉̮ "͈̮͉̪̫̕ͅ)̲͔̣̤̠,̻͇̠͙͕̲(̧̮̮̱̭t͈̻͖̭̗͎̗=̙̗̰̝C̨̤̺ͅ.҉͖͕c͈͉͈̰̗r͙ea̰̪̘t̻̤̱̞̮͝e̘͖͉̩̹̬̕El̹e̵m̧̳̼͙e͉͖̤̙̦͢n̞̥t̀(̬̥̺̣̯ͅ" ̵̟̦̘̞͕i̗͕͕͈̺̭n̤̜̱͈p̝͠ù̺t͓̱͔͠ "͠)͇͝)̙̝̩̖̝̣̰.̰͎̥̲͡s̝͕͕̝̱̘e̮̻̮̫̗t̥͖̟̙̖̙A҉t̸͔͖͖̦̺͙t̫̩͈͚̤͎͈r̲͖̥̜͓i̙͇̕bu̟̞̳̱͙t̼̠̪̙͍͉ͅe͏(" ̳͢n̬̝̲̘ͅa̪̠͈͙̜̠̻͜m͙͚͠e̗͈͝ "͎̘͖̻̼,̣͉̱̹̩̘͉̕" ̶̺͍͍̪ "̸͙̙̥͔̤̦)̲̞̳͙ͅ,̮͙̘̺e.͕̀a̜̬͙̜͞p͍̺͈p̢̲̗̜͓̱̲̯e͓̣̱͕ṉ̼d̮C̘h̹͠i̙̣̹̩l̡d̳̟͓̱(̲̞͙̭̥ͅt͓̜̮͈)̠͚̞̜̣̕,̹̖̣e͔͎̩̣̻̳.̞q̤u͖̜̱̳͇̥ͅe̩̪̤̲r̷̥̗̮y̺̜̜͓S̛̖̮è̪͈̭̺̪͈l̠̱e̦̫͠c̛̭͍͔̦ͅto͟r̮̖̯A̡̱̰̬͎̟̙͓l̗̠͖̼̪͝ͅl҉ͅ(̭̟̬͇͍̦" ̗̝͓̝[͙̞̖͟n̙͚͖̲̳̕a͈̝͖m͙e̕ = ̀ '̨̹' ̷̝̱͙]̵̩ "̩̱̪̜)̠̞̝͕.͎͝l̪͖̺͚̲͚͡ͅe͖͚ͅn̙̘̪͍͎g̢̮̘̤̼t͘ͅh̩͢|̲͎̰|͉̗͎v.̩̪p͖̯̘͚̝̝͖us̩̲̥h̺(̹͝" ̩̗ \ ̖̼͉͙̳̭̬ \ ̶̗̖̤[̤̟̞ "̰͚̞̣̹̝+̩̦̗͈̪̞̳M̟̘͔̜̺ͅ+͢" * ̷̣̮͙̮̳̰̪n̗ame̪͚̠ "̙̪̮͍+̮̰̤̜M͎͔̣̱̀+̳͇̞̕" ̧̳̹ * ̴͎̰̲͙̠̖͉ = ͔̰̭͙ "̼̘͡+͈̲̪͚͎ͅM̥̞͇̺͖̹̝͟+̡̻̤͕̮̖̪" ͍̀ * ͘(͇̭͠ ? ͇̤̤͓͉̼̬ : ̵̱ '̪̫̺̝̩͠' ̶̬̙̯̰͉ | ͘ͅ \ ̥̘ "̜\̭̝" ̭̟͉)̮̫̥̤͔̪̱ "̨̘͓̟)҉͕,e.̠̠q̝̀u͕̖e͘r͇̹͈͕̝y̛̱͇͉ͅS͉̹̬͟é̹̺̲͙͔ͅl͇̭e͕͚̯̭c̸̦ţo̲͈̦̣̰r̭͇̤͟ͅA̡l͕̫l̟̣͈͓̮̼͔͟(̡̮̪̪̬̺̬" ͖͍ : ͏̣͎̮͈̬c͈h̴͔̘̲̜e̫̯̺͉̺̼͎c҉̬͓̟k̶̪ed̩̪̜̼̫͈ "͇̳̼̼)̗̗̤̣̙͟.͈̹̠̼ͅl̤e̦n̝̯̙gt͕͓̝̮̥h̺͠|̮͙|̧͍̟̼̖͎v̷̺̭̼͍̺̥͎.̛̮͚͍͇̖̙ṕ̞̤u̢̩͙s͎h̝̣͔͔̝̦̀(̱̭̭̰̮̲͢" ̰: ̙́c̺ḩ̜͇e̴̘̦̞̠c̠k͝e͚̦̬̪͖͟ͅͅd "̛̘̬͉͓)͚͖͇͓͟,͓͠e̶.͉͈q̟̘̜̰͡u̜̫̱̣̹̲̫e̷͇̳̘̦̜r̹y̬̹̮̣̗̘S͏͈̺̺͎̝̤͕e̲̼ͅl͟é̝̠̠͚̥̪̠c̝͚̣̦̠͔͈͞t͖̠͙̕or͎̫͡A͇̲l͍̖̯̳l(̪" ͟a̟̹̟̬̤ # ͎̟̬̹͎̬ͅ "҉͓̭+̟̝͓̝̝͔͓Ṣ̵̝̮͓̙͓+̵̳̦" ̵̤̬̖̖̝̮̺ + ̟̪ * "̷͕͚)͠.̞l̢͇̻̼̺͔e͕n͓̦̹͍̦̪gt̡̲̤͇̖̤̝̣h̷͉|̧|͏̪̲͈v̦̹̮͉̭͇.p͚̳̝̜u̦͠s͏͓h̜(̷͖̪̙̝" ̮̘͠.̧̰̣͙͎̣ # ̴̱̼͔̼͍̫͓.̯̩̝̻͓͞ + ͍́[+͉͍̣̱̣̼ͅ~̷̰̮͕͕͉͖ͅ]̛͕͉̬͕ "͇̤̼̤́)͕̙͎̼̪,̰̻͓̞̻ͅe̫͎̣̺͙.̮̘q̥̗̜̘̪̲͜ue͔̻r̨̖yS̜̞̣͇͠e̹̹̩͍l̵͙̪̼̠̱e̼̰̥̱̬͝c̼̻̥t̛͙͇̭̗͉͖o͉̻̻̯̪͍r̘͡Al̵͙̩͙̠̤̜̱l̫̫̹͍̟ͅ(̟̭" ̙̼͕̗͕̻̕ \\ ̴̹ \ ̸͕f͈̟̪̰͇͎͘ "҉̬ͅ)͇̤,͈͕̜̫̳̥v̸̱̗̳̘̟͕.̶̝̝̙̘͎p̱̰̼͎͉̞̲u͙̺͠s̹h(̢" ̦̣[̦̖͕ \ ̧̜͕̼̤̣ \ ̟̖̗͕̪̹r̮̤ \ ̧̦̬ \ ̡̖̯n \ ̘͉̙̰̜̝͠ \ ̝͔f͡]̙̥̫ "̢̤͉̖̩̦)̬͍͙̫̗ͅ}̱̟͓̪͚͎)̝͖̘̤͚̥͠ͅ,̥̖̙͈̱̙̼c̹̀e̗̯̲̻̠͎̯(̻̙f̦̰̯̞͍̩̥u̱n͈̦͚̼̹̝̬c͔͇͡ͅt̫͔̻͈i͕̜̲̖͙͕̜ọ̴̺̩͍̤̠͉n̸͓̼̜̖̞̖(̻̖̦̙é͙̟͎)̯̯̗̖{͙̜̗ẹ̺͈̠̖̻̖.i̟͙͡n͍̲̤͕n̲͉͕͙e̙̯̪̪̦̼̬r̳̟̱͕̹͔̻H̫̫͖͈͉́T҉M̬̣̜̠̺͚̮L͔̩͓͈̖͔=" ̡̠̳͍̜̲ < ̰̱̪͖̻a̻͕̙͕̣̯ ̟̹̫͉̹̖͕h͓͈̲͍͍͟r͇̳͙̫̪͉̗̀e͙̹͉f̺͇͓̻̩ = ̘͎̥ͅ '̘͚̫' ̢̲͈̱̘̜ ͉̻̱͕̳̟̗d̥͠is̩͇a̸̱͍b̼͡ḽe̪d̝̖͚̘̼̘ = ̡͖̫͕̣̮ '͏͚̝dis̘̜͉̱͙a̜̩ḅ̪͈̱̤ͅl̜͇̠͈̹̱̤̀ḙ̩̮͙̗̥̬͞d͎̣̮̭́' > ̦ < ̟̹̻̰̲͟ / ̖͍͓͓̥̙a͍͍ > ͕̯̺̺̼̪͟ͅ < ͏̬s̺͝e̪͕l̷͖e̡͙̖c̫͟t̺̰͍͓ ͈͘dis̟̗a̯͔͚̪̦̻b̶̗l̡e͕̻̭͓d̥͍̝͇̮͙ = ̸̺ '͕̮͇̝̖̞ͅd̨̮͖i̧͎̺̼ș͍̘̠ͅa̜͍͍̰ͅb̨̦̥̞͙̣̤̬l̳̖͔̬̦ȩ̘̫d̻̻ͅ' ̗̮ > ̤̤͍̱̲ͅ < ̸͍͈̝͉͓o̲̫͖p̟͕̲̺t͔̲̳̱̪̲͇͠io̺͟n̟̹̩̞͕͚̻ / ͕͇̗̙ > ͔͚̙̖ < ̨͍ / ̨s̼̫̪̘̝͎e̦le͈̦̠̙c̤̺̀t̶ > ͝ "̼̳̪͚͙ͅ;v̬̬̮̖̪̖͢a̜͚͓̠̯̘ͅr͏͙̬ ̪͔͇̮͚̣t̹̰̘=͇̳̯͔̹̰̮͢C͓̤̕.͕͍̦̪̻͕͈c̢̥̙r̙̠ḛ͔̞̪a̡̦t͇͔̲͔̲̹̙e̷̼El̮̠̜͓͚͇em͙̩͈͈e̳n͉t̡̟̖(҉͚" ̜i̲͈n͚͝p̗̺̹͉̖͘u̟̗̫t̯ "̡̺̯̬̠)̬͎̱̭;̢t̷̰̼.͢se̖̯̙͎̤t̤͓͍̩̯̞̫͜Ḁ̭̳̞̝̯tt̲͙̥̗͍r̻̰͈̜͝i̖̻͖̠͈͈ͅb̸̫͔ú͚̱̫̖t͎͙é̺̠̻̮͇͙͉(̜͝" ͍̮t̜͓̲̩̬ͅy̳͔͉̞͎̱͘p̣̪̬̻̀e͎̥ "̰͚̼̟̳̹͉͞,̛͈̟̙̮̪̹͙" ̭̝͞h̗͈͔̞̖̯̱͜id̩̻d̷̹̝̯e̶̠̭̬͇̝̰ṉ̥̣̪ "̣͍)͙̤̘̣̫̕,̗͖̻͚̗͉͞e҉̞̖.̧a̛̟p͙̼ͅpe̟̠̦̦͎̘ͅņ̫͖̻̙̼̩d͇̥̟͉̲͡Ç̠̩̣͓̺h̤̘i̙̦̩̦͝ͅl̩͇̩̫̠d͕̻͍̻̀(͕̖͔͝t̵̗͉̖̳̳̻͇)̛͈̥̜̣̰.̝̙̠̟̜͈͡s͢e̛̫̯ț̶͔͉̞A̵͕̥̭̮̭̺t̕t̟͝r̙͟i̭̙̝̱͟bu̶̳t͟e͇(̨̱͕̼̲͎̜͉" ̤̥̲͕̥n̸͈̺̪̭͍̟̦a͘m̳é͓̫̘̳͓̳̜ ",̩̹̫̘̫͚̙" ̼̩D̢̥̺͔̹ "̠̥̞̠͜)̣ͅ,̮̀e͏͚̦̯̟̼̹.̲͖̻̟̝q̶̠͔u̪̳̤̹͕e̦̤̜̥͍r̻y͙̳͚̹͙̹͘ͅS͈̖̱̪̙̱̙͝e҉̥̭̻͖̝̖̺l̠͚͍̖̱̩͝ȩ̲͎̣̤̯c̛̳t̘͔̭̝ͅo̪͓̗̩͠ͅrÁ͔͕͈̘̲͍l̢͇l͙͡(҉͙͕͉̩" ̞͖̜ͅ[̳͇̝̺̼n͓̼͈̜̘͔̳͝a҉̪͚̜̹m̩͞e̜͍ͅ = ͝d̘̞͝]̘̥ "̬̥̝̝̮͓)͔̣.̟̙ĺ͚͔͇e̸͖̙̯̯n̩̜gt̸̻̭h̩&̴̘͙̦&̘̖̜̣͔́v̴̯̥͉͍̖͚.̧̳͖̝̘̻͕p̩̭ù̖̬͚̲̖s̜h(͠" ̲͠n̟͈͚͔͉a̷͉̗̖ḿ͈̭̗̪̭͚e̱͚̜ "̥͓̗+̱͡M+̮̞̦̙̳͟" * ̛͓̻͉̰̮̣͙[͈͓͖̮͕̮̱ * ̺̯̯̞͘ ^ ̧̱̩̘͖̩ͅͅ$̖̣̳͚͍̭͍ | ̬͝!̗͚̭̖͉̖̕~̭͇̳̫]̬͔͚̰̬ͅ ? ̠͓͓̖̝̩̬̀ = ̖̳̹̦̮ͅ "̵͚̖̥̣̺)̙͓,͎̤̮̦̯͖̰2͔̤!=̖̞̬͉̩̹̥=͔͇͍̤̜́é̞.̧͈̱̰͍̮̮̺q̵͍̫̝̙͎͓̫u̮͕̗͎̜͎̥ḛ̡͙̫̫̜r͍y̬̘S̡̲̦̰e̼̙͖l̟̗̯̙̭e̞̫̠͡c͓͓t̼͎͙̘͔͠ͅo̸͕̩r̼̯͕̤͈̩̻Á̪̪̭l̴̜͖̗ͅl̻͈̯ͅ(͈͞" ̠̜̙̀ : ̺͉͔̻͖̻e͙̰̘̺̠̕n̛̰̦a̯͙͍̣͞b̝̩͘ḷ̗̹͙e̶̠̯̬d̵ "̬͙̫̕)̛͚̟.͢le͎͖̰̥̫ņģ̫̘͍̼t̥̲̫̤̭h̷&͖͉͜&̯͓̖͈̫v͖̝͍̰̹̰.̱̲̠͕̹̪͖p̵͇̤͕u̞̲̬s̬̭̻̲̼͍͓h͠(̟̺̭̟" ͙̰̯̱͚: ̗̱̦̹͢ͅe̛ṋ̙͎̳͙͇̻a̴̤̝̺͚̩b̡͉l̷̬̩̼e̢͈̩̠̰ͅd "̘,̠̘̙̟͕" ̷: ̠ͅḍ̯̖̫̺i̷s̷͔͍a̲͓b̨̝̩l̶͔̠̥ͅęd͎̩ "̤)̯,̞̖a.̝̦͘a͓̥p̲̥̻̺͡p͕͓͔͇͇͈e͙̪̱n͈̭̫̬͕͢ͅd̮̱̲̟ͅC͔̲͚̳͟ͅh͚͚̱í̮̭ͅl͠d͡(̧͉̘̪e̘͖͇̯)̭̞.̶̝̬͕̠̠ͅd̺̺̗̠͖͈i͓̙̻̱̯s̳̤à̼̝͚̻̣̮̝b̢l̛̰̫e̪d=̳̹!͓̥̠͚͔̮0͙͇̳̩͎͙͔͠,̤̰̜̬͖̗͟2̷̟̝̮̦!̰̣̻͟=͇=͙͇͍̗̗ẹ̰.͖q͉͇̺̼̜ͅu̷e̱̩̟̬̯̞̯r̟̖̬̻̝̼y̗͓͖͍̱̞͘S̳̜̮e̹̤̰̺l̥̩̗̪͙e͏̭̻̹c͏̥̳̜͓͚țo̼̦̜̟͇͜ͅr̶̦͚ͅA̝̝͓̗l̥͈̗̘̺̰̪͘l̩̲͍̥͚͠ͅ(͓̟̠": ̯̱̖͓͕͞ͅḑ̣̹i̜͠s̵a̖̪̖͈͈͘bl̘̪͘e̥d̜̞̞͓̫ "͕̠͖͓)̧̺̼̜.̦͖l̀ͅe̙͓n̬̩̹̙̭̫g̸t͎̹̭̬͠h̺̬̯͖̲͉&&v̤̤͇̯͇͝.̹̼͝p҉̲̝̻͔̗̠u̳̙̣s̟̱̟͜h̨(̺̖̯̻̰̕" ͙̹̮͉ͅ: ͎͓͔͕e͚̭ṋ͎͇͢a̸͇͎̱̟̟͍b̕ḻ̹̬̮͇̮̥e̮͉͉͡d̟̠ "̵͔̮̯,̻̲̗̳" ̮̞͚̥͓͖͙: d͓̯̠̼ͅi̢̜̮͖͖s̼̠͜ͅͅa̢̦b̖͇͚l͔͎̭̱̤e͍d͕̜͈̼͍̪ "̠̜)̺̠̪͉̟,̦̜͖̘͇e̩.̨q͎̻͍̲͇̥uȩ̳͙̳̺̩̱͔r̵y͏͈̘̳͇̙S̙e̱͎̠̙̱̗͍l͏͉̫̳͕̲e̷̦͉̼͙̮c͚̠̦̦̜t͓̩̤̲̘̘̫o͉̥̝r̵̺̬̱̺͙A̗l͉͇̲̤͈̝̭l̝͎̱͕͘(̜͕͕̞̙̯͢" ̵͈̜̱̖͓͇ * ̧̟͓͎̯, ̢̞: ̻̤̫̹͎̘x̫͇͉͇̦̕ "̧̙̹̦̖)͏̠͎̰̦,̠͕̙̝̣̹͕v̳̙̱̟̣͈̣.̹͈͈̩̲̪̲́p͓͎͝u̲̮͙͜s̹̱̜̬̱h̩͇̺(̭̣͎" ̯͎͔, ̬͉̤͖̤ͅ.͓͇̝ * ͙͙͘: ̪̤͢ͅ "̩͔̙)̴̝}̘̦̬̟͕)̥̗͓)̣̻̺͔ͅ,͓̜͍̮(̳̘̞̯̙̮̪͟d̬̦̠͎̺̭.̧̮̳̤̖͍m̹̤̮̫̗̗̞̀a͘ͅt͉͕̩̘͙̤͓c̠̲h̳̲͉e̹̥̞s͖Se̻͔l͍̙e̶̟̗̳̞̣̺̣c̖t̸̺̬̞͉̠̗͙o̪̘̖̪̘͖̹͡ṛ̩̼͕=͕̤̞̗͔K̠ͅ.̳t̺̤̼è͔s̨̫͕̲͓̬t(̣̹̕c͉̫̭̬͢=͎͓͍̯̩̕a͓͚̗͞.̠̜̟̺͚͙m̧̳͕̺̩͓̫͔a͓̣̥͠t͔̭c͕͉̘̀h͕͚ḛ̻͖̱̦̩͖s̳͇̭̖̜|̳̗͔͇̩̼̦|͙̦̥̝̣̙͍͜a̙.̧w̹̙̤̟͡e҉̺b̀k̠͙̪͇̳̗i͏̱̮t̝̕M̟͍͔a͚t͉̕c̛̳̦̜h͇̘͇͈̯ę̻̬͉͎̞ͅͅs҉̲S̮̖͖̤̲̪̠e͕̥̤̥͖̖̪l̞̜̪̣e̹̞͓̼̰c̡t̘̤͓̀o̢͚̟r̝̩͍|̛̪͚̖̖|̩̦͕͔a̡̝͙̩.̖m̨oz̧͇M̘̱͝ͅa̺̪t͚̤̪͎̙c̦̖̟̞͇͔̥h̡̗̫e̻͎̯̼̗s͏̝̳̞̝̳Ș̖͈̤͇̗͔e̘͢l̻̣̺̙̳͎̕e̞̳̲̹̝̲͎ç̜̣̮t̼̫̳͚͉́o̶̲̜̞̭̺̞r̺|̗̫̬͔̺̼̜̀|͉̳͔͙̩͍̳a.͇̤̗͍͙̕o͉̙̦Ma̬̺̦ͅt͉̦͚̣͖̗̫͡ch̜̯̖̜e̘̝̞̬ͅs̺S̙̼̙e̫̖̲̞̦̮̺l͏͓̯e̙̻̥̜̖c͕t͎̘̬̩ơ̜̞͚̱̞̺̰r̼̫̯̖͚̦͝|̴̤̮̯|҉̼̪͔͎̙̱a̘͈̪.̭̙͝m̴̭̯̤̺̲͔s̗͉̲̀M͎̼̲̻͕͢a̜t̮͎͈̙cͅh̟e̹͜s̷̭̪͍͕̺͖S̨̱̠̖͎̹̱͖eͅl̼͖̮͍̦͘e̛̹̫̦͉c͇̠̣̼̝̦to̳̯̟͓̟̱͇͝r̝͎̣̥̕)҉)̖̹&̛&̰͙͔̝̤͚̜c̡̱̠e̴̯̫͔͇̺(͜f̞u̙̲͇nc̯̀ti̡͕͓̫͍ǫ̮̯͍̗̗͓n͎̪̺̤͔(҉e͚͈̲̻̩̞̱)͕̗̭̙̯{̟̜͕d̩͔̲́.͈̘̳̺̼͚ḓ̯̤̫̳̹͜i̖͔s͙̻͉͙c҉̬̥̦o̞͠ͅnn̰̤̘̬͈̦͙̕e̜̟̰͖̰͕̮ct̯̭̬͡ed̻̥̮̟̞M̲̼̹̪at̺̳͘ͅc̸̱̻̠̤͍h͙̼̯͎̖̰͓=̝̗̰ć͕͓.̶̯̘c̰̲̠͍̝̺a̜͓̭̤̥̦̺l̠̱̯̰̠̲ͅl(҉e,͍͓̜̜̩" ҉ * ͈̼͘ "͉̹)͓̬̰͔̘̞͍͢,͎̩̳̤̺͔c͍̖̹̖͔.̷ͅc҉͙a̡̘̻l͉̠͍̙̀l(ȩ̪͕,̴" ̶͍[̜͎s!̲͕̬͙̗̗ = ̫͚͖̣̤̺ '͓̥̯̱̦̙̹' ̻̘̠͢]̛̝̻͈: ̖̬͍͙x̞ "̗͈ͅ)͇̲,̗̦͍̹͙̼͠s̺̼̪̰.͜p̝͓̜̱̺̯u̻͚s̹͕̫͇̹͈h̖̞̦̀(̜͉͙̹̟̕ͅ" ͈͈̙̖̩!̧̪̤̭̮ = ͚̠̲̩̮ "͖̹̕ͅ,̸̼̺̲̤͖͎̣F̥͉͙͜)̸̮͕̺͖̥̦͖}̹̞͎̘̘͎̱)̲̝̜,v̞̟̹̝̭̼̠=̳v̫͎̜̭͉͜.̯͈̙̼̟l͏̪̮e͓͕̰̮ͅn̸̤͙̱g̩͙͜t҉̦̗̹̦h̻͇̬&͜&̼̞̣͖ͅn̤̮̘̹͘e҉͚̞͚̮͇̫͕w̶ ̘̳R̶͇͔̳e̝̩̜͢g͕̠ͅͅͅE̺̤̪̗̭̫͞x͇̹p̷̺̬(̦͎̹v͙̤̥̪͇̀.̬̣͈j͚o̫̼i̵n̘̟̳̤̰͘ͅ(" ̸ | ")̛͓͕͖͈),͕s̳̖=̭͇̺̥̱͓s̘.̖l̟̖͙̤̰͕̞͝en̺̦̫͉̻͚g̭̭̭͔͚t̠̠͙͙͜ͅh&̷̠͔̥̱̬̬&̘̗͓͔͇͘n̖̭͔̖ȩ̱͍̤̩͉̮͖w̮͈͔͉͢ R͖̺e͡g̼̰E̗̹̤̟̙͡xp͇̞̗͉͕̕(͙̳͙̺͍͟s̼͚̝͇͡ͅ.͙̠̳̝͝j͏͔̘̟o̝̹̩͈͕͙͠ͅi̟̰̣͈̖͇n͔͝(͈̬̤̖̲̗̦" ̶̘̮̜͉̪̪͕ | ̮ "̗̠̣͇̠́)͏̜̟͎͔)̹̯̱̠̟͡,̷͈̠̰̱̲t͚͎͟=̡̬̙̯K̩͔.̵͉t͔͎͕͈͡e̛͇̞͈̖̬̰̜s̳͘t(̘̟̘̯̼̳ͅa.̨̥͖c̟o̩̖͠m̴̬͍͚̭̥͍̰p͙̹̯̬͚͍a͖̯r͉͈̻͕̳̱̯e͉̫͔D̥̰̤̰̟́o̦̳c̩̮̰̙̜͙͚um̦̖̱e̷̫̹n̰̭̫͖̯̝̣t͙̻̣̰̣P̥̪͉̯͚̠̟͠o̶̼͍̪̝s̶̺̙̳͚̗̲̣i͈͇̪t̸̟̤i̢̲̫͚o͕͇̖̖͔͞ņ͙͍̜̙̜̭̫)̥̲̖͎,̨̣̗̼y̘͉̗̙̣ͅ=̞͖͇͖̥͢t̖̼͔͉͇|͙̟̭̠̟̦|̕K̺.͚͉͈̗͍̬̠t͉̟͉̗̫e̝̼s͇̪̬̳͢t̕(͏̥̱̤a̖̮̞̩̕.̴̟͈͕̜̺c͖o͉̩̥̗͙̦̤n̬̙̻t̷͕͉̥͕a̠i̱͖̙̠̘͇͖͝n̼s̶̲̲̞)͕̝̰͢?f̖u̡̗͙̝̖̱͎n̩c̷̻t̮̯̗͍̘i҉o̧̲͙͚̪n̖͙͔͔̝̳(̡̮̫͓̠̼͚e̜̻̥̞͔̦̗,̥̣͔͓t̴̖̗̙̖̪)͔̖͇͍͓́{͈̘̠ͅv͓a̻̦̘r̮̫̬̠͚̪ ̧̯̯̝ņ̺=̤̬͔̘̰̹͉̀9͔̝̥̤̩͕̱=̟̫̝̮̣̙̻==̘̭͙͇̼̠͘ͅe̳̟̳̖̫̗̳.̛̥̭n̖o̞̦̘̤͎̗d̝̪͚̖͜e͙͕T̷̘̠̣̥̻̰̖ỵ̯́p͏̟e̷?̮̞ẹ̀.̹͙̗̮̱͙d͓̫̝͕̼̬́o̺̩͜c̣̜̠̻ͅu͉̳͍̯̳͖͇m̨̩̞e̫̗͎n̻̮̝ṯ̮͚̞͚̯̫E̪̦̕ͅḻ͔̠̬̪e̟m̥͙͖̤̬ḛ̵̲̬̹ṇ̹̝͈ͅt̟̥̭̩̫̼̤́:̙̰̺̹̕e̠̳̦̣,̬̻̯̜̻́r͎̗̻̤̻̭͓=̰̤͉̀t͏͉͔̬̭ͅ&̝̖&̬͠t̖̙͉͞.̞͎̳̬̺ͅp̖̳̣a͍̯͔r̹͇̪e͇͎̮̘͖͕ṋ̟͔͇͇̳t͉̙̀N̵ơd͙͖̬͓̗̫e͏̰;̸̜̻͈̲̩͙̤rę̞̟̖͚̖t͖̞̯u͏̯̳͔̹̖̝ͅṛ̢̦ͅn̡̥̩ ̭̰̩̹̘̬̣e̪̗̰͕͔͡=̺̳̞̖̟͓͇͘=̲̯̳̳͖̜ͅ=̖̼̟̖̖̣̠ṛ̶̮̼͚̱|̩̹͎|̡̱͙̖̣̲!͙̫̺͖͚(̯̞!̱͍̯̘̯̯r|̜̗̠̼͙͔|̖̻̙̭͉1̪̺̤̳͚ͅ!̪̞͈͈͔͔͙̕==̙͙͈̥͖̙r҉̥̠̙̣.̴͈̫n͎̦͙͍ǫd̲̹͖̳e͍͓̘̝T̞͎̬̼̩̠y̥͕̲͖̮̹ͅp̱̩̤̱é̻̹̟̪͓̥͈|͔̣̦̖̣̖̰̀|̲!̖(̶̟̞͎̙n̨͓͔.͘c҉͔̩̘̩̼̩̯o̻͎͍̰n̸t͉̪̖̰̩̣͖a͔͈̯̞͠į̺̠̙̩̩͙ṉ͘s̜͘?͇̦n͖̳̲.̱͍͖̻̖͍̮c͍͔̻͓̺͎o̫̘̜̲͙͚ͅn͔̝͠t̰͓̱͠a̲̦̩̬͙̭i̡̘ņ͍̻͚͖̬s̹̥͎͜(͇̳̝̬̻͚̩r̗̖͘)̼̰̤̣:͎̀e̹̱̲̘.͍̱͎c͓o̜̗̮͈͇̙m͍̬̙̻̀p̬̗͈̦͉̼͢a͓̻̗̯̯̞r͇̦͎͎̫̠ͅe̠̯̻̝̩̙͖D̷̳͔̲̯o̭̜c̯̲̹̲͞u̺̟̯͢m̠͟e̻̖͈n̺͈tP̘͚̟ͅós͏̬i̳̻t̖͓i̲̩̘̞o̡̯̹̬̬͚̬ͅn͇̩̭̳̲̥͢&̬̺̞͠&̠̥̝̻̞͟16̖̹̝̻̺&e̖.̵̪̼̙̭͈͈̹c̲̪͕̞͟o̫̪͉m̲̙̲͠ṕ͎̗a̛̬̣̲r͠eD̯̫͎͎͉̹̫͘o̰cu̳͖̳̠̖̩͕͞m̴̙̤̫̫e̪̟͙̗̺͙̲ņt̟̥́P̜̠̯̫o̱̠̫s͏ì̘̝ţ͔io͙͇͔͡n̲͚̙͎̯(̢̖͕̤̝̬̳r҉̙̲͇̮̳)̢̺̤̲̙̟̦̗)̞͓͔̖͓͎̤)͡}̴͕̭:̩͖f̗͎̼̠͠ù͓̞̫͇͉n̻̮̬͖̣̝c̦͖t̺̞̹̝͙̕i̟͔̣̬͍̣̹o͚̪͎̲͜n̶̝̰̤ͅ(͇͓͙͔e̵̪̰̲,͏̦̦̦̟̘͖̙t̹̦͔̗̹̖͓́)̗͉̲̥̜̹̟{̰̘͈̤i̡̠̪͙f̘̹(͓̯̝͉̕t̙̮͚͎̗̠)͍̰͔̰̝̮͢ͅw̳͈̕h̴̬̤i̟̗͖͖̬ͅl̙̬͙͍͈̖̩̀e(̢̹̤ț͙̱͓̙=̭t҉̤̳ͅ.p̪̺a̫r̨̩en͏͎̰̜̙̰t̩̮̗̣̝͝N̬̤̦o̠d̜̙͔̖e̜̞̠̲͈̬̬͞)̦̱̟̭i̯̬̲̥̗͈̹f̗(̫̗̮̯͚̼t̹̳̲̜̺͕͈==̥̺̯͈̠͖=̴̫̣̮̩̝͓ͅe̮ͅ)̜͖̗r̀et̻͉͔̯̼͝u̫̙̳̬r̵̩̯͎n̼̙̞̲̞̩̺!̼̼0̻̲;̱̻̫̲͡r̞ȩ̞̪t̥u̫̩̯̯̮r̤͔͙͍͔͔͓n̡͓̫̲̱!1̫}҉͈̪̲͖͉̮͓,̶̜͓j̺̙̟͈̰̺̦=͉̹͚͎̞t̪͎͎͚̪͎̜͠?̭̻͈̯͓̀ͅf̦̩̮u͎̤̳͞n͍̙̭̬͖̰͞ͅc͏̝̣̹̺t͚͙̩͇io̩̥̠̼̝͘n̝̩(̛̟̯̫̗̲̬e̡̪̳̩̟,̞͎͢t̨)̫̠ͅ{̖͖̦̣̮͚͢i̪͉̰f̘̱̤(̸͈͕̥̗̺̠e̫͕͍͇͜=̢̟͇͍̭=̲̠͇=̬̮̥t̨͙̫)͕̯͓̘̲̗̖r͟e̯͙̳͎͉͉͖ţ̥̺̪̝̻̼ư̤͕͖͚̝̜͈ŗ̙̤̺n̺̖̗̥ ̟̤̼͔l̞̱̙̞̜̱=̖̫̯̩!̳̝̺0̸,͚͖̗̠͢0̶͎̲͚;̠͙̻͕v̻̭͞a̛̟̰ͅr̥̝̳͔̬͍̯ ̹̻̗͓͇̥̦͡n̦̩̘̯̳̕=̮̫̦̫̰!̯́é̥̰̻̥͓͉ͅ.͙͚͞c͉̦͇͕̘͇o̼͚m̲̫̯̟̼̺pa̼͎͈̝͚r͖̺̺e̵̙̠D͙o̢c̡̬ù͇̳̠̦͕͓͓m̯̦ḙ͉̟̥n̤͔͈̣̯̣t̶̳͖P̶̠͓̦os͓͇͠i̮̝̦͇̜̫̙t̵̘̟̯̮ͅi҉̭̝̥ͅoǹ̫̻̫̩͈̘ͅ-̟̱̘̠̖̦͠!̟̹͍̬͖͕̪t̡͓.̶̥̮̬͔͔̙c͇̟̲͖o̹̲̣̗̥̱͢m̢͍͔̘͕̲ͅpà̻̘̰r̶̥̹e̶D̵̩o̘̻̟̟͝c͕͚̗͕̪̠̠͢u̹m͠ḙ̯͍̳̝̭͇n͎̫t͙͇͎̳̪̗̕P̶̱̙͚͖̲̪o̘̼͉̺s̨̻̖i͖̬̕ṯ̠̪͓̜̀ͅi͚̻͓ͅo̕ͅn̥̤̮̺̳͍̕;̢͉͕̟̖̬̳ͅr͔̺͚̼e̝̞͉͓̫̙͘t̼̦͔̟̼͖͞ur̸̹̼͓̖͚̯͚n̳̠̟̮͉ ̴ņ̻͉|̫̺̙̼̫|̡̯̠̩̙(̩̳̹͙͢1̨͚&̤̦̤̕(̤̲̹̝̜͎͚n=(̙̮e̢.͙o̠͕͕w̼͇͘nḛ̖͕r͉̙͘D͖̻͖̹͇o̱̪̙̺̱c̫u̲͎̻̯͓͝m̴ȩn͠t̨̪͍̙͈̼̺|̡̬̪̝|̗e͏͉̖̭̜͎̘)̩=̩͝=͎̝̳͈̭͞(t̹̖͎̰̹͞.̯͎ͅo̙̦͓̬̯̫w̺n̩̺͉̟̞͕͞ͅẹ͔̬̣͍̼rD̡̘͈̻̯̖̱̝o̻̗͈͍͉ͅc̠̝͞u̷̗̲̞͙m͓̻ḙ̡ͅn̷̼ͅt̫͈̺͙͙͖|͖͔͎|̱̟̼͎͓͖̯̀t̘̻̜͉͎͉)̪͞ͅ?̧̮͚e̴̖̲͇.̛̘͇̻̩̦͇c͍̻͓̘̀ͅͅò͓͓̫͖m͕͈͍̞p̨̬̟̱a̸̰r͕͕͎e͔̼͢ͅD͍͉͖͈̲̳ͅò̭̜̫̥c̤̣̼̫̫u҉͈̝̖͚m̥͔é̻̱͎̙̺͖͇ṇ̢̼̳t̮̯̝͢P̢̝o̳͖s̴̯̫ͅi̷̯̯͙͇̻t͉i̛̺on̺(̷̞͍̬t̜͚̺̭̜̤̥)̴̮̣:̬̖̻̮͇1̝̭)|̳|͙̻̭͉!̥̪d̹̣̰.s̨̪̫̠̤̳͎or̢̹̞̬͎͙͓t̤͢D̙̬̣͟è̠̻ͅt҉̗a͙͝c̠͈͇̩̝h͙̠͈̪̫͖ͅẹd̠̗̝͍̞͓͈́&̪͙̖̩͙&͉̹t͖̪.̵͍͓̞̩c̪̙̗̜͈̹͞o͓̕m̸̟͉pa̱re̺̻̠̺D͖̝͓̰̪̯̼͞o͢c̤̱̭̦u̕me͈̰n͙̮͠t̫̲͉͉̼̺͇Po̵s̟͕͖͉i̯ͅt̵̮̝͎̣̰͖i̹on̷̗(̹̺̞͔̘͢e͜)̠̲̣̗̮͎͘=̖̱͠=̞̟͚̺̪̥͡=͈n?̛͙̤̩͇̲̥e̠̥̙̙͉̟̱͟=̥̻̯̩̪=C̦̭̣̲̀ͅ|̱̘͇̝̩̫|̵̫͈͉̣̺e̴̜̤̲̜̳͍͎.͝ͅo̡̥̦͓̜w҉͇̪̖̭̝̹n͕̘e̡̫̩̯ͅṟ͔̙̙͈D̸͔̜̗̺oc̖̖̬͟u̻̞̱͇͙͞ͅm͔͜ent̙̮̟̞̩̯==̭͈̗̺̱̗p̷̼̜̹͕̱&̻&̀ỳ̰͓(͈̻̼̺̪̣̣p̮̣͙̼̲͟,̛͉̘̥̳̳̱e̼͎͔)͏̱?̷̹͉̳͕-̶̙̞̟1͖̭̼͍̻̳:͍̣̝͚͉t=̺͉̱=̩͚͇C̷͇͕̺|͖͓͈͙|̲̣͓̥̝t͓̳͚.͚͖̤̜͉͓͖o̬̬͙̳w͙͢n̷͚͙ḙ̬r͕̣̫͈̰D̠̱̳͘o͓͉͖̻͙͔͈c̸̺̗͉̭̯̙̩u̯͜ḿ͓̪̥̪̗e̷͔̪̪͖̘ṋt͏̖̠=̷̜=̴̰͉̖̟p&̴̣&͎͢ỵ͔̗̙̺̤̖͝(̜͇p͍̗̘͎̞̫͉͘,̷̳t)̗̤̜?͇̮̝͓̫͓̠1̥̩̻̼͉͔:̘̻͉̟̣͉̳̀u̢̼̖͖?͎̤̝͚̗͖P͎̲̺̠(͔̖̖̩̲̲͠ú͓̳,͈̖͚ͅe̵̞̫̪̙̯̼̩)-̧͈̳̳͖̪P̞̮(̡̞̟u̫̮̯͙̮ͅ,̶̼ͅt̸̜̥)̗̗͖̺͕͇:̥̦0̺:̻̯̜͚̳̀4̬̳̱̱&̹n͈̙̩̯͡?̱̪-̕1̗͕:̙͕̮͎1͖̹̭͞)̕}҉ͅ:̨̖f̭̰̖̺͇̝́u̧͈̼̬͖͈̯͎n̷̲͍͚͕̰̻ͅc͖̻ṯ̸̩̗ͅi҉̳̼͚͉̹o̡̬̦͉͎̬̣̯n͇(̧̳͎̝͎e,̘̞t̢͈̻͓)͈̖{̲i͇͍f̬̫(̦̳̣̘̫̬͔̕e̵=̡͖̦̣̲̤͙̟=̤=̠̙͇͔̕t̬̝̳ͅ)͎r̯̻͍͓̠e͖͓t̼̳͇́u̜͜r͚̙͈n̡̖̘̥̫̱͚͕ ͡l̳͕=̙̟̰ͅ!͉̮͔0̛,̸0̼͖͇̭͉͙̕ͅ;̗̯̣͔͟ͅv̝̝͉̟̰̭a̩͍̫̕r̙͕̭͍ ̥̭͔n̼̹̻̥̗̣̦,̰̩r̼̩͝=̵̖̣͚0̠̞͜,̟̟i͓̻͕͎̠̬̱=͙̺̘̤̺͘ę̺̤̯̠.̰̣̖̙͡p̧̙̤̻͎̫a͈̱̰̬̞̻r̨͖̼̣͓e͖̮͕̺̰͙n̟̺̯͈̟͉͡t̳̲͔̤͔̱́N͚̠̞̥̫o̴͓d̞̘͘e͏,o̩̯=̷͙̗͚̹̜̱t.̫͠p͔̲̹̼̰͢ͅa͍͈͇̳̯̻ṛ̝͍̜e̶̖̞͍͇̞n̟͚̰̣͔͡t̥͟N͏͎o̻̟̘̣̞͓̬͡d̲̲̱̩͚̞ḛ̹̻͈̜̰̜,͍̤̘͙ͅa̤̘͕̤=̩͇̤͍͖̬̀[͕͚͖̯͞e̷̖̼͙̺ͅ]͓̮̜̘̙͖͇̕,͈͈s̶͚̼͔͇͓̙̯=̦̯͈̹͕͉̗[̥̬͠t̩̱̦̰̗]͇̤̺̲̻̬;̵i̞͈̜f̷͎̤(̩̹͉̗̠̥!̩i̧̱̗͕̖̻̳|͎|!̹͔́o͎̳̻͡)̫̣̩̀r̪̹ͅẹ̮̖̹̳͎́t͎̻̥̺u̶̻̠͕͓r̫̯͍͞n̺͎̦ ̻̻̤̮ẹ͈͓̖=̭͚=͓̳͉̼̘̣͔Ć̹͍̻?̧͈-͔͈̺̼̗̼̖͞1̫̬̖̯͉:̦̦̣̻̬̳͕t͖̙̙̞̬͈=̺͙͈̘̯͞ͅ=͇̘̠̟C͎̩͍̜ͅ?͚̘̻̼̹1̦͝ͅ:̤̣͖̯͔͍̀i̼̟͉̲̻͡ͅ?̞̠̪̜-͎͘1̪͠:͓̬̳o̧̟̳?̗̪̠̮̲͟1̛̝͓͍:u̻͖̘̩?̦̬P͎̥̪̫̱̥̀(̼̱͎u̱͎̥̹̹̖,e҉̟̟̤)̜͖-̫̼̠̬͟P͔̭ͅ(͈͎͇̙̱u̳͇̼͕͘ͅ,̣̣̺͘ͅt̶̩)̟̠̯:̠͙̥̜0̴̭̺;̱̼͉i̫̯̭̜͖͍f(͍͎i̟̖̹͇̥̭=̳͖̭̪̗͔̫=̱͔̫̠̙ͅ=̭̼̟̯͜o̰̯͖̬)̯͈̞̥̪r͎̰̦̳͟ȩ̜͍̞̩̞t͖̳ͅu͉̞̫̳r̛͔̫̝̲̫̱n̬͎ ̵̦̤̳̬̳͚ͅp̝̕e̴̹̰̝͇(̥̙̪̞̺̝͈e͕̞̭̟͇͈͇,̝͈̟͎̹̤͢t͇̤͓̟͡)̶;̸̹͙̗̳͔̻̩n̫̞͇͈͙̹͎=̧̳̮͍e͚;̰̀w̖h͈͍̤i͏̰͖̠̘̱͉̻l̻e̙(̹̠̜̰̘ͅn̟͕=̴̩͔n̙͕̦.͓̳͙̖̯p̮̹̦̟a̢̟̳͍͇̹̤͓ṟ̬͓en̦͖͚͖̬ṱ͔̻N̨̟͔̱o̸͖̰̳͇d̖ͅe̱̹)̴͖̩̥̬͉̪a̰̼̼̭̫.̖u̟̺͚n̖s͜h̹i̼̞̳̰̙f͇͚̝ț̛͓̰̯͈(͙̳͇̙n͙̱̬̖̼͡)̝ͅ;n̮̥͔̥̥͜≠͍̪͕̘̬̮̪t͉͇̮̣͈͎͇;̨̩͖̫̙͖̬w̵̰̘͍̯̩̤h̲͚͕͕i̗̞͉̺̩̙l̳̬e̼̥̻(̳͈̪̲̞͡n̤͈̞͙͇̟͟ͅ=̣ͅn̺̖̪̬ͅ.p̸͇̳ͅa̲̟r̮̮͈̝e̮̺̠͙̘ͅn͉̬̰̰͙̝͢tN̟o̶̗̟̦̼͖̻͙d͏e̳̗)̲̹s̹͙͙͎̕.̱͇uṉ͇͉̰͖͓̩s͓̤̦h̜̗̞͎i͙̖̜͕̝̦͞ͅf͉̜̣̺͖̯t͕̹͖(̴n)̨̰̩̘͓;̵̥̦̩͈̝ͅͅẁ̱̟͚͖͇h̶i̙͈̜l͈̲̰e̛̜̘̥̹̰(̹̲̟̹̲̪a̢̗̫̰ͅ[̡̳͎̳͈̮̗͓r͎̲̞̣͝ͅ]̹̻͖ͅ=̤̹͓̲=̤̝̘̦̝͙=̰̹͖̙̠̦s̭[̬r̼͓͙̟]͏̻̩͉̤͍)̠͢r̠̙̼̳ͅ+̦͜+͏̜͇̙͈;̯̮ṟ̬̩̖͢e̷̳͉͎̝̮͍̭ṱư̲̝̩r̵͇̞n ̙͉͍̘ṟ̲̬͎?̸̪̤̠̟p͉͈͇̣̦̠̝e̫̺͎̠̥(̸̰̠͙a̧̙[̝̗̮̀ͅr̢͈̰̥̠̞͍]̮̼̟͙,̴͎s̵͉[̶̲̼͈͈̙̩̘r̥̻̯̳͙]͉̘̘̪̰ͅ)̫͈̭:͚̠̹̙̖a̸[̨̹̮͇r͚̺͈̣͜]̵̲̞̞̬ͅ=̜̘͉̣=p͓̣͈?̱-͉1̲͉̕:̫̬͖͖s[̦r̷͎̞̱̳͚̱]͚=̘̥=̗͍̫̬̭͠ͅp͏?̱̦͇̮͝1̧͉͙̰͉͈̳:̼̫ͅ0͉̬̦̱}͡)̮̪̪̺̗͓̲,̹̝̝̪͓C̳̪}̷̱̦͖,s̲̖͎̜̟̮͔e̵̻̲͉̘̹̟̲.̧̯̰ma͔͕̝t҉͈͇ç̩̟̗̥h̪͖̲e̶̳s̟͉̜̪=̣͔̝f͖̲ṳ͙̗̘̘̻n͏͖̗͙̦̰̩c̞̼̟̻͝ti͓̬̰̜o̼̠̯̬̪͡n̢̮̥(̗͉̗̝̯͇̞e͈͉̪̟͘,̤̼͕t̜̕)̭̝̮̹͖͍ͅ{͠r̴͖̤̖̟e͍ṭ̘̱̞̻̮u͉͍͈͙̜r̤̼͎̫͕n̡̳̜͇̰ ͙̯͠s̠̘̫̖͇͘ͅe҉̥(̯͚̻e̬͖̱̝̱͖,n̻̞͇̬̳̙̳u͎͎͔̟̩̱̦l̢̹̘͇͉l,̰̻̣͢n̢u̷̫̠͚͍l̤͓͜l̙̩͎͖͍͕,̭̮̼͕t̢)̸}̦̜̮̩̲̤̀,̱ś̲̝̬͓̳̲e̥̞.͖̭̻̗m͓̞ͅa̡͓tc̳͇͓͘h̨̦̖es̛̝̝͚̩̖̳̪S̼̟̞̫̲él̛̙̹͓͇e̺͎̥̙c͞ṭ̢̪̲̰̠̘ͅo͙̼̠̝r҉̬͓̣=̜̬̪͡f̮̩͓̙̣̗ͅu͙̙̥͇̘͔nć̼͙̪̮ṭ̝̼͕̩͘i̫̪̞̲̜͞o̥̜n̢͙̦(̝e̯̦̞̝̲͎̳,̼̪̝͖̀t̡̫̗)̗͙{̖̮͟i͏̲̪f͕͇͓͓̖̪͎(̡̞̜̲T̢̠(̶̫͖̪̥̲̹̞è̯̼)̢̬̖,̟͚̩̝͘ͅd.͜m͓̖a͉͈͓͝tc̛̭̠h̷͇͖̰͉͚̫e͕̺̼̼s͈͎S̗̲ͅe̝le̫̼͔c̩̥͇̺̲͞t̵̺͉o̤̺͈r͔̟͚͕̪̣&̤̖̫̙̣̥̹̕&̷͉̝Ę̞̳̞&̟̦̤͠&̟!̢̥̠̲̥͕͉̤N͢[̞͟t̰+̲̝̠̰̣͝" ͉͎̲̘͇̺̹ ̣̝̭̥ "͇̞̼́]̩&̜̣̪̬̣͇&̪̕(̯̖̘͚̳!҉͉͔̮̼̝͎͈s̢̱̞|̺̗͎̺́|̡͇̘̮!͇͙͡s̮̤.̙̦̪͎͙̬t̰̭̫̮̲ͅe̼͖s̢t̶͖(t̵̹̗͖̳̤̝)̳͈̩)̺̠̺̻&̡&̵̮͙̭̺(̢̣͚͎ͅ!̸v͈͕͔|̰͈|̤̦͇̲͠!v҉̭͖̥̤̝̭ͅ.̪ͅt͉̗͖͓͜e̤̫͜s̸̳̠̗ͅt̴͔͚̪̱(̷̹̙t͢)̼͎̺̦̟)͈͢)͏͈̼ţ͈͚r̙͔̘̼̫̰y͝{̵v͔̝͞a̲̥̭̪̠͟r̞̹̜͠ ̱ń̬͍͎=̨c̶͕͕.̩̘͓͓͡ca̡̹̼l̶̦̫̥l͎̜̘̺̥̞(͍͞e̬͡,̱͈̥̗̯t͔̝͎̪̼͍)̬̞̙̳̳̼͞ͅ;̭̺̬͍͔̰i̪͚͎͖̬͞f̟̮̗͍̣ͅ(̨̱̹̝̻̹̞͈ņ̤||̗̬̗̖͜ͅd̙̖.͔̙͙̼d͖̩͓͚̘i̦͙̠s̘̱̗̘̜c̦̀o͏̗͓̥̦n̖̦̺͖̬ͅn̟̞̫͇͢e͉̪̘͇̖̯͝ͅct͕͙͉̝̙͠e̵̳̙̝͖d̸̳M̳̞̞̙͡a̴̲̖̞̖ͅt̝c͉̹͙͕h̥̩|̪̼|͓͖͉̖̹̳e̷̹̬.̕d̵̤̥̤̯̼̬̥o͍c̢͙̼̼̮ư̭͖̝̝̬͓̮m̬̭̣e̪͡ǹ̪̬̗̫̗̭t̬̻͚͙̝̱͙͡&̵͈&̱̼̖̩͙͉͓͜1͏̫̪1͓!̴͓=̺͓̬͖͍̟͉̀=̫̻e̹̦̱̟͇̝̥.̸d̫̮͚̗̠̫̰ơ͇̤̲̳ͅc͇̲ụ͇͙̤m̲̝͍͙̩͞e̩̦͎̻͖̠͓͠n̘̮̫͠t.͕̗̤̥̩̣͖͞no̦͎̕d̤̳e̕T̘̱̟̠̙̹̫́yṕ͕̥̹̥͔͎ę͖̘̪̤͎̥̤)r̟̟e̩͜t̩u҉̤͉̖͉̖r̷͚n ̛̹͎̲̯̲ṇ̥̻̣̗̣̩}̰ͅc̹͈̟͉̱͎͈͜a͍̱̤͓͚̯̝͢t̴c̻̳̻̜͉͚̠h̲(҉e̸̬͉̘̺̣)̰̞̯̟{͖͓͉N̞̤̫͔̜͍(͖̱̟͖t͙̣͙̭͇,̗̯̮̹!̺̩͈̰̲̼̪0͙͔̝̀)͈̗̖̤̥͔͕}̬̖͇̻̜̮͟r͎̲̱ͅe̩̟̳̪̲̰t̻̳u̺͚r͓͈͎̪n̜ͅ ̕0̲̺<̥̳̟͢s͈̞͔̰͕̟̜ḙ̩̥̤͍̕ͅ(͕͕͚͠t̥̜̲̥̙̳,͏͙̦C̖͝,̡̦͇̱n̗̟u͞l̤͚̗͍͜l͠,̞̱[̬e̩͙̗̖̮̖͍͜]̸̱̺̦̟̜͈)͘.̵̣͉̻ḻ͉̹̫̠͉en͏͇̙̯̲g̖͈͇̳ṯ̦̪͉͠h͇̕}̴̮̠̼͉̼̟̰,̩s̥͖̟͈̝̀ę̦̳͔̣̳.̣͖͜c̥͍̮̯̠̥͕o̗̪n̘ta͖̲͎̠͡i̢̤n͙̟s͕̳̠̥ͅ=̻͓̮̙͚f̙̜ͅu̩̟̟͡n̹͓̤͍͍͚̞c͚͓͈̭̬t̜ͅì̼̳ò̘n̻(͚̖͟e̮͎̳ͅ,҉t̘̥̹̗͔̳͞)̦͕̮̹̦̳̕{̙̹̙͈̀ṛ̪̳̻̩͓͠ȩ͓̯t̨̪̼̜̥̤̯u͕̹r̬̮͇̟̜̬n̬̱̦̥(̺̖̝͙̖ͅḛ.̜̟͕͟o̖̥͚̤͚̘͓͢w̞̩͎̱͎n̡̼̩͍̝̗̻e͔̖̻̬̲͙̖r̞͍̲͓̗̬̬D̢̻̺̭̫o̼ć̘̥̦̠̖̝̟u͕m͎̥̖̀e̘͉̩͚̹͖̪n͚͉̥̗̼t̯͖||͞e̮͈̝̰͕͔)̭̩!͕̝̪=̰̯̭͕̱̙̞͢C͙͢&̪̠̤͈&̜͎͉̖͖T̟̹̞̼̭̻̕ͅ(̗e̷̞)͍̗̮̜̗̩͢,҉ỳ̭̖̗̠(̦͎̟e͖̪̼̳̹̘̕,̙͎̯̼̠͘t͇)̰̲̹̙͍͈̫}̲͘,̛s̩̼̯̪e͜.̝̗̣at̲̘̠̻̻̙tr̮̟̝̼̙̦=̞̫̖̝̣f̠͢u̯͉n͇c̴͎͓̝͈̭͎͙t̖̙̗̟͡i͖o̘n̳̳̲̟̤ͅ(̗̫̤͖̥̺͍͠e͔̱̙̤̜͕ͅ,҉̪̮͕͈̩ṭ͎̣)̜̠͎̻̟̲{̝̬͔̠(̝̩̞͞ę.̩̹̹͖͚o̼̤̪̞̦͕w̼n͞e͖͓͓ṟ̲̳̳̖̩̯D̝̤̲̟͚̪̥͢o̵̝̖͔̫̤̜̗c͔̠̥u̪̹̝m̮͇̱̳͎e̶ņ͎̙͖̤͖̜t̡̲͇͈͔̺̰|̀|̧̠̩͕͍̘̫e͉)͎̰͓͔̦͉!͝=̛͉C͚&̴̣&T̳̳̘̯̙ͅ(̸̱̘e͓͓͟)͉̣̩;̨͓͇͈̳̙̮v҉̫͕ͅar͈̲̭̮ ̷͙n̨̤̖̼̯̥=͏̘̩͎̪̮b̳͓̠͢.̧̖͔͕̯͇̦̜a̟̯̙ţt͚̣̗rH̴̰̘̙à̤̬̱̖͍nd̼̜̳̪̯ͅͅl͎̖̪e̡̯͓̖̞[̱͔̗t́.̳̭̫̬͙̖͘t͍͚͓͍o̧͕͍͍L̴̬̗̳o̢̤̦͔̦̫͚w̩̼̹̹̪̮e̵̙͍͖̣̻͍r͇̙̬̞̠͈̥͠C̶̤̺̦̮a̶̻̱̼̝̹͖s̫̲͔͚̳e̤̞̙(̬͇͓͕͡)͎]̖̠̪͡,̝͇̘͈r͎̥̫̰̱͉=͎̯̤̫͙͝n͍̟&͓̻̞͟&̵̩͖̠͚̝̫D̗͎̭ͅ.͏̣͉̼̝̦ca̜̘̯̪͇̖̩l͖̬̹̪͞ͅl͉̻̱̦ͅ(̛͓̭̩͚̱b̙.ḁ̠̠̼t̻͉͉̗̱ͅt̗̫̠͍͚r͏̥Ḩa̧̮͔̺̪͍̟n̳͓̞d̮͖̱͕̰l̜̜̠̠̪̭̕e,t͔̠ͅ.͈͕̦̥̖̤͞ͅt̷o̬̻̦͜Ĺ̳̬o̲̼̥ẁ̖è̟͚̩r̤̼C̷̬͎̝a̛̰̲͎̺̞̙̞s͇̟̗̥̦e̝̜̜͉̭̪̖͜()̷͙)̬̤̠͙͞?̸͙̞̭n̻͕͔̰̦͓̖(̻e͈͚͙̤̣,̪͈̥̠̜ț̤̳̖͞,̛͚̦!̺̳̭̟̹E̳̟̰͙̜)͍͖̠͎̙͘:̝͖̪̘̰͖͞v̨o̩͕̩͕͠i̘͔̥̙̹̙ḍ̭̜͔̙̜ ̻̯̼0̟̟̟̰̲;͇̱͜r̰̙e̠̟̞͓̤͢ͅt͏̖̟u̡͈ͅr̮͍̬͔͕n̡͔̗͚̙ ̘̜͕v̜̦͕o̠̩͙͚̮id̳̭̜̖̗̻̜͘ ̬̩̫̺̗͍ͅ0̨̱̬̭̞̭!̣=͖̫̫̹͓̙=͕̱̣r̟̞̱͝?͎r̬͇͓ͅͅͅ:̨͎̼͙̝͚̩̥d.̞̣̤͎̣̺͡a҉̦̯̞̱͇t͉̦͇̩̞̞͘t͇̝͚̩̹ri̷b͚͔͇̰̙̞͔u͓̪̰t̸͖e̜͉̫͎̻s̲̱͚̠̗͖̦̀|̯͕̯̺̜̪̀ͅ|̜̳̼̮!̫̹̰E̹̹̪?̹̰è͙.̷g̸̯̲̰e͓͟t̮̜͍̟͈̜A҉̜͉t̫t̡͙͎̯̺͔̱ͅr͈͖i̳̭̖͜b̷̜̭͎̮͈u҉̲̗̻͇̣͖̙t̢̼͎̩̘͈͙̘e̖̥̯͢ͅ(͕̘t̥̦͈̖̺̤)̧̤̜̳͉̘:(̛̭̤̤r̩̮͉̭=̟͠e̶̱̭͚̫̜.͙͖̮̼̪̭g͚̮̫ͅe̴̯̰͕̲t͖̘͞At̙̗̩ͅtr҉͖̦̤̞̦̝ì̞͕̥̱͇b̛̲u̼̤͠ͅte̞͙͖N͝o̗̻̯̞͖̰̪d̝̪̱͎e͠(̨t̛)̧̲̳̻ͅ)̥̖̥͔̗͈̗&̝̠̰&̧r̙͚̲͍͞ͅ.̴̮̼̳͕̻ş̲͉̲p̨͎̮̘͓ęc̝̳̫͕̮i͜f̯͍͓̼͢i̢̼̜͉̺̰e̹̫̰̘͙d̟̫̤͇̜͟?̡r̟̰̫͎̯.̻̯v̸̘̠̬͓͙a̸̜͓̱l̙͈̳ụ͚e̡͕:͉̬̠͖nu̹͖͚͡l̠l̥̥̹̠̗̰}͉̮̺͎͉̯̕,͟s҉̤͇e̙͘.̯̗̲̬́ͅe̱̘͈̭͇̲̹͢s̤̮̤̼̪̹͘c̹̞a̙̼̜͓̤pe̶̬͍=̷̘̩͔͍ͅf̞̻̭̺̩̤́ṳ̻̝͇͟n̪̳͉̪̼͚͡c͕̹͇̬͈̘t̩͇͖̩̮̥̯i͔o̫͉͖͞n̷̝̬̯̤͎͇(͟ḛ̮͔̥͈̥͠)̞͉̹̭̺͟{̪̙̼̗͎́ͅr̤̹̳̘͠e͍̣̣ṭ̡̻̯͍͙͔̯u̷r̰͎̜̗͍n҉(͏͇͎͉̰̬ͅe̲̖+̢̥̗" ̻ "̶̲̯͇͍̝͎)̜͉̳̰̲̝͡.̣̪r̠̰͡e͉̮̺͚̣p͙̲͔̳̜̜̰͠l͔̭a̢c̴̻̗͇͇̪͓̤ḙͅ(͢r͎̲͔̘͜ȩ,̪̳̘̤͉̼ie͙͎͢)}̫̀,̯͝s҉̗̼ͅe҉̦̻̳̺ͅ.͓̪̩̻͚͕̥͝e̶̦̺̜r̻͉̹̜̝̞̀r͖̖͝o͈r͍̭̲̖̣̹͡ͅ=͕̤̭̣͟fu̵̯͎̲͈̺n̥͎̳͘c͓̤̮͔̜t̪̞̞̻̟͞i̹͈̬͠o͍n̻̠̝̫(̵̲͙̞̳̞̞e̻̹͎̟͜)͉̻̭̕ͅ{̮̬t̲̣h̰̣̩̟̲͠ͅŕ͕̫̰͔ǫw̸̫̗̫͈̖ ҉̲̦̲̬̞n̻͎͉̖̝͖͉̕è͍͓w̯̠ ̼̟͓̯͉͙E̵̤r̩̺r͔̹̲̺̺ͅo҉̳͔̠̗͎̝r͢(͙̼̝̩͘" ̷͙͖͚̤S̥̹̫̩͟ͅy͜n̬͉̙̟͡ta̯̪̘x̧̻ ̫̲̠̗͙e͈̲̤͉r̸͔r͢o҉̟̳̗͙r̨͎, ̛̪̗̭̮͓u̦͚̠͠ṉ̟͕͓r̠̞͕̦̝̭e͠c͏̥o͝g̫͎̖̰͔n͖̝͚̺͍̖͢i̶͎͚z͡e̲̺͖͚̲͓ͅd̷̯̬͈͎̹̹̯ ̳͔͍͕̲̀ͅe͇̝̳̲͘x̬͙̻̺͚̜p̞̱̞̗͙͡r̬̣̙̺̞͖̱e̬̻̪s̫̗ͅs҉͎͔i҉̳͕͉o̢̤̩͔̲n̶̫̝͔̮̞̞: ̨̣̳̬̩͔̲ͅ ̛̪ "̮̦̦̯̭͡ͅ+̖̞̖̗̦̹e̢̻)̭͉́}͚̻̤̻̲̙͘,͍̳̮̱͠s͔̬̙͞e̪̟̺ͅ.̗͈̦̗̯̮ưn̦͜i͙̝q͍͓̱̗ue̱͕̘͓͔͚̺͘S̶o̵̲͉͎̪ͅr҉̻̻̳t̻̕ͅ=f̙͇͉̻̮̲͞u̘̬̠̰̫͖ṇ̷͙̝͖ͅͅc̰̳̗̙̻͔͠t̩̗̖i̤̬̯̟͎̺͔o̪̳̗̬͈̗n̰͚͍̻̜ͅ(̸̻̥̹ȩ̘̝̘̦̗̞̹)̺̲{̠͙͈̥v͏̮̙a̰̰̼͖̥̤ͅr͍̪̱ t̝̟͠,̸̼̟̫̝̖̣̩n̢͉͔̬͖̰͙=͙̟̥̖̪̣[͓̩̖̟̻́]͉,̢r̛=̰0͇̕,i̱̙̳̣̪̪=0̸̮̺ͅ;̵̹̹̻i̝̮̩͠f͏̲̥̯̬̞(͎̞̤̤̙l͘=!̠̯̯̠͢d̳̳.̨͇̣̱̮̜͕d̖́ḙ̙̼͕t̡̹e̷c͙͉̬͢t̥͘D̞͉ụ͕̣̀p͇̠̩̝͜l̲͍̖i̺͍̲̲̼͚c̥a̴̠̱̜͎͎t͈̲̳̬̠̦e̘s̸̱̻͓͔̩,̙̹͕͍̣̭u̝͚͔=̱͖!̮̯̭̹̭̖͉ḓ̥̱͘.͈ͅs̞̮̗͖̦͞o̶̹͉̜ͅr͈̙͔̲̦͞tS̢͎̳̞̞̝̥t͚͓̘͜à͓͓͎̼͖b̸͖̩̭̫̟̪l̼͈͚͇ͅe̷͈̪̘̲̤&̬̩͕͈̝̖͉&e̞̻̗̘̣.̵̮͕̠̫̤̩s̢̻̝l̨̼̼̼̣ì̥̯̗̩ce̶̬̜͔͖̻ͅ(̠̙0̨͈̭̫̠)̷,ȩ͇͕͓̲.̗̘͙̻̙̫͡s̹͙̲̙̖͚͍͘o͏̩̜̼̳͚r̪̜̭͕̙ͅt͇̪̳̤͠(͉̀j̠̜)͠,̪͢l)̞̯́{w͖h҉͔̯͔i͎͖͍l͉̗͙͉̲̻e(̴t͎͎̮̯̫̼͙=͎͕̱̣̝̟ẹ͈̕[̖͙̬̪͉̕i͇+҉̦͇̘̣+̢̻]̠̥͉̝̬͠ͅ)̬̘͍̖̜̠͠t̛͍=̖̯̝͕̬̯=̩=̼͇͙e҉̖͉͙̟̘̫ͅ[̥̦̰̬̻ͅi͈̝̪̠]͇̤̗&̨̖͔&̻̦̦̭̥(̛̭̝̻̗r̡̯̣̯͔=̶̞͎̹̤̩̣n̴͓̺͎̹̜.̺̱͓͖͈̘̦p̣̖̬̫u̫͚͇͡s̲̦̣͕͞h̬̪̝(i̴̹)̬̕)͇͖̠̞̥̥͠ͅ;̨͍͇̼̼w̶͎̹̳͙̗̮̯h̨̝̞i͖̬̤̳͕le̵̯̖̤̺͚(͙̥̠̤̯͎͝ŗ̯̩̩͍̺-̧-̞͉͕)̮̙͠e͉̺͖̪̬̳.̳͔̖̟ş̤̤p̥̲̮̗̦͚̼l̸̗̼̩i͏̣̳͕̬̳͇͚ce͔͖͚̹(҉̩͙n̦̳͉̬̘[̣r]̴,̤͓̱̠̠̮͕1͇̩͚̘)̩̭̜͍̮}̴̬r͇̕e̹̦̬̫t̜u̠r͉͖̯̭̗ͅn͓̥͍̪̭͢ ̳̗͖͠u̺̦̲͍̺ͅ=͕̭̹̻̥n͎͉ú̪̖̯̤̱̝͚l͏̯͙l̴̘,̠͕̥͇͈̭͡e̝̜͍͔̭͙͍͠}̫̼͙̗͓̺,̙̣́o̹͓͔̜̲̮=͏̠s͚̣e͎̲͕͘.͚̭͇͡g̣͙̘͎͎͚e̢̘tͅT͕̪͕̺͕͚e̺̖x̻̟̻ṭ̥̣̕ͅ=̲f͈̘̟̩̣̝͍͜ṵ̡̞͙̦̟n̷͚͎̰c̝͡t͞ị̣̬̦̥̯ͅo̖̟͓͞n͈̺̪(̝͎̠̪̣ͅe͈̙̳̯͕̯͘)̴̻̺̰{̨͍͎͓̖ͅv͠a̙̰r ̧t̖͚̮͎̥͢ͅ,ń̤̮̯͍̖=" "̬̣̜̖̻ͅͅ,̦̳͉͍̹̭r̙͖̦͉͍͔=̢0̴̝̳͕̦̜,̡̘̖̱̺͉̩ḭ̛̥=͈e͚̳̳.̵̲̝̗no̵͉̫̪̩͇d̗͖̫e̹͍̮̥̗Ţ͉̘y̲pe͉̩;̴̲̰̪͓̪͇if̹͍̟͙͍̼͘(̜̟̟̗ͅí̘͚̖͕)̪̲̥̯͔̯͟{̧͉̺i͕̕f̼̗͠(̜̭1̵̣͇͉̩͖=̱̺̩̗̗̜͠=̷͇̱ͅ=i͏̮̥|̨͉̣̹͕̞̻͉|̰̗͙̺̲̰ͅ9̪̹̘̩͞=̱̲=̷̟͎̤̻͔̼̫=̣̠̹̤i̱̠|̶̜͓͖̭|̪͕̳̕1͉̟̝̖͠1̯=͇̭ͅ=̛=̶̪̲i̶̥̞)͠{̬̘͔̳͉͖͟i̟̰̘̤̜̯͇f̣͉̜̹̮̯̭͜(̩͇̝̭̼̥" ̗̩̻͚̱͔̳s̡͓̼̩͈t͔͓̮̰̦͔͈r̤i̸̪̺͙̪̘̫̰n͙̱̠̖̩g̛̜͈̪̣̬ "̡̼̖̞̺̯̮̳=̘͖͕̝̻͘=̰̀t̴͉y̱̫̻̩͇̦p̺͚̙̦͘e͠o̫̗̣̠̰̳f̹͉̭ ̫̦̭e̜̼͓̗.̟̩̤͚̬͎͝t͎̯̮͔̳e͚̫̰̰͖x̨̙̝͈̱̣̫t̰̗̮͕̥̱͙C̢͉o̖ͅͅn̦͕ṯ̜̬̥̹̣͖͜è̱͉̰̙͈̤n͙̱t̻̻̗)͏̱̗̤̠r͚̻͇e̥̥̦͡t̠̫͇̱͔u̸̯̹̱̫r̙̳̮͚̬̺̪ń ̖̘̦̗͈͉e̳̫͝.̷̳̘͙̗t͇̫̘̘̲͉e̸̫̞̗͉͕x̵t͢C̰̹̤̬o̡̞̗̳͔n̖͎̼̼̝̲ͅt͝e͕͞n̮̟͢t̤̹͔̠̯͕̗͠;̭͚͚͖͈̖̻͟f͈̹̘̙̝̮͟o̖͙r̪̕(̗̼̦ͅe͜=̗e̳̦̫̙͇̪.͓͈̺̗͚f̰͎̱i͏̦̼̥̲r̭̭͇̀ͅs͏̦̗̤̫̳t̜̯̺͍͓̯͔̕C̷h͈̞͚̖̖͉̫il̦̭̭̖̭̼͍d̖̳͕̬͙̮̕;̟̭͖͕͉̩͕e̳̣͖͍ͅ;̖̤͇̣͚e=͘e̞͕̹͜.̝n̪͇̤̣̰̮e̢̞̰͉͙̜x̶͚̗͉t͈̖̗͙S͖̭̰̺i͔͚̥̠͓͖̻͡b̞̩̤̯̙li͓̣̙̙ņ̞̜̥̤̠g̜̰̣̪̲͙)͚̼̝̥̣͝n̳̤͜+̘̬̖̮͎̰ͅ=͏̗o͕̙̦̟̟͚(̸̺͓̠é̮͖̦)̙̕}͙͟ḙ͉l͇ș̼͕e͟ ̪̯̤̱͎̥i̲̜f̬̬͝(̺̘ͅ3̩̀=̗̲͔͇͈͖̙=͓̱̲̻̲̦=̜͕i̬̠͞|̙|҉̘̗̥͇̥͕4̩͟=͏̗̳̞=̞=i̗̗̥̜̗)͜r͎̬̝̘̩͍e͓t̲̥̭͚̣͍ͅu̵̟͕͈r̤̰͓͙̝͉ͅn͙̱̦̭͎ ̜̘̝̭̬̥̫e̹͠.̘̣͇̭̞n̴̗̥͇̟͎̯o͚̱̯̠͙̺d́e̯̺̫̗̟̣V͠a͖̞̲̩l̠̞̟̩͇̮̬u҉̙͚̫͙e͕̼}͔͓̥̹̳͙͢ę̜͚̝͔l̝̖s̬̻̖̱̞̤e͕͇ ̹̭w̟̰̬h̳͈̝̀i̢̞͔̺l̜̹ͅe̛̦̪̲̟̞͖̮(҉͙͕t̫͎̺=̞͍͠e̱̟͟[̵͉͖̙͈͎r̢+̫+̹̪͍͢]̲)̱͙̻̻n̴̜+̯̜̯=̻̰̬̠͔͡o̴̫̺̙̹͍͖(͓͓̱̳̲̗̀t)̯̝̻̗;̰̟͍̹͉̼r̗̗̱e̵̙t̙̤̠u̶͖͙r̭̺̫͜n̡̝̯̘͇̭̲ ̸͙͔̤͕̮̳n̢̥}̧,̺̟́(̱b̬̯=̶͈͓̻̟̱s̫e̶͚̹.͚͉̣̫͍ș͚̺̣̼͉͠ͅél͉͓̱͞e̼̳̠̭̖c͉̩̭t͘o̭̦͝r͖͝s͝=̘̳̻̗{͓̝̤̟̘̞͇͟c̸̗̙̙a̡͓̼̟̣͙̤c͜h̼ḙ͜L͍̪̗͍e͖͖͍̦̖͜ͅͅņ͓͓̝̭g͖̟̼͍̥t̢̘̥̘̹ͅh̜͎̭͖̳:͏̟͇̘͉̱5҉0̗̼ͅ,̙̥͇̗̖̠c̲r̜̲͕̞̪ͅè̯̦̫̪̘̲a҉̜̣̬̖t̢͖͉̘̗e̳͚̯͚P͓̩̟̼ș͕̺̗̜ͅe͙̱u̸̜̱d̳o̢̺͚̥̬̥̥ͅ:̖̬̗̳l̩̠͎͢e͚̘̱̻̗,͈̲m̶̼͎̬̦͈̜̫a̪̯̙̻͙͓tc͈̩̲̦͕ͅh̟͈̹̮̙͔͖̕:̸̬͎̼G͚͈̦,̵̤̙a͖̰̞̖t̢̜̥̪̦͕̺t̳̹̱̹͈̱r̴͓͓̩̰̱̝͕H̫̗̹̕a̩̱̲̩̘̪̼n̺̘̣̩͖̣ͅḓ͙̯͎l̷̩̼̗e̘̞̥͚:̘̦̥͈̠{̙͍̗̯̟̖̟}̛̹̠̮̪͚͍,̭̭͉̜f͏͔i̙̗͎̱͚̙͍͡n̞̜͓̫̼d̝̖̗̝͔:{͝}̳͝,͖r̥̤̦̖̥̭̜e̗̞̻̯̤l̶̳̗̟͖̗̦a̸̱̳̭̮̩͎t͉͘i̙̪̬̰v̖̖̝̰̭͘e͚̦͙̺͔̘̟:̨͍̟̜̬̖̰{̟͔̦" ̭̰̘̜͖͡ > ̞̝̹͈̬̼ "̴̳̥̗̺̼͇:{̯͚͙̰̫̙̖d̡͍͕̱̬̭ͅͅi͏̠͖r̹̪:̴̘͍̮̗͈͓" ̝̗̳̺͞p̜͝a̡̪͍̟̘̣r̵̜̭̗̙e̱̱͢ͅn̫͖t̜͇̲̤̠N͓͉̮̼̙̩̕ơ̝̻d̩e̻̼̼̞̳͈͢ "͙̜͍,͜fi̗͕r̪͔̺̥̣s͟t͎̯̺̣:҉̱̖!̦̜̼0̥̗̖͕̺͈}͖͚̠̘̬,̼͕̟͉͓͕" ̙ ҉̬̣̞̤͉ "̴̹̟̟̟̹̭̣:̘̦͍̗̦͔̩{͇d̞̪͕̘̼̝ͅi̫͚͙̲̘̮͈͟r̰:͟" ̝̫̦̘̺͕͠ͅp͇ͅar̮è̗ṉ̣͓t҉̞̰̤͇̰͖N̪̬̥͜o͉̹̺d͓̼e "̢}͝,҉̱̯̩̦̯̫ͅ" ̛͙̪̖̣̩͖ + ̢̯͈ "̱̀:̲̬̝̳{̪͖͠d̞̜̪̭̟̗͉͘ị̴̰̱̮̝̫̘r̞:͏" ̞͙̥̺p̬̬̠͇̣͇̹r̙͓̰̣͓̗̼͜e̸͙̟̱v̰̬͈̜̹̠̱i̶̭̣̹͇̘o̼̱u͇̺̠̞͓̟̬s̫̟̘Ś̲͉͉i͈͞ͅbl͍̩̜̺̙͇̯͠i̳̭͖͔̙͍̦͞n͇̪̫͖g̴̙̬͈͕̫̳ "̴,̗̖̫̲f͞i̡ṟ̢̼͎̦̗̘st̬̯͞:̮͜!̸͔̞0̱̠̟͚͙̘̕}̗̥̤̩̰̙,̸̣̗̮" ̦̮̰͜~̗̣̰̮̗̕ "̯͔̯̜̗:̺̗͉͍͔{̜ḏ̨̼̺͖̪ͅi̭r̗̬̙̫̖̗̹:͉͇̜͙̗̝͡" ̱̣͖̥͚̝͈p̛r͙͍͍̠̭̟̼̀e̘̳̥͞v̷̖͓̯̖̩i͎̮̞o̪̰̱u̱̦͚̘s̵͚̼̼̮͉̲S̟̮͈̩̦͍͜ͅi̭͡b͍͍̺̭l͕͚̭̣͉i̢̩ṇ̦̘͜g͏̥̭̗̝̮͍ "̦͟}̞̱̟͓̤̞̤̕}͏̼̼͇,̤̲̩̟͔͚͈p̘̖͙r̸̙̻e̻͚͚͖͖F̭i̷̻̰̖̗̪̘̻l̝̺͉͞t̷̙̞̟̼̳e̺̤̖̙̠r̛̙͔̟ͅͅ:͠{̸̜͖A̜̠̪͟T͔̙̕T̶͔̟̹̯͎͙R͚̼:̴̞̜̱̲͇͎f̸ụ̬͈̻̠n̗̞̖͙̰ͅc͓̘̠t̥̥̗̘i̱o̳͎̩n͝(e͇)̢̭̺͔̱ͅ{̬̙̩͜r̢͍e̲͓̳̞̬͍̫t̨̖͙u̳͙̲̝̣̕r̭̮̣̱̳̯̮͘n͙̤̤̱̯ ̻̣͇͉̬ͅé̘̫̥[͍̖͚͈̖1̣̳̭̻̬̭̥]=̱̙̜͚̖͖͉͠e̮[͍͜1̯̞̹͚̱͝]̫̼̬̤̯̕.͕̬̺̱̤̣̦r̖ẹ͓͇͉̦pl͔̮̫̪̻̦a͟c̜̳̖͈̳̼̘͡e̺̙͔͘(͔̖̣͘t͇̻̬͓͔è͍͕̙̭̩̫,̝̮͍n̳͓͝e̩͠)̬,̜͓e҉̱̲͔͓ͅ[3͏̹̳]͚̗̯͍̭=̦̗͈̗̗(̶͈e̵̪̲̱[͏̦3͎̤̮̩͈̦]̸̙|̗͉̪̖|͍̞̥͔̝̲e̪͕̙̟̭̖̪̕[̵͎̝4҉͖̜̩]̹͉̞̜̣͠|̱͖̱̕ͅ|͍̞̹̠̳̤͝e̮[5͏]͔̯̬̝̺̬̣|̱̦͓́|" ̫̬̩ͅͅ "̨̺̥̩͎̪).̱̱̲͓ͅr͓͚̻̻͕̀e̙̬͇̮̥̗ͅp͈̩̠̺͇ḽ̷͕̱a̴̻̲̟͎͓̞̭c͔̯̼̲̀e̞͜(͇̰̜̝ṱ͖̞͕̲͎ͅe̤̠͙͙̜̰,̀n̮͉̥̠͇͚ẹ̱͕͔̻)̯͚,̟̱̟̦" ̗̹͚̘̱̲~̸ = ̺̮̙̜̮͘ "̝̼̼̠̦̻̬͠==̷̲̺̗̱=͎̲̫ę̲̗̱̥̺͍̭[̰̻͎͇2̥̗̻̮͙͕̙́]̺̱͇&̻̞̯̙̻&(̗̮e̶[̨͍̤̮͖̘̯3̥̻̳͓̺̥]̯͕̕=͍͇̟̫̭" ̼̭̹̪̣̝̗ ̭͎͕̹̭̼̺ "̘͙͡+̩e͙͔ͅ[̢̦3͖̱̹͈̣̮̥]̗͓̘̮̟̜̜+͙͓" ̘̼̜͕̱͚ ҉̟̤͎̰ͅ "͖̦̣̙̟͟)҉͍̤̟̤͈̺,̦͖e̬̗̖͓͇͉̤.̰̤̝s͔̤l̪̘̦͎i̻̝̥̤͔͓c̕e̯͔̯͔ͅ(̤0̷͉̮͕̼͉,͙͕̥̱̹4̞̱̭̺)͍͈}҉̙̪̰̱,͏͉͔͖̯̻̞̰C͙̥̯͔H́I̩̪̯̙͉͎L̝͎D͙͖̹͍͍̺:͍͈͍͕f͎̞̲͖͔͖u̧̯̝͙ͅn̮̺͍c͍͎̰͟t̵͇̼̠̰i̪̠̜̟o̩̥̰̩̙̜͢n͉̥̘͟(e̢͓̻̦̲)̲{͉̬͖̫̬r̡̩͚̭̘e̗t͕̞u̯̠̲̩̼̳r̜͡n͖͕͚ ̭̘̜̥̳͜e̞̟̫̬̗͞[̘̪1̮̝̞̹̣]̮͍͉͙̳͍͇=̧̖̰̞̗̤e̯̕ͅ[̪̼̪͉͇̤1̫͇̖̝͇̰̣]̝̜̪͈͠.̙̝̺̝͙t҉o̸͚̮̺̝͍ͅL̺͍̪͈͍͜ó̮͈̳̖͔͖͍w̷̼̳ẹ̶̪̟̬̭̘̱rC͚͎̟̣͕͖a̤͓ś͎̣̘͚̫̝̩ȩ̖̣(̶̩̜̪̬͉̱̭)͓̤̺̰͇̠,̹͔͙͈ͅ" ̸̱nt̛̘h "͔=̗̹͎̦̜̺̭=̻̖̠͍͕̟͚≠e̗[͉̺̠͚1͇̩̺̙̪͈]̤̹̙̥.̫s͕͔̗̖̠͘l̹͘i͇̦̫̺̥͖c̭e(̱̥͖̼0̦͎͉̭͍͓̤,̧̗͖̟͎̖3͔̺͔͜)̹?̸̣̫̺̲͈͔̻(̤̲͈͙̳̠͕e̢̱̱͎̹̬̲[̗̻̰̯͠3̵͙̲̞͇]̤̙̟̬|̡|̹̙̻͍͎͓s͓̟͈͟é̞̣.̟̻̘̥͓̟̰e̢͙̝̰͖̻̣r͇̠r̛̝͔̮o͖̞͔̩̩̲r̩(̵͔͓ę͍̙[̨0͇͟]̣͉̰̯͈̲)̗̯̀,̙̤͝ͅe̝̳̘͜[4͙̟͠]̦̝̬̗=̱̞͇̗͟+(̺́e͈̙̻͓̘̘̣[4̖̳̘̪]̸̯͙͓̝̘̺̦?͈̳͙e͙[̬͔͡5̞̞̩͔͈]͚̺͉͎+̲̮͉(͔̩̠̳ȩ̘̟̖̰͎̖[̰̖̰͝6]̗͇͝|҉̞̜̳͔|͎͚̙͓͈ͅ1͉̺̻)͉̥̲̖:͓̟͖͔̖̮͕2̳̹͙̱̫*̸̥͚(̜̗̯̩͖" ͍͔e͖̹͓̟̰͔v̴̠͔̦͎͖̱e̱̬̳͕̹̪ͅn̳̪ "̨̗̻͙͎͈̩͎=̯̮̫̗̗=͍̥̝͓̫̗͎=̠e̢͓̰[̠͡3͙͇̫]̛̭̘̖̦͙|̨̟̲|̛͈̪̲͖̺̰̱" ̸̮̝ͅo̬̥d̙̩̬̬̘̗ͅd̯͢ "͚̺̘̙̘̟͢=̤͕̰͚=̘͔̳͖̺̝̝=̷͓̰e̶[͇̮͓͍3͚̘̦̺̩])͚)̦͈̗̥̘̫̺,̱̗͉͠ḛ[̠̠̮̼5̱̱]͙̝͉͠=̠̟̗̙̯͡+̰̫̥͕(͍̰̳͙̤e͏̫[̳̟͔ͅ7̰̳̹̝͝]̜͈̱͖+̭͈̭̦͕e͍̺̖̲͡ͅ[̶͙̦͍8̛̞̱̞̳̦̳]̥̞̼̹̰|͏̬̮̞̙͕͕͉|̟̦̹" o͖̙̠͎̥͓d̠̖̭̥̻͉̳d̲̳ "͖͟=̪̥͉͚̟̬=̘͎̲̹͈͓=͙͈̬̦͜ẹ̺̮͠[͏̘̠̼̫ͅ3̸͓͈̱]̵̺̳)҉̣̼̤͓̯)̵͙̗͉̘̝͎:̧e[̲̥̙͟3҉͔̘̱͚̦]̩͔̹̻͔͎͕&̵̜̻̙̥&̰̥s̢̝̯͈̝̭̼̥e̗̦̫.̲͉͎̥̳͢e̖̩̗͎̠ͅͅr̶r̰ọr͍̘̗̱̱(͔̜͔̪̻͓̻e͉̯̻̺͠[̜̲̭͕ͅ0͏̹͈͎̻̮]̯̟̼͔̮͇́)̠͙̰,̷̤̞e͓̯̟͕̼̳͡}͔̬̲̙͈̦̩͢,P̠̹͍͔̩͖S̴̖͖̘̞É͓͚̲̫U̻͇̬̱͔D̥̪̬O̤̯͉͖̫͈̫:̝f̦̫̺͉͇ṳ͖̲n̫͚̠c҉͈̙ṯi̼̫͍̖̻o͍̤̻̲͎̞͙͢n̦̩̜̞͚(̸̮͈̪͈̟̗̩e̼̟̙̙͈)̣̼̣̭̮̬͔͡{̧͈̤v͉̱̝ͅa̝r̸̥̪ ̪t͓͖̯̯̬,̷̳̳n̶̩̭͔̘=̵̣̙̳̗͇̼!̶̣̼̦̭̻͉̬e̸̮̭͔͕͕͕͕[̡̖̳̩͖̬6]̫̟̟ͅ&̛̭̮̼̤&҉̣̺̺̜͔ͅe̡͙͕̜̯[2͉̤͜]̖͔̀;̠̰̼͔ͅr̶̮̠͖è̠̗̯̞̬t̢u҉̜̙r͖͇̱̼̬͞n̥̥̯̜͜ ̘̰̘̫̮G͍͕̩̩͡.̴̹C̠̟H̦͢I͕̖̪̗L͕̘͖̭̝̱Ḓ̛͍͙̼̝.̖͜te̛̻͎̫s͏̖̹t̞(̯̖̤̦̕e̴[̞̖̯͕̼̕ͅ0̖̼̮̼̹]̩͎́)̱͙͕̞̙̪̫?͓̰̹̮̤͎̬n͈̼̬̤͖͇̪u̬̪͙̣͖̝l͓̣̥̪̝̰̪l͏̞̖:̪͖(̦̭͕é͉͉[͕̲̟͚̫3̝̦̺̬͙̖̲͞]͇̥?̵̟̝̺e͏͕͖̥͉̩̙̩[2͚͝]̕=͙e[̥̙4̥͔͇]̛͉͕͖ͅ|̩͍|̧e̸͖̼̮͎̬[̙̞̪̝̫̣̼5̢̤̫͕̼͚͕]͉̖͍̦͕͠|̝|̴̼̱ͅ" ͓̠͈́ "̴̩͕̹͈͇͚̲:̝̭̠͔̖n̵̜̠͓͙&̜̪̝̙̮͜&̛̬X̷̟̥̣.̺̖̤̫͕ṯ̤̀ḛ͍̼̠̯͓̭s̝̤͖͎̤̦͞t͍̻͢(̤ṉ̝͍͉̭͙͙̀)̷͔&́&͇͖͙̫͕̜͜(̺̼͓͚͙t̖̳̰̪̳̣̻͝≠h̬̣̕(̬̰̮͓̘̮ͅn͚̱͙̹͎ͅ,͓͙̠̺̘̭!0̡̯͓̲̤̺)̠̱̰̟)̞͚͠&̢͖̮̝̘͖͖̠&̞̹͡(͖͍͉͟t͈̗͍̣͚=̮̰̹̼̩͓͟n̟͓̼.̱̱̗̥̣͓̩͠in͕d̜e͙̲͇xO͠f̲̺̹̖͇͖(҉" ̰͖̯̯̰̼̘̕)̡͖̫ "̬,̧ṋ̤͞.̦̖̞͍́ͅl͍̜̟̗͍̠ę̝̩̰͈̦̦̭n̶̟̣̝̯̺gt͈̰͙̖͙h͘-͍̥̮͎̦̗̪ţ̼)̡̭-̻͍͓͉̹̮̖n҉̥̫͇.҉ĺe̡n̩̭̩̭̖͍̰̕g̲͙̟͚͇ͅṭ̗̗h̵̜͖͈̺̲)̲͙̞̀&̭̲͍͙̫̲̯&̲̘̳̟͙̤̺(͉͉͙̺̼̪e̥͇̠[̪̰̤̖0̷̝͍͚̰̞̙͔]̖̝̳=̖̟͎͍͟e̬͜[̪̱̭̘̣͖0͈̤̟̟͉̰̻]̲͖͕.̕s̜̻͎͙̖l̰͈̦͖̬i̦̞͍c̞̱̱͙̩ͅḛ(̫̰0̩͉,̢͈̤̠͔̤t̸̗̹)̲̮̩̜͡,̭̜͙͕̳̬̞è̗͉̦͈͙ͅ[̩̰̹̣̺͉ͅ2̧]̯͉̮=̧n̞̖̣̬͕̪͙.͓ͅș̷l͓̫̘̖̗̼i̙͈͢c̲e҉̹͚̩͉̙(̢0͈̩̜̗͙̞,̞̝t̵͕̳)̫͖̜̼)̺͓̝͖̀ͅ,e.̡͉̬s̙̺̜̼l̴̙̘i̴̭̜̲̹̗̳c͇e̤͟(̼͓0̜,̴̞̞̥̫̖̫̝3̸̝̫͕̟̫̥͇)͟)̶̗͕}̛}̧̲̘̫͕͈,͏f̘i҉̳ͅl̮̺͎͔̦̝͇t̩̟̕e͙̪̞̺͢r:̢͇̙̙ͅ{̴̪̯T̛͎A͔̗̱̹͈͉G̩̼:̣̥̣͚̳͘f̱̥̫͈u̩̩̫̮͍n̛̗̳̗̦͓̤c͉̼͚̰ţi̞͈͓̻͟on̡̠(̱̘̤̞e̴͔͈̰̤̫͓)̭̳͍̠̩͢{͕̦̣͍̦̹v̴̲ḁ̮̩r̫̙͘ ͇̠̯̱̭͝t͏͉=͚ȩ̳͕͍̼̯.͔̭̫͚ŕ͙̙̞̝͚͓̹e̯͞p͏̼̯͓l͏̫̯̮̗a̡͙c̤͖e̶̼̺̝͍̪̘̝(̨̝͈͍te̹̱,̬n̼̲̯͉̦͉̱e̡̻͕̗)̳.̧̮to̡̖̺̭̮̯̲̲Ĺ̹͍ͅo̶̭w̱̲̖̯ḛ̹̲͚̩ͅͅr̻C̘ḁ̯͍̘ͅs͇̩͈e̼̩̥̗͔̯͖͢(̩̪)̹̱͓̖̥͖̻;͏̱̥̠̘̳r͕͉͓e͔̮̲̮͎̣̗t̗̹͘u̸͙̮ͅr̗̞̦n̷͖͍̻" ̥̮̳ * ̦͎̩́ "͍̩=͔̕=͖̮͔̼̫=̦e͚̗͕̣̯?̦̺͡fu̢̬̯͉̦n̛͕̠̰̬̖̠c͔̼̻̫t̼̥i̥̟̭̲͉͓o̜̰̲n̢͕͎̱̫(͈̺̻̦̫͢)̫̖̲̟̥̻͘{͈̤͜r̺̭̝e҉̰̭tu͉̝͈̩̟͜rn̘̩̯͕!̠͝0҉̭̱}̘̣̝̖͇̺͟:̙f͎͔̖u̳̝̯̥n̺͈c̤̣̺t̰i̺̗̳̻͖̜̕o̳̘̳͕n͉͓̗̺̱͙͡(̜͔͜e͈̳̹̠ͅ)͚̤̘{͙͍̖͈̣̲͔r͓̰̬̻e̡̫̯t̳̟̩ṵ̵̱̮̞͕͖ŗn̙̬̩ ̣̻̗̗e͇̖.͙̯̠n͕o̺̦̯̬͚ḑ̻͎e̙̫͎̥N̳̖a͙͓͈m̠̭̝̯̖͇e͙͖̺̭̪̠&͔̯̘͈̹͡&̩̥͓̲͕͈̙e̲̣̻̳͈̲͈.̭̪̪̮̟̲͚n̶̟͇̖͔̹o͔͎̙̣̬͎d̘̰̱e̷̝̮̥͓̤N҉a̸̠̤m͘ͅe͠.͚̞ţ̻̺̼̮̤oL̷͓̺̣̹̳̻͓o̷͍̯̹̖̠͓͎we̳r͎̝͖̱C̪̀a̢̦̳̝s͈̥͉̬͈e͙(͝)̴̼̞̫͇̻̰=͉͇͎=̫=̭̀t̠̣̼͍̦̲}̷͓͍͕}̣̮̦̭,̩̲̦͠C̰͍̝̗͎LA̼͎̭͔̫͎ͅS̴̤͈̣̝̪S̲͔̺͞:̠̯̺̤͔͖fu̹n͔͇c͜t̤̯̞i̘͇o̖̫̳͝n̥̪͖̳̦(̘̯͘e̷)̻̙̼͇{̧v̩͕͚a͉̜̻̤͞r̙̹̘̬ ̮̫̠t̨=̶͚̻͖͖̼̬m͇͍͚̦͝ͅ[̬̳̩̰͙̫e̘̼̠̗̻̙+̲̼̜͇͟ͅ" ̴̖̝̗̥̮ ͎̳̻͈͕͇̭ "̖̬]͏̙͉;r̩̦ͅè̝̮̬͈͔͖̪ṱ̸̥͖̹͈u͕r̬͈̰͚̩̩̫n̹̲̗͈͙͈̺ ͇̘͍̰͙̭t̷̤̺|̻̝̤̟̻|͎͠(̶ṱ͓̬̭́=̡͎̰͍̳̰̖ne̫̤͈̦ͅw̤̤͈̟̤ ̱R͚e͉̥̮̪͓̮͠g͏̖̙E̢̼̣̞͖̳͉͉x̠̰̥͠p̬̰̳̥̰̻͉(̱͇̠̞͖͇͕" ҉(͖ ^ ̹̦̤́ | ̯̦͇̮͍̖͞ "͔̻͇͖̻̭̕+̞̦̻̠̻͙̭M̱̠͕+̱̹͠" ̳͖̘̻͓̦)̣̻́ "̭͖͟+̠͓͇̕e͉̟͓̙͕̰̻+̧̼͍͈̙̮̺"(̸̲ "͙̣̙̙̻+̡̯̳̗͎͉M̼̺̦̗̖+̬́" ̥͙̪͙̪̞̮͞ | ̥̬$)̻͓͞ "͏)̸̤̞̥̙ͅ)̕&̘͔̞̪̼̀&̩͔̣̫͓̞̟̀m̝̣̰̺(̘͈̯e̲̱̤͇̩̪,͎̱̝̘̗f͚̤̙̼̬̰͠u̦̳̜̰n̥͉̱ͅc̱̞̮̹̖̙t͎͚̜̖̟͢i͢o͠ǹ̝͓̪̲(͝e)̷̫̹̞{͉̭͎r̥̜͢e̪ţ̳̤͔̪̪̼̲ṵ̫͉̞͟r̀n̴ ̸͇̤̠t̥̮̼̼̦͇̻.̦͍͙t̢̮͚̟̱ḙ͍̲͔̻̘s͔̭̗͇̪̺̫t̩̯̝̫̭̣(͎͖͔͈͖̺̜" ̧̫̳̹͉̫s͙t͇r͕̳̩̙̖̪͇i͚͎͎̠͢ṇ̥̻̖̹g "̦̺̭̼̠͈=̷͖̖̞̦̲=̢̘̯̤̩t̖͢y̪̪̙͍p̨̭͇e̡̥o̮̟̯̟f ̖͔̫͍̺͡e̹̤̞̩.͙͖̕c̭̤̼͘l҉̻a͕̩̰̬̯̟s̘s̷̲͇̠̯̜Ǹ͉͙̖͕a̳̳̫͕̘m͇͇̠̕è̯͓&̡̞̳͍̻̹̤&͈͖̜e̙.̠̣̤̕c̫̳̱̣l͕̹͕͙̭ạ̖̙s͍̩̯s̨̖̙̹Ǹ̟a͈̟̰͍m̛̻̱͇͎̮͉͉e̲͓̤͞|̶̹|̧̘̱̜̩̺ͅ" ̣͇̳̫̼̖̀u͢n̸͕͔̪̭̤d̶͓͇ḛ̘̟̰̙͔͟f̩͎̬i͔͡ņ̝̰̹̖e̯͎d̘ "!̮̦̫͇͕=͖̜̪̹t͝y͕̮̜̣̮͎̰p͕̙̩͇̤̜e̷̘̫̯̖͙̱o̺f͇̬͈ ̨̭̠̱e̪̟̥̝̝̻.̦̳̥͙g̮ḛ̵̰t͍̺̣̫A͝t̶̬͔̟͚t̜̞͙̻̤͍͡r̶͖̣͕͍ͅi̸̻̦͓̪̘̘bu̷̱̥t̢̪̮͓̰ḙ̟̹͖̤̻̹̕&̙͈&͘e̴̗̖.̙̮̹͖̥̜g̘̜̱̠̰̪̀e͢t̶A͘t͈̖̯t͈̥͍͎r͚̲͠i͏b͇͖̗͍͍̪u̠̱̬͇ͅt̞͓͈e̥͇̟͉(̹̳̣͎" ̖͔̣̱̰c̮̰͎̖̖̪la҉ͅs̲̘̥͍̭s "̷̣͇̳)̞̬̱̞̪͚̟̕|̫͈̙͈̲͠|̺͎͈̣͢" ̳͍͝ͅ "̪̣͍̭͠)̟͈}̬͉̱̥̘̥)̼}͇̺̻̼̜̻̼,̩̻Ḁ̷̜̜̺̤̳̳T̮̬̼͡T̨͍͔͙̺͚R͚̝̗̪̺̟:̵̼̲͕͚̯f̧̟̹͙̬̬u̯̞̟̬͎̥n̗͎͖͍̝c̗͓̩̺̙̝͍t̻̣̭į̥͔̪̼̹̻o̴͚͕̭̠̹̭̼ń̮(҉͚̭͚̘̝̫͍n͚̫̰̻͝,̻͚r̦̟̜̜͎̱͠,̫̝̜̟͠i)̻̱͕̦̭͈{̙r̖͖̪̝͙͓̰̕e͓͍͚̬̱̺͜t͇͍̳͝u̬r̛̯̬̪̗n̴͍̩͎ ͖̥̠̬̝̣͞ͅf̢͎͉̮̝̟̱̝u͏͓̠̱̯̺̰͎n͍͖͕̠̪̰c̺̙͙̘t̼̳̫̺ͅi̮o̷͈̦ǹ͔̪̹͉̖̜̯(͉̖͈̠̪e͕̮)̞̮{̷͙͈va͈̩̠̤͇̕ṛ̹̩̯͎͘ ̥͔͈ṭ̺̞̤̗=̬͉̰s̻͈̙̕ẹ̶.a̼t҉͖̦t̬̭͡r͈(e̮,̜͠n͍̮͇̻͖̥͕͞)҉̳͔̫̩̱̩͉;̗̞ṛ͖ͅe̟͕͟t̵̮̬͕̘̜̣u̖̬r͖͍̞̭n̪̱̱͠ n͙̗̬̭͢u̺̖ͅl͏l̹͓̣̜͍̭=̰̗͞=̭̝̗̮̥̦̤t̻̼̫?̩͖͚̗̜̺̘"!̶͔̳ = ̭͇̪̤͞ "́==̱̀=r̻͍͍̦̞̟:͔!͕̟̤̣̝r͓͕͚͈̺͝|͙̖̰͓͙͎|͈̣̀(̣̳̱̼͉t̜͎͓̜͡+̲͡=̯̞̲" ̴͓̮͚̺ "̴̦,̯̘̙̞̳̖̕" ҉͔̺̟̩ = ̦̥̟̺ "==̟̫̤̜͈=͇̹͚̭̥̬̕ͅr̀?͠t̰=̢̱̞͈͍=̴͙=̡̻̳̬̱̹̝̣i͚̼̞:͓͍͎" ̘͉̫̰͝!͢ = ̡̞̲̟̟͉ "͚͙͖͓͠=̭̪=̠͓͟=̬r̕?ṱ̠!̯̥̭̫̬͍̪=̲̬͖͙̲̙̠=̖̲̲̮̥̣̰i͔̬̘̖̮͚̰:̛͈" ̡̻̪͇̬ ^ ̭̠̤͞ = ̰̻̺̹͈͓̣ "̥̤̤̜͓=̥̠̙=͖͎̀ͅ=r̩?̬͈͎̪͉i̵̹̮̖&͈&̨̩͇̣̤͎͙ͅ0̣͕=̰͕̟=̪͕͜=͙͙̥̭̺̀t͖̜̹̙.̴̥͍i҉̯̥̭̝̝n̞͡d͖̙̘̲̯̘ẹ͈̘̺̖̠̝͝x̯͍͕O͇͚ͅf̧͖̤̮̰̖(i̶̙̱̣̘̱)̹͖:̼̠͔̘͙" ̤͈̳ * ̟ = ̪͓͞ "̸̼͍̘̮͇̳=̶̞͖̙͚͚̪=̘̥̻=̵͉̮r͎̻͉?̴̙̳̤i̥̣̬͍̣̠͠ͅ&̬̼͓̺͠&̜̱̗͎̙̭-1̲<͓̹̖͉̻̭ṱ̱.̗̺͈̯͈̭͡i̵nd̶̬͙̳̦̫̞e̟͠x̖͍̱͙O̫̟͔f̥(̣̲̭̜̬ͅi͇͓̹):̵ͅ" ͙̻͙̳$҉͔͚̼̖ = ͚͡ "≠͍̻͎͖̞=̺̲͔=r̘͖?̬̭̪i̶̝̱͙&͞&̪͓̳̝t.̠̟̞̞͙͕ș̯l̗̬̱̫͚̳̩i̪̙̤͖̲c̠̪͇e(̛͖-̧͔i̵̜͓̼̘̞̘.̶l͎͍͖̮͔̙͜eṋ̸̱̝̗͔̮͉g̦̩͡t̴͙̦̹h͏̮̭̙̻͓̤͚)҉̦͎̻=̜͖=̞̗͉̱̺̕=̷̘̜̝ͅi̤̭͚̲:̷̘͓̬̥" ̦͕̱̙̙~̸̫̲̗̙̫ = ̛͇ "̖͙͙̭͖͖=̵͚̦=̨͔̮͇̱̯͇=͖̥͕͙̻r͞?͏͍͙̬͓̱͇̞-̵̭̘̣̖͎̼1̻̺̟̣͖̫<͙͈̱̠̰̼(͖̩̬" ̲ ̲͈̲̭̯̺ "̻̗̫̫̕+̫͉̹̹̥t̸̝͓͎͈.͏̣̻ͅr̴̪̻̙̫͖ḛ̠͎̦̜͓̭p̢͖̲̱̳̦̰ļ̹̤̭̙͎a͔̜̟͎̭͚̥c̢̝̝e͚͍͖(̯͇̣̠̠B̗͚̬̠̬,͍̭̗" ̻̮ ͙̥͇ "̖͍͎̭̣͠)̡͍̰̻̫̥+̖͔͍͈" ̵̘̻̗̬ ̲̻͙͖͖͈̝ "͓̳̳̭)̜̮̞̘̤.͇̣̹͍͖̙i̵̼n̬̣̺̱͡d̩͈e͍̮x̟̭̜̞͕O̱̞̣̝̖f̥̥͉͖(͉̰͍̹͉̟i̖̺͜)̥̫:" ̶̻ | ͈͔͖͟ = ̟ "͕̥̠=͕̦͜=҉̙̠͈̞̼ͅ=̯̩r̸͈͔͓͍&̕&̮̞̦̼̥̝̻͘(̨̱̦ͅt=̥̩̣̬͎̝͕≠̱=̟͈͎i̩͙̬|̢̩͓̱̤̪|͎̪̘t̞͚͍̠.̖͇͚̠͖͖ͅs̳͈̻̤̜̯͙l̙̟̩͍̠i̺̬͇̘c͇̺̝͙̟̯ę̱̳(̖̦̣͡0̨̪̼̠̲͓̪̼,͠i̜̪.̨̜̖̤͓̳̩l͖͓͇͠e̸n̢̝g̗̫̗ṯh̢̠̯̝̪͖̤+͕͎̫̟ͅͅ1͙̫̳͕͝)̗=͎̞̻͔̬=̠̥͚͖̺̖=̳̞͖i̧͔̯̦̠̹͍̲+̵̺̟̟" ͚́ - ̣̭̥ "̤͙̤͓͎̦̙͘)̖͉̤̫̲̲̮͟)͉͚͕̥̮̣}̖̳͉̻͇͙̹}̹̱,͍͍͔̬͕͙̪́C̼̳̦͖̩̳̟H͖̞̲̠̩I̝L̺̩̝̭͕̮D̷͙̟̙̰̬:̷̖̬̥͓̦f̯̗̝͍̗̮̜͡u̙̘͓n͚c̘͇̜̘͎t̴͚̻io̴n̮̭̺(̪̼̣͎͝h̲,̛̱͎͚e͎̫̱͇͙̞,̬͚̱͞t̛̬̥̬,͘g̥,v̕){̳̯͙́v̱̫͙̯̮̝͠ar̨ ̙̩̣̪̫̣y̫͖̙=" ̭͇̥̭n̩̱͓̣̘̮ͅț̭͡h҉̝̮͕̯̣̝ͅ "̪̘͙̀!͏̟̺̖̦͖=̗̰̖≠͕h̲͢.͓̯s̫̭͎̯̯ḷ͇̼͇̖̝iͅc̗̜̠̠̹͜e̞(̛͎̣̠0̭̞̫̞̻,̨̜͈̮̠̫3͉͕̟ͅ)͎͍̦͝,̗̰m̝̜̼͉=̼͉̖͓̜͠ͅ" ͙̙͉͓̺͕ͅl͕̜͍̪͝a̪s͈̮̳̜̞̱̗t "̼̼̖̼͇̮ͅ!̩=̘̙̦͔̠̩=h̢̭̝̮̼ͅ.s̮̦̲̻li̝c̣̗̯͡ͅe͈̻̣͔(͎̜̫͎͜-̶͖̻4̹̤̞͇̝)͉̖͖͘,̘͓͍x͈͈̙͖̦͔=̥̥͝" ̧̟̞͚͕o̺̭̣͟f̪̠̫ - ̛̝̩̦͈͖̠̪t̮̳̲̯͔ͅy̱̟͝p̜̲̺̼̺ͅè̘͕͚͚̼ "̞=҉=̷=̛͓̩̱̗e̢͇̗;̀re̞̣̯͙t̥̣̤̲̲̩̖ú͓̯͙r̨̼n͚̤͓̬͇̭͕ ̭̪̙͕̻͚͕1̡̺̲̳̯̫=̢==̯̩̜̝g̶̞&͖͎̝͖&͖̲̺̞͇̯̦̕0̲̻̪̹=̀==̛͇̼̭̫̩̝̫v̲?̩̲̲f҉̖̹̣̤̭͇u̲͜n͏̬̻̫͚̖c̸̙͍ͅt̩̗̳̝͡i̸͓̮̹̰̺̼̠o͎̲̕n̸̘̹̘̣̘(̨͍̗̳͍̘̬e̻̖̥͙̯͉͔)̞̠͍̙̖͉ͅ{͚͡re̖̖͘t͖̼̦ṳ̫̺̯̩͍r͈̭͟n̞̫̱̖̖͔͍!̠͓̙͈̱̯̦!͔͙̗͚̗̖͢e.̵̬pa̢̯͍̰r͈̝̺̰̤e̮̖͇̬͘ͅǹt͔̮̙̺̫No̱̙̘ḏ̳̟̞͕̜͡e͕̪̲̠̝͙̥}̞̩̥:f҉̟̦͓ͅu͏ͅǹ̟͉͉͕̣c҉̮̳̘͔ͅt͚͍̦͉̯̙̙͝io̢̬͇̤̯̘̹n̗̝̘͇(͔̰̟̳͚̣̬e̹͇,̯ͅt̴͙̖͕̹̫͓,n҉)̯̩̗̪̯̠{͏̝͉̳v͖̖̥͚́a͕͈̰̙r͕͎ ̷̦̩r̨͔͇̲͇,͉̳í͕,͏̙̘o̺̟̣̙̭̦͞,̘ͅa̤̥͇,̸s̢͍̝͕̪,̭͕̜̜̫͘ͅu͍̪̖̺͠,͉̟ĺ͓̦͍̹̦͎ͅ=͉̮̲̬̣͓y̭̰!̫̖̺͓̲̦=̯=̧m͖͙̰?̰̞͔̣͓͈" ͈̭̲̲̼͠ͅn̷̻̮e͔x͏̹t͚̳̳Ș̩͉͉͝į̼͔̻b̯͎l̤͇̮̱͙̳̫i̴̟̳̖̣n͏g͠ "͖̬̦́:̼̻" ̧p̶̗͕r̵͔̥̩͍͔̪ę͖̗̻̜̮͔͈v̳͟í̝̬̞̣o͙̞̬̮u̻̹̪̦̯s̻S̭̳̘i̬b̦̙l̼̣̞̘i͚̦̭̲͙̥͔n͇͔̝͚g͕̲͎̣̝ "̟̮̥̭͍͜,̳͘c͔̖̹͍=̷̩̲͎̻e̼̱͈̼̤̥̠.p̦̲̼͕ar̙̀e̳͈n̨t̗̠̗N̻͇̭͘o̹͈̣̫͎͔d̨͚̙̤̳͔̝e͈͍,̪̝̰̬̝̟ͅf͍̞͞=̶x&̼̬̙͙͘&͕̬̖͍̗̲ͅe͢.n̴̦o̹̜͞d͢e̛͇͉͎̣ͅN̲͈̯á̟̬̣͚m̸͓e.̦͇̣̬̞̪̕t̟̝͍͍̞o͓̝͍L̶̼̻̲͇̪̼͖oͅw̪̜̙͎̪̭e̮̻͉̳̺͚̩͘r̹̦͍C̦̯a̡̜̭͈͎s̳̼ͅe̹̰͓̺̹(̰̻̭̗͔̕)̙,̸̗̬̤̱̗̦p̨=̼̲̤!҉̹̝̼ṉ̪̼̹̫̕&̳̮̪͎̼͜&͈̣̯͕̺͎!̳̘̺̲̙̰̝x͞,d̨=̭̪͚!͇͎̝͢1̵̤̪͓̟͔͔͚;͖i͙̹̠̜̺ͅf̮̠̟͇̱͇(͙̥͇̺͘c͔̻͓̥)̪͓̲͖̜̳{̡̠͖̣í̞f͇̳̯̭̯̙̖(͟y̻̥ͅ)҉̞̺̫̞͔̖{̺̤̜w̱͉̠̗̪̱̠h҉͎̝i̟̜͚̭̪͞l̼̼͔̬̯͇̟e͎͔͚͓̺̮(̣̦̫̞̼̘l̦͍̯͈)͏̪̙̼̤̣̹̟{̟͟a҉̝̖̟͇͚̹͉=̀e̘͔̮̥̣̩͡;҉̦̩͉̬̪w͔͙̩̯̪h̴͈i̠͕̫͈̺͝l̟̟̮̟ḛ(͚̥̜͈͇a=̷a̻̝̝[̮̪l͓]͇̺̞̬͓͓̦́)̯̻̥͠i͏̣͚f̶̤̘̦͍̜(̶̬̰̞x̴̱͎̱̯?̤̩͚͖͍͇a̖.̧̦͙n̥̮̤̥̻̺̝͝o̜̫̣͙̗̺d͈͚͜è͎̫͓̲̲Na̦͔̗̪̩̭̳͜ḿ̥e͓̰͔ͅ.̱̞̪͖͎t͕̭̦̝͇͚͉o͍̼͙̠͎͜ͅL͏̞ó͍͔͉w̵͔̹̩̳̰ͅḙ͓r̛̼̣̘C̷͉̦̜͖͎̥a͕̠s͇̮͈͍e̘͔͝ͅ(̫)͉͔=̘͖̤̺͈=͜=͕͞f̖̭̩͈͉̰͈:̭̮̩̞1̣=͔̖=̴̭̮=͖̜̘̟͈͠a҉.̵n͓͉̝̼̯̳̝͟o̲̗̪d̫͎̤͍e̳̟̩̗͇̯͙T̬̮̥͈̝̹̪y̨̞̭̻p̱e̥͇)̵͚ṛe̩̞̪̝̤͞t̶̖u̙̩̪͚̖̺̤r͏͙͚͇͕̯̳ṋ̰͚͔͎!͜1͕̙͖͞;͏͔̜̺̠̝̝͎u̹͉̮=̰̞͢ͅl̨̼̣̩ͅ=͙" ̵̹͈͔͎͎ͅo͓͓͍͚͕̕ͅn̵̠̯̩̝͈͙l͚͍͖̳ͅy̜̖̟̙͔͙̟ "̻̠̭̗̤̩̺=̲̗̣̲̹=͈=̤͔̬͕͍͕̪ḩ̺̙̲̪&͔̻͙̞͓͙&҉̣̟̼̦̦!̢̬͕͖̰̱̰̞u&̴̗̗̘̼̤͉̼&͖̬̖" ̺̟̲̤͇ņ̩e̪̭̲x̧̬̼̠t͏͎̭̣S̝͇̹̪̞͖ib̲͓͓͓̻͙̹l̞͙̹̬i̳̜͓n̴̙̜g̺͘ "̠͚̥̠͎͞}̰̖̫̲̰͢r̭͓̰̝ę̖̘̜̜ț̤̰̱̙̺̻͡ur̹͎̬̫̬̱͍n̵̫̣̗̠͚̦!̪̰̙̻̱0̝̰̠̟}̻͈̠̱̭i̙f͔͇͢(̨͔̼͇͍u̪̖̥̹̬̘͝=̴̰̭[̞m̘͇̩̹̦̳͘?̴̦̫̙͚̦c̠̜͢.̼̺̹f̱̕i͏̰r̙̗̩͈̱s̫͚͟ͅt̞̘̱͈̟͇͜C̦̖͉̣̬͝h̖̮̤̺̫͚̱́ḭ̰̮̙̜͉ḻ̦̰͉̞͈̼͘d͉͙͖̫̙̼ͅ:̜̩͓̭͉̩̲c̯̳.̵l̙̰̰͈͞a͚͔̲sṯ͖C҉̤͕̫̞h̷̝̗͙̥͓il͙̜̟d̥͈]͎̘͙͜,͇̣̥m&̳͎͕&҉͇͇p̟̫̹̺͎̀)̸{̢͖ḓ̟̦̻̠͎=̼̞(ś̟̮͕=̙͈͎̫͚̰̤͢(̜͕̺̻͘r̼=̮͈(̬̥̲̯̪̩̲i͙̫̕=̰̼͓̗̟̪(̢͙̳͚͉͕o҉=̵͙̲(̧̹͚̺̫͍̩͉a̰̝̜͍̩̭̲=̖̳̘̱̦͉̕c̹̦͓̺)̞͡[̲͕̱͚S̸͓̼̖̰ͅ]̣̩̠̦̺͎|͓̼̠̰̫̼̬̀|͖̘̣(̭a̢͎͖[̯̪̩̣̩S]̪̫=͈̜͉̞̙͇{̪̥͎̮}̙͇̪̤͢)̲͎̯̺͉)̼̭͚[̬a̧.̘̮̩̦̥͢ṳ̧͙͉n̵į͉͉̰̮̙̗q̛̭̟͓͓̟ͅu̪̘ͅe͙͙̫̫̟̻̲I̻D̗̯]̤̦̝̟͔|͔͔̱̻̰̣|̭̖͕̫(o̮̗͜[͏͎̺͙͈a͖.̟̥̳̳̯͘ͅu͈̠n͍̕i̲̺̼̟͕͎̖͘q̳̲̬̥̙͞u͖̟̥̼̭e͎̗I̧D̖̯͖͉]=̗̠̱{̖̩}̥)̱͍̥̕)̙̳̱͟[͖̤̝͖̱̪ḫ̡̼̜]̶̼̺͈̖͍̗̼|̶̥|҉͉͓͔͎̟̼[͈]̠̻̰̪̗͈̼)̴[̗̦̝̖̝͕̝0̯͜]̺̙̬͈̹̟͇=͖̬͉̪̝̳=̡̠͍̭=̷k̷̝&͉̤͢&̙̲͓̕r͙̞̮͇͔̱̝͠[̙͙̹̹͎̲̣1̜̝̻]҉̲͇͓͍ͅ)̗&̟̩̞̳͎͟&r[̘̤̪͎̹͡2̸̣̳͍͔̣͙]̘̤͓̣,͍͇̺̩̲̩ͅa=҉͖͓̲͍s̳̲͎̱̝̜͡ͅ&̮͖͕̯&c̩̲̤.̤͡c͍͙͍̙͇̠ͅh̲̖̲̠i̯l̖̼͇̩͡d͇N̮̗͍͕o̼̼de͞s̠̳̮̜[̺͍̫͖s̭̠͇]̨̪͖̟͎̥̣;̸̱w̸̜̦̻̮h҉̙̰̥̜̟i̷̪̩̰̜̹l̠͎͟e͔̥̳̙͕̩͔͡(̳a̡̦=̻̣̲+͢+̦s̰̻̯̩&̧̮̼͕̺͉̤&̜̼a̫̦͕̭͚̤&̴͇&̦a͈͝[̵̪̳l͕]̹||͍̟̲̟̫͔̥(͔͈͇̞ͅd͉͈̦̟̼̯̦̀=̩̞͔̼̭s̟̼͓͉͚̼=͉̻͓͉0̹̻̲͎̠)̛͍̪̺||͉̩͚̼u͢.̗̳͓̺̫̗̀p̝̰͇̦o͙͙̥̝p͎̫͍(͕̗̭͖͟ͅ)̷͇̮͈̦̲)̯̦̱̻̝͜i̦͈̞͙̻̜ͅf̩͉͍̙̱͝(̢̜͎͕1̶̼=̝͖͜=̳͢=a̞̹̞ͅ.͜n̶̞͔̺̘̫o̩d̝̻̞̜e͚͔T̷͎y̧͎̲͓̳̯̗̱p̧̲̗e͚̣͢&͚̜̹͜ͅ&ͅ+͔̰̭͓ͅ+͎̗͇̫͈̼͠d̸̹&͓͍̬̙͞&̡̥͈̱̺̫a͜=̮͕̤͍̗̟ͅ=̴̭̝̯=̶̯̗̬͇͔̣e͓̻̲̝̙)̻{̣i̭̭[̢̯̮h̟͚̖̬̪̼̙́]̮̰̦͉̻=̨̺͓̗̞̣[̪̟̝͈̳̳k͈͉͓ͅ,̸̗̺̹ͅs̲͔̗̞,̣̫̬̩͖d̥͟]̤̗͍̝̺̲;͇͎̭̫͡b̮̲͔́r̰̰̯̞͎̭͖e̶͉̗̯̘͍̱͓a̲ͅk̥̹̺̞̳}͖͓͉̩̬̩̭}̯͍̞ͅę̣l̤̞͎̜̘͈se̹̟̣̫̫ ̷͚̺i̯͉̯͖̥f̴(̨p̝̲̳̖͇&͙̭͕&̵͈̥(̺̤̘̥̦̫͜d̸̻͈̙̟ͅ=s͈̣̟=̜(͈̞r̦͍̺=̶̼̼͇(̖͉̫̻̝̜i̝͔̣̣̙=̛͉̝̩(̩̥̞͕ơ̫͍̯̙̹̯ͅ=̡̪̬̲͉(̨̥͎̲̠̬̟ḁ̪̹̹̖͈̳=̤̰e̼̠̪̩)[̻͕͝S̝̝͓͘]̨̩͓̪̹̪|̮͈̖̕ͅ|͈̝̟͚̝̀ͅ(̖̪̠͡ͅa͕͚͓͟[͞S̱]̯̻̝̜=̗́{͚̣͉̦}̴̺̼̫̭ͅ)҉͔͈̮͇̭̺)̰[̸͖̝̜̙̫͍̗ạ̠͕̬̬͚.̣͙͍̖̰͎̭́ṳ͈͕̺̭͓ṋ̘͉̮̳͠i̲q̢u̼̣͙͎e̻͇͖̟̠͝I̹̱͔͎̞̖̯͝D]̮̺͓̦́|͇̹͕̗̰|̧̖(͏͎̰̲o͏̝̼̘̻̼͖͙[̻̯̣͓̬͡a̖̺͍͙ͅ.̸̲̱̯̙͍ụ̰̤̝̩n̬̻̜̞̫̯͔i͢q̖͙̮̤̟̩̝̕u̦͔͙ẹ̠̭̺͡I͇̻͚̻D͍̗͘]͏̤͎̠̗̜̩=̶{̫̞̬̮̯͇̕}͚͇͉̼̖̱͙)̡͙̲̙̫)͎̗̩̟̣̪ͅ[͏̤̱͈ͅh̵̦̭̝̤̮]̶|͔̘͔|̛͙͉͖̩̹[͓͖]͜)̵͇̜͕̞̦̻̰[̭͈̤̯0̸̗ͅ]̡̞̯̘̙̭=͚̣̠̺̙̻=̹͡=̮̺͚̮k̶̲̝̺͕͍̖&̤͔̝̜&r[͓͉1̛̣̦̫]͝)҉̗͓,͍̳̥̗̪̦!1̱͎͇̺͘=҉̗͈͓̘͔͙̯=̫̹͈=͘d̵̞̰̺̦͉̠)̖͉̥w̻͈̝͍̲͡h̼͍͔̗̲͚i҉l̳e̠̬͎̗̦͇(҉a̡̦̤͇=͟+̵+̥͉͎̼̺̘̠͘s̛̯̳ͅ&͎̮̕&͍͝a̖̯͖̙&̳̥̜̦̠̟&̣̲̲̭́a̘̪̤̠[͔̪͜l͓̭͍̗ͅ]ͅ|͎̼̮͔ͅ|̠(̺d̵̼̦̤=̠̘̬͝s҉͇͍̖͔͖̺=͖0̨̻̯̟)̘̣|̬̞̣̳͈̠̺͟|̰̰̗̯͇͜ͅu͓̲.҉̜̱̦p͔͎̝̞͙̥͖o͇̦̪p̧͕͉̤̳(͕̞̀)̺̝̗̪͜)͙̙͕͙̦͖̫͟i̩̪̳̥̰̳͔f̦̳̰(̲̯̰̟̱(̵̳x?̮̠̪ͅa̼̝̟͎̠̟͡.̟͖͓̟͘n͕ơ̘̬d̮̝̩̙͚e̷̻͈̤͍̬̬̞N̺̱̹̯̲̘͟am҉͕͇̣̳̳͓̖eͅ.̫̖̰ͅt̩̖̬͓̼͘o͙͈̲̝̲͚L͎̤̻̭̫͖ͅo̬͖w҉̬ḙ́r̡̯̩͕̯̖̗C̨̹͓̗̘͇a̘͚̤̕s̴̜e͎(̷̗͙͍̜͇̠̹)͇͎=̣͇͜≠̪=̰̩̮̗̝̟̟f̷̩̲̠̬͓̼̫:̺̪̻͢1=̰͍̳̻̮̲≠̼͙=̖a̸̻.̴̮̯͎̤n͈̺̖̮o̝̩̪̙̲d͍̩͓e̦̟̭T͇̤ỳ͇̭̼̪͈̗ṕe̖̰̖̼̖̜̣͘)&̟̻͈̝͓&̲̲̜̯͚+̙̬+̯͍̮͇̮͚d&̷̳&̫̙̭̳͔(̱͇̤̫̦p͏͎̼&̶͕͓͖̖̩͚&̹̦̤̥̠(̙͠(̵̘̳͙̙̦̦̼i̡͎̱̲̦̻=̤́(̸͇̤̹̗o̜̺̮̭̙̪̥͜=̝̜̭͖̭̀a҉̻̝̞̮̖͓̰[̫S̺͉̦͚̘̣]̰̹|͉̲͙̯̰|̗̳ͅ(̬̙͇̥̲̕a҉̙̜͓[̱̼ͅS̵]̶̹͖̲̥̳̩̞=̞͇̭̬̞̫̜{}̖͍̹)̷̣̣)̭͓̱͕[a̲̘̩̣̜͎.̜̦̣̱͇̬̼͘u̱n̸i̻̝͓͖q̺̭̞̘ư̠͔͓͙̞e̛̗̻̬͚̳I̷͍̗͎D҉̗̙͇̰̫]͚̬͈|͙͉͎̝̟̙͕͘|̬̜̖͎̬(̟o̢̪̺[̮͎̼̥̥̹ͅa͎̣͟.̫̗̳͈̣ụ̤͎͉ͅn̢͓̺̠͙͙̬i̘͈̮͙̘̞qu̜͇͚͉͍͎̥e҉̜I͚̺ͅD̳̩͟]̮̼͍=̳͖̗͎͇͎͟{̭̯̝}͇̟̱̫̫̣̳̀)͍͞ͅ)͉[h]̥̝͓=[̼͉k,̕ḏ̢̟͇̬]̡̠̪̟͈)̳̲͓̝͡,̴̰̙̜̩͎̫͖à̹̰=͚̣͞≠=͍e̦)̺͔̰͙̗)̴b͚r̜e̴̗̼a̢̹̣̳̤k̪͙;̫̺̲̫̩̻͎r̲̙e̛̝t͔͙u̸̖̼r̲̬͇n̶̦͔̪̱(̩d̹̤͖̳̪̣-=̬̹̝͟ͅv͏͙̯̬̯̲̳)=͕̳=̣=͚̜̺̙̪̘̗g̮̟͕͞|͚̻|̭͔̭̯͉̦̯d͚̭%̞̙̗̠̘͓g̮̦͎̥̦͖͢=̜̱̹̝͓̥̬=̯̤̣̖̼0͕̥&͙̙̟̪̀&͏͍̱̞͍̺̪̰0̴͉͖͉̠<̱͝=͇̰͕̱d̟/g͍̗͓͖͍̻}̖̦̜͎͍̳}̼̯͕}̼̘͎͚,͢P̬̹̯̰S̠̳̲̖E̝̤̯U̻̬̟D̖̥̱͖O҉̗̻̝̼̲:̱̠̲f̯̦ͅu̳͔̩̩̱̹̥͜ń͖͕͕̮͔͚̮c͍̻̤ͅt͈͉̯̻i̤̦ͅo̬̥̲̝̱̘n̶(̢̼̣̠͕̠̻̦e͏̖,͕̹̀o̵)̻͈͕{̙v҉̟̞a̙͇͈͝r̷̳̰ ̥̪͞t̢,̤̫͍̣̬̮a͇͚͇͢=͇̘̩̲̮̘̙͡b͕̠͖̟̼͈͢.̮͔̠͔̩ͅp̨͓̖̺͇̬̖͎s̟͔̬e̺̗u͓̯̳͇d̰͓͕̭̙̖̻os̨͇̣͚[͖e͇̟̞ͅ]̣̳͙̩̰̥͕|͈|͇̟̤͝ͅb̤̥̝͉̼ͅ.̱̪̜s̞̳̱̞͈̰̜̕e͝t̼Fi̘͎̼͔ļ͈͚͚̙t̪̪̟̱̜̖̞͟e̩̜̩͖͙̱̤r̛̲̥s̻̫̩̤͎̠[̗̝͎͖͘e̼̹̻̩̪̘͞.̦̤̲͉t̟̯͟ọ͈͍̯̮͕̥Lo̖̫̘͝w̗̬e̡̙͇̦͔̼̤ŗ̯̖̞̙̦͚C̹͇͟a̱̖̘̳̬s̮̫͚̘̬̯͔e̷̬̘ͅ(̴̰͙͉̫̩̤)̼̗͎͓̹̹͠ͅ]̖̱̣͎̣͎̪|͔̰͓͍|͞s̡̞͕̼ͅe̴̥̩̙ͅ.̫͓͈̲͢ͅe̹̤͇̬͈̠ͅr̹̳̗͍͉̠ͅr̬͚o͜r̨͍̙̫̝̗(͡" ̝̝̬u̖͎̗̳̥ͅn҉̦͇͙̳͎̻̭s̢̳͉̻̺͎̩ụ̳ṕ̤̭͖po̵̝͈͈̻̠̥r̬͉͍̲t̟̣͈͚͇͕e̯̫͇d͎̪̝̼́ ͈̹̠͜p̭͎͉̥̻͚͝ͅs̢̝̯̙͎̱e̥͇͔u̮͙̮͙͙̝̥d͔̺̙o͉͈̝̯̮͕: ̦̝̜̘͓ ҉̪ "̨͚+̸͇͙̲̬̤̫e̷̤̫͕͉)͏̜;̺͖͉̖̩̞r̸̳͚͉̮e̷̟͖̣t͉̪͇̕ͅu͙͓ͅṟ͓͓͙̼̖͉n̞͔͓͓͈͉͖͟ ̺͖à̘͕̯̮͕[̢͕̭̫̲̣S̥̺̰̤͠]̝̮͘?̴̜͓̺̞̣a̢͙(̳̘͓͔̩̗ͅo̖̮͍͈̥̳̕)̞͍:̥̣̹̥̯̱͉1̢̪<̼̹̗͚̞̥͝a̭̻̕ͅ.̣̺̰̫l҉̻͕e͓̮͎͞n̡̯͔̰͎g̶͎̝t͏̤̖͙̭h͍͍͈?̴̮͓̯̳̥̻(͏͇͉t͈=̦[̬e̦̮,̡̳̗͈e,̲̯͙̬̩̠" ̡̼̬̠͙ "͓͡,o͍̼͍]̦̦͔͝,̤̞͞b̞̖̬̠̫͎̙͞.̘͎̹̩̪ͅs͖̱̰̙e̬̬̲͎̜̪͖t̵̮͔͔F̧͙i̩̗͚͡l҉͎̭͕̫ͅtḙ̞̟͔r̖͚͉ś͔̜̬.͈̟̖̜͙ḫ̫͙͉̱̹̕a̬͙s̠͍̙O̞͈̣̩̟͢ͅw̶̱͎͙̞̯ͅn̳̳͓̟̻̖P̣̮͇r̦̭̮̻ọ̺̩͎͉͚͝p̡è͚̩͎̲̜r͏̱̯̝̗̞t͉̞͕͉̟̥̦ỵ̮̲͇(̖̩̟͙̥e̴̫̱̤̥͉.̞͍t͎̟̝͙̝̬͍o̭̗͓̪̣ͅLo̙̰̺̳̻ͅw̟̳̮̳̪er̬̣̙͓̻̗C͙͚̳̩͔͈̪a̸̗̮ͅs͈̳̞̞̹̣̱͝ḛ̛͖̖͓̪(̠̠̮͓̗̙̤)̗̲̜̯)͇?̧̝̜l̵e̺̦̱̟(̴̬̪f̦̼̥u͏͕͈͙̳ͅn̵̰̦̳͔c͔̳̟̻͎̦̖͜t̰̩̳͔̹̬̘i̻̥͇̼̟̹̭͜o̰̪͜n̨͚̥͈̦(̲̭̱͙̕e̷͔,̶̭̙̣͓̻t͈)̸͕̦̹̻ͅ{͙̰̥̝͖̳v͖̮̻̻̠̹a͚͙̘̹̖r̡̤̯̖͔͓ ͝n̙͚͙̤̱,͍̺̲r̳͉͝=̮̠̦͕͍̖̤a̫̹͖̦͉̱(͔̺͔̼̖͢ͅe̜,o̤̬)̳͕͎̜,̴̫i͖͙̭͎̤̘̘͝=̵̜̫͓̼͍r̵̙̣̝͔ͅ.̪̗̘̤͚͓ḷ̞̪e̼̱̺͢ṋ̺͕̯g̜̲̼̻t͍̟͖̹h̤̦͔͕̱̤̖;͍͙̗̤wh̨̤̮̠̙̺i̡̦̲̗l̸̪̦̭̫̪̙ͅe̺(̟͉̬̬͞i̸̪̤̝͍͍̼-̼̞̘-)̴̙̫e̢͔̬͎̞͙̣̠[̧̤̣̠n=͇̞P̢̻̖̣͉(͏̱̤̗͇e̵,͡r̟͘[̹̟͇̰i͏̥͈̝̬̹̥͔]̯͖̹̬)̥]̢=̜̜̺͙̱!͟(̶̤̖̱̟͎̗̙ṭ͍̦̣̬͜[̦͠n͏̫̻̦̖͔]̧͈̗̖=͉̤̺r̢͇̼͔̱̬[̴̝̩i̥͕̹̬̫̤̘]͇̭)̺̯̤͖̥̞͢ͅ}̙̠̥͔͕͇ͅ)͔̺̳̬͕͔̰:̸̹͍̭f̫͙̖̺͚̙͘u͟n̡͔c̫͇̕t̟̺̭͖͞i̢͈̠͉͈̩͉͙o̹̞n͇(̱͚̳͖e͏͕)̗̦͚̝͖͕͍͜{͉̜̹̤̘̬͓r̬e̯͕͈̼͍̦͚t̪urn͈̬̳̤̗͈̯ ̖̘̼̮̹̮͝a̳̻̻(̲̰͙̹̖e͉̞,͢0̭͈͎̦,͏t̻)̜̻̱͖̟}̹̺̝͚̱̥)͚͓͍̜̠:̘͎͔̱̻̰ạ̟̜͜}̠̱}̡̞,̗͚̞͟p̘̙̬̮̦̤s̗͈͍̲̞̖̬e͏̟͎̺̤̥͔u҉̥̞̜̠̺̝̗d̻̦̙̦̝̬o͔̻̩̞̝͓s̷͔:̫̪͈̗́{̧̩̤n̨o̜͔̗͔t̪:̩̭̫̙̩̮l̯̩̜͟e̤̦̬͍(f̲̙͓̭̹u̹͇̗̘͇͓͈͡ṉ̠̦c̡ṱ͚̟̜̘i͖̘̠̼͈͈͞ͅon͙̩(̟̯̭̮̩̕ę̤͎̞)̭͚͉{̡͙̺̦͎͖v͚̞̜͓̼ḁ̱̲͈̻͓̥͡r̬̗͖̤ ̷̭r̶͎̼͎͚̤=̢͍[̘̫̥̣̀]̺,̘̻̯͙̀i̮̱͓̤=̡̜̱̱[̨]̙̼̰̯͓̟ͅ,̛̺͙͙̲̰̪̞s=̧̗̟͖͙̠͔f̻̤͓͔̱̥̖(̴̻e̮̖̮̗̮͞.̴̗͓͈̼͕̺̯r̛e͖̪̯̝̕p̖͢l͍̻̦̮̩a̠̜̠̟͍̝̰c̷̯e̥̲̼̤(̼̝̭̫$̳͖̣͓,̴͓̜" ͕̲͠$̗̱͝1͙̝ "͍)͇͉͇͎̩͟)̡̜̹̥̲͎;̨͖̮̣̥͉r̗̗̩͚e̲͚͞t̲̗̣͔̼u͈͞r̸͕̯̙ṋ͈̼̹ ̵͔̯̣͇s͎̹͕̜[͎͔S̷͉͈͎̪͖͓]̶̜?̮̱͔̖͓̣l͓͉̜͘e̺̙͕(̦͎̥͙͡f͉͇̕u̘͜n̢͚͓c̴̦̳̥t̤͈̝ịon̯̬͈͚̟̖(̴̦̤̘̮͈̥e͖̜,̢̘̻̝̭̲̫t͓̖͎̼͙,̗̟͈n̜̬̜,̲̦͇̬͇͠r̙̯)͏͖̫{͏̖v̘͙̱̠̞a͇r͇ ̢͕̖i͚̫,͕o͟=̮͇̙̤̗s̵ͅ(͝ȩ̙̩̱̟̮͚,̢n̶u͈l҉͍̩̱̗l͇,̲͈̕r̫̼͔̖̱͈,̬͙̘[̯͙̳̖̝͉]̣̟͓͕͔́)̺͢ͅ,̫̖̼a=̶͉̟̝̺̯e̳.̮̝̻̭͙l͠ḛ̱̩̖͉͇n̷̦̪̣̖ͅg͘t͔h͈;͡w̰͖̝̯̝̠̦h̭il̦͕̫̮͙̹̜e̻(͙͖̜̘̲a͚̤̹̞-͚͕͉̮̳̜̙-̛͙)͓͈̬͎̥̜(̧̻͈i̤=̛͎̥̪͉̹͙̠o̫̰̣̬̜͉[̬͖̞͇̩͞a̵̦̣]͓)҉͉͓̲̗͖&̗̞̖̤̱̠̘&̝̙̙̠͇͈(̩̥̘́e[̘̮̝͔͖̹a̖]̨͖̺̖̺̜̹̬=͙͚̗!҉̪͔͈̗(̺̣͖͎̟̼̙͜ṭ̭̻̬͞[͙̘͠ͅa̘͝]̡̺̯=̟͍͖̝͞i̠̣)̗̤͜)͎̻̟̲͈}͏͓̲̟̦̬̺)͇̟̻̯͓:̢f̦̟͎̪̣̰̬u̧̼̤ͅn̮͠c͙̣̫̞̭͙ṱ͔i̫̫͙̪͟o͉̞͚n̪͇(̺̞̻͈̖͟e̹̳̬͎̕ͅ,̝t̗̹͠,͈͔͇͎̮̥͡n̬)̶̼{͙̩̖̮ṟ͕̫͓̠͎̞e̯̙̬̤͡t̢̤̼͓̫͉u̶̱͉͉͇͕͔r̶̘̖͓n̳͔̭ ҉̣̩͚ͅr͓̟̹̻̞͢[̡̣̼̭̞̜͍̥0̹̤]̵͇=̨̦͍̺̟͈̼̖e̦͈̘̥̘̯̹,̤̬̘s̨̗̻̗̜͈̣(r̤̞̗͙͚̯̲,͍̮̬̪n͕̹u̶͔̱͚l͖̰̬̻̩̹͡l҉̻̗̞̼̳,̧̯̜͉̖n͎̺͘,̯̝i̛)̥̭̺͖,͏̟̬̱̠͔̺r̟̹̘͕̯͎[̜̪͟0̨͉̣]͍=͢n̗̰͚̙̰̫͞u̝l̡͉͉̹̤l̝͈͖̠̫͟,̮̬̮̠͟!í͔̬̥̮̠͈ͅ.̙͈͢p̻o̜͓̼̥͜ͅͅͅp͏͈͉̜̩͕ͅ(̨͇)̪̦̦͍}͍̬̦̻}̺͎͉̻̹)̱̯̰̠,̳͓̞͍h̲̀a͙͔̪͙̞̼͜s̟͚̪͇̣̞:̻̞̗̖̟̪̙͠l̺͕̖͖̬̞͢ę̱̞̥̖(̦͍̮̭f̼̣̭͇̜̗͜ų͇͉̻͈̺͈̘n̲̙̦̙c̣̱͚̞ͅt̪͕̙i̬͎̼͎̦͎ò̟͈͓̱̠̗n̝̝͚̥̖(̻̞̻̦͟t̨̮̼)̶̟̹̭͚ͅ{̻r̘̼̲͉e̴͍t̛̹͔̰̤u̵r̟̖̗n̶͓̜͚̱̖ ̨̹̩̖f̰̥̩͚̞͍̹u̶̯̝̥̝̣͙͎n̮c̸t͙̖͕̻̳i̜͎͕̦͚̖̜o̮̳̜̯̮̩n͈͔(̡̺̗e̵̪͍̜̩̝̦)͏̟̳̫͕{r҉̱̟̝͔e̙̼͖t̠̣͈͢ṷ̩̘̟̳̣̫r̢̝͍̠̥͈n̮͓̟͇͎͟ ̴̞̣̗ͅ0̬̫͍͍͈̗<̤̭̗̹͎̲ͅ/̟͙̩̪̬̙̀a̛>̖̞͙͚̻͇͘" ̖̙͎, ͏̻͕̙͉ "ͅ#" ̷̝̞̱̺̗̠͕ = ͚̻ͅ = ̱̺̗ = ̺̙̖͎̣͝ͅe͝.̤̬̝̬́f̤͚̟͎̳ì̙͇̺̖ŗ̼s̖̘̩̮̀ͅt͞C̣̣͉̞͓̪̭͠h̸̪͈̦̰͍͓̹i̱͔̗l̤̹̼̣̼̬d͔͔͕̖̯ͅ.͔̼ͅg̪̯͈͚̯e͙̠̹̜̣̲t̙̪͎̘̥̖̝A̭̼̟̘̙͍̹t̞͉̥t̞̼̯̲͉̀r͇̗i͚b̸͕͕u͖͘t͎͞e̪(̞ "̥ͅḥ̲͚rè̹̣f" ̰̦̹̙)͍̮͓̞̣̫ͅ
        }
        ̟͍̪̘) | ҉̖͎ | ͙̱f̴̭̻̣̫̪̘̠e̟(͚̀ "̱̻͉̳t̡͔y͈̦p̤͉̼e͔̞ͅ|̪͎̻̯h̩̟̻͎̱͇r̨̹̣̪͔ͅe̼͇͈̦̯̩͠f̖|̯͔̠̪̦͡h̛ei̫̼g̱̮̜͜h̤̰̤t̤̰|̸͙w̬̼ị̗̩̖̻͚d͍̙͝t͠h͓̯͎" ̩̖͔̭̞̟̱, ̭͜f̷̼͈̩̣̠u̕nc̳̥̲t͝i̱̤ͅo̝̱̝͖̰͕̗n̸͕͖̻͙͚ͅ(̵̳̝̦̬͉̞̙e, ̴̟̤̯̟̥̺t̻̞̦͚̘̳, ̻̲̰̫͔͡ṋ̙͙̖̭)̭͎̮̪̰ {
            ̶̠̬͍͉i̭̦̹f(̸̬̗̼!̧n̲̪̦̜̮͎̲)r͜e̱̗̺̰͘t̥͇͉̩̣ù̯ͅr͏͎̖̼n͏͕͈̠̼͇͔ ̴e.̳͈̺̣͕̦gḛ̤̝͜t̬̭͡ͅA̷̼̭̱̺̜̝̬t̷͇͕͚͙͍̖t̥͜r̖̗̙͡i̮͞b͖͔̯̀u̢̩̩̜̫͖̤ͅt̬͈͎͎̬e̛͎̪̦͍̯ͅ(̴̪̘t̛̤̹͉͖̫̙, ̩̫̠̣͍ "̠t̴̜͔̹͍͈ͅy̯̭̤̘̻͠p̪e̝̦͙̙̥" ͓͖̣͞ = ͚͓ = ̴ = ̣͉̠͡t͎̗.̶̝̯̞t̗̯͇̺͢o̬̥̥͎͝L̩̥̪͚͝o̖̖͚͘w̷̼̜̫͍e̗̤r̨Ca̧̠͓̘̫̟̫s̤̱̹̻̙e̫͔̬̗͠(̶̫͕̠)͓͖̥̼͈̠̗ ? ̘͇͡1̩̗̘͠ : ̮͟2͕͖̤̰)̦̬͓͔̥
        }
            ͕̤̗̱͕̬͡)͙̼̥̼̗̗ͅ,
        ̘̯̼̫͕d.̺̗̮͓͈͔ạ̖t͔̺͜t̜͈̺̞͓̩̺r̗̥i͈̯͉b̮̫̘̤͈ͅu̬t̘̱̯̼̦̰͉e͚͉̹̜ͅs̘͖̠̗ͅ & ̢̩̖͕̜͉̘͕ & ̹̝c̞è͍̫̼̖͚͇͇(f̺̲̜͖̥̥u͇̗̗̥̼̫̞n̬̣͕̯̦͍̝ct̖̱̥̦̟͈į͔̲͕̳on͖̘̫̭(̭e͈)̺͈ {
            ͉̠͈r̀e̦̞t̖̲̹̖̳͓ų̠̟̰̦̫r̴̼̫̯̦̥n̢̼̣̼͉͓ ̀e.̳̮̠͡i̮̭n͖̭̠͉͙̺̫n̥̥̰̻͓̭̳ẹ̪̰̣͈ͅͅr̵͈̟̥̘͍H̘̭̮͡ͅT͚͖͔̝̳̩̫͘M̪̲͙̯L̯͇ = ̢͈̥͉͚͉͔ "<̭̘͔̘͓͟i̴͖͙̞n͚̜̦͉̖̭̟͡p̜̜̥u̬̖̦̙̯̙͞t̮͠/≯̖͔͚̮͕" ̹̱̰̱̳͞,
            ̢̝͕̼͇͓̰̠e̵̹̘̘.͓̗̱͔̼̰f̷i̛͚̻̯̟̱̪r̲s̛̫̪̼̖̘͙̠t̵̬ͅC̩̜hi̡͓͉̤l̺d̘.̢̖̦̻̘̙s͕͍̲͈̱̤e̷̳̞͔ͅţ̤̰̯̖̜A͉̥̟̤̹̰̣t͇̰͙̦t̻̠͈̼r̖͍̻̮i͎b͔̘ͅu̟͙̱̰͎ͅț̫̦͚̬̜ẹ̥̲͜ͅ(͈̟ "ͅv͔͖̱͕͠a̮̺̹l͉̞̱̯̘u̶̲e̜̝͙̞̤̱͢" ͈̖̞̺͎, ҉̜̻̹ "̠̟̣̜" ̫͎̪͎),
            ̝̟͚ "̖̲͘" ̴ = ̦̖̪̤̯͍͢ = ̹̜̮͔͢ = ̩͍̭e̤͈̳.̛̱f͕͓ḭr̝̮̘̥͖̪̺s͔͞t͚̖͓͓̲͍̤C͔͍͡h̶͇̦̫i̠͇l̥͔̝̻͇͙͝d̖͖̟̤̙̤̝.̤͎̤̺̝͕g͖̖̞̗͖̗͚ḛ͕̖͇͓͇̺t̖̩͙̦̀A̛͔̘tt͖̟͉̱ṛ̷̱̱i̧̬͇͎b͍̲̝̘ut̸̩̣͙̮͇̭ḛ͉(̴ "̘̯̟̥v̱̘̣a̩͚̫͠l̵͙̳̥̟̙̺̠u͍͈̰̞̳͔͡e̠͕̦̟̪͖" ͈͇̼)̰̤̥̳
        }
            ̤)̶̰͚̬ | ̗̤̭ | ̖̬f͇̪̺͖͓̕e̱(̛̦ "҉̪ṿ̠͉̣̝̠͠a̜̠̦l̶͚̦̰̺͙̥u͔e͈̭̣̖̰͎̬͝" ̬͙̖̟͚, ̡̪̦̜̫̣̬f̙̬̰͉u̸͔̯̘̲n̡̻c̨̰̭̙̝̫̭t͔̤̬̞i̩̱o̩̳̱̣̗n̻͚͢(e̵̗̦̗̺̞̗͎, ̜͈̪t͉͙͍, ͚͔̱n̪̮̕)̶̭̲ {
            ͔̰̖į̙f͞(҉͓̻̘̤͈̩̪!̩͓̱̙n̨̦̤̲̭ & ̨̭̳̦ & ͙̗̜̮̼́ "̱͈ḭ̺͝n̞͇͘p͏̳̩̰u̪̺̦̗̥t̖͝" ̸̯̘̮ͅ = ̜̻͡ = ͎̰̰̹̙͚ͅ = ̬̮̬̳̮ͅe̸̗̜̹̪̥̭.̶̳͓͍̣̦̼͚n̵̜̯̦̦o̜̩̖̹̟̘d͔̣͎̹̦̼͉ḙ̪̘͜ͅN͙̰̫ą̺m͖͚̥̥̘͍e̞̼̯̦̮̦̯͞.̮̮̣͉͚̜t̳͞oL̯̼͖̘̝̬o̙̝w͇͎͕e̦̮̻̺̠͈rC͖̹̟a̸s̭̖͟e̩̮̬͔̘(̲͔̺̕)͏̜̖̘͙̬̜)̕ṟ̜͢e̶t̖̘̣̗͉͕ͅur͜n̜͍̠̖̭ͅ ̸̗̳̰͇̘̪̞e͖͈͖͍̬̝̬̕.̥͙̣̥̹͖͘d͔̭͍̮̰e͉͈͙̜͕̫̞f̦͔a̟͔̩͈̲ù̻̯̰̳ͅl̸̼̝t̡̹V̖͡ͅa̵̺̬̤͇̟̖l͈̰̕u̧̫̜̺̝e̶̹̺̲̼
        }
            ̳̫̻̩̯̥̲)̥,
        ̦͎̪͙c͓̰̱e̜͈̫(͉̹̭̘f̪͚un̨͎͎̮̜̩͓c̱̙̤͔̗͚t̙͔iͅo͚̘͉̯n(͚̮͙̫e)̛̪͔͕ {
            ̖̳͖̻̱͙r̛̮͙̲͍̹̠et̵u̯̘̮͟r̰̘n̛͍̖ ̳̖͓ͅn̷̗͚̞u̴̮̹͇͔̟l̡̝̬̣̺͓l̺̪̱̳͔ͅ = ͓͜ = ͖̹̟͖̝e̦̜͇.̫g͓̦̫̦ͅe̳̰̠t̛͓̦̺ͅA̻̰̣̗ͅt̰̦̺̦́ṯ̖͇̲̳̩͞r̳̮̹͔̠i̷̼͓̲ͅb̻ụ̤̼t̩̪̪̞̥̖e̜(̶̭̤̼ "̜̙̦̩̞̖̖d͙̲̝̣̯͈̫į͍͙͙s̟̳͈̼͉a̵̼̻̩b̸͇l̟̗̹e̡d̵̺͖" ̮)̩̲̺̝̻̼
        }
            ̗͙̩̟̭)̸͇͖̟͇ | ̖ | ̻̣f̣̠̘̫̤e̢͔̣̗̩̯ͅ(̲̤̣̖͉̲͜R̡, ͚f̞un͔͔̤̱̦̯͠c̲̩̘̬̼͟t̡͉͙̞̺ͅi̝͇̺̙̣̗o͈͇̜͖̲ͅn̶(̧̘̜e͍͕̠͚̭͘ͅͅ, ̦̹t̢, ͏̮̰̼̙n̗̭͚̼̟̞)̷̺ {
            ͖͙̲̰̤̟̠̕v̺̰͙͉ár̬͈̪̰͙̬ ͖̗̯͉̀r̶̻̩̝̻͙͈;
            ̬̜̤̞̺͚̮͝i̛̲͇̖̪̯̥f̧͈̺̤͙(̢͎̬!͙͎͖͙̰̩n͙̩͔̦͓͖͘ͅ)͔̯͎̼r͖͕̹ḙ̢̙͇͚tu̳̳̞͔r͈̺̻̗̤ǹ̥̞͉̹!͓̝͉̮̹͟ͅ0̮͔̝͓̠̮̕ = ͇̝̗̱̩͙̞ = ̧̰̦͔̺̙ = ̡̪͕̻e̲̳̻͉̣͜[̦̮̮̠̜t͓̖͙̖]̸̖̮ ? ̹̱̬t̷.̗̼̮to̥̱̬͓͝ͅLo̬̪͇͙̰w̞̳̰͙̦e̥̪̹͕̗͉͠r͎̘͓̟̭̞̱C̫a̧̱̜̖s̹̱̞̻̮e(̳̹͔̘)̮̟̤ : ̡̺̳̤̱̙(̺r̘͓̳̝̮ = ̲̜͙̹͖͕͡ͅe҉̘͖̟.̴͈͇̤̙͉̲̰g̦̱e̮͉t̤̳̫̙A͚̘̘t͇͔̩̝̤t͍̺̞r̸̥̤͙i̶͚̦̣b̲̗̩̹̭̳̀u̩̜̺̼͖̭̘t̡̲̭͖̣ͅe̤͖̝͚̗̗̭N̲͖̕o̱̖d҉͚̳͍͖̙̬e̢̼̙̹(̤͔̩̭̀t͎̀)̨͎̬̰̯̥̯͖)̤͎̪͇ & ̡ & ̧̩̮r̞̜.͓̤̩̫̺͘s̛p̨͉̠̭̜͈ͅḙ͈͙̥͖c͖̟̺͔̤͇i̷͓̫͓̮̱̰f̮̭̗̟͔͙̪iḙ̖ͅd̵ ? ҉̲̮͈͚̤̫r͟ͅ.̣̯͈̮v̟̟a̸̬l͕̙̝̜̱u̠͙̬̯̘ḛ̫̺͔̗̮ͅ : ҉̫̲̟̲̰nu͕l̦̪̜̙l̹͈̻̬̟
        }
            ̸̝͓̹̟̗͙)̝̮͎͓͙̱͖́,
        ͔͍̪s̻͜e
    }
    ̻͚͔̜̠͇̭(̼̭̣̳̬͓C̸͈͍)̗͈;
    ͉͟S͓̲͔.̧̞̭̼̜͔͔̹f̗̥̤̝i͍͚̩͍͍̞n̦̫̪d̴͓̫̯̥̘͈͍ = ͚̻ḍ̵͍͇̯̭̗̩,
    ̰͓̣̥͢S̪͚͠.͎̯̤͉e͔̩̮̯̳̖x̥͚p͢r̖̪͎̹̭̯͝ͅ = ̘̣̻̞͖̤̼d̯̭̯.̗̞͈̜̜̮̲s̝͙̙̲͈̼͜e̺̗̻̰̬l̢͖̞͉̫̬͈e҉c̙̜̰͍̥̘ͅt͔̯͕̰̰̞̀or͔̲͓ͅs̱̤͉̻͜,
    ͔͔̘̤̹̪͝S̠.̸̦͓̰̬̻e̘̻͢x͈̫͈͔̺p͈̻͝r[͏̬͕ ":̰̺͚̠" ̻̬̖̮̟͉̖]̶͔͔ = ̼̼S̗̣̣͍̠.̢̙ę̼͚̻̯͔x̦̹͈͔̠̥ͅp͉̯͔̟͇͘r̴͔̣̘̹.̩͎̣̫̼̫̬͢p̝s̳̩͍̗̹̘͔e̦̩͍̘̤u͏̘̝̥do͙̙̣̳̼s̰̪͈̟͈̳͎͜,
    ̳̟Ṣ̭͙̗̝͚͠.̢̜̘͓͉u̲͎̭͕̪͍̞n̬̳ḭ͈̘͇̺͖q͉͇u̯̦͉̯ͅe̘̙͇͔̺̹̞S̳͙͍̻̻̘͝o̧͎r͍̰̼͎͖̤t͕͙͚̪̻̠͡ = ͉̙̘̯͞Ș̡.̗̮u̬̼̩͚̞͍̺n̝̪͢i̡͔̬̤͖͙q̘̲̝͔̬̱u̻̬̯̪e̸͎ = ͖̠̣͖̝d.̙u̫̳͉̬̻͙͍̕ṇ̻͕͢i̴͖̯͙q̦̠̻̟u҉e̤͙̬̙̕S̶̗͔͉̻̠o͎͚r͚̗̲ṯ͚͇̩̼,
    ̵̭̹S̶̩̝̮̲̬̮ͅ.͙̮̘͉͉̮̫t̵̥͉e̺̜x̢̭t̨̙̺̟ = ̠̫d.̫g̶̣̺e̴͔͈͉͈ṭ̛̫T̨͉̲e͈x̖̻̺̺̥̗̫t͍̥̼̱͚̘̰,
    ̢͎̦͎̙̤S.̰͠i̤̙͞ͅsX̮̣̜̻M̸͖̳̪͔͈ͅL̺͈̻̖̠D̝̹́o̗̻͈c̟̖͔̼̟ = ̯̱̖̹̱̪d҉.̦i͍̲͕s̱͙̬͇͘X̷M͓͚͍͎̕L̪̙̱̹͢,
    ͙̫͉͉̟̀S͈.̯̣̦̯̘͇͘c̗̠̮̹̦̺͢o̘͇̮̪̬͎̠n̳̬̗̟t͉̘̮̘͉̲̤a̮̹̰̘͈͔i̺͜n̝͙̮̥̘s̯̘͍͕͕ = ̢̜̰͓̦͙d́.̖̹̳̤c̳͚o̝ǹ̪̱̮̹̯t̮̲̺á̼̱i̺̖͕̫̻̦̻͢ṇ͉̗̹̀s̟͎̜̭̺̘ͅ,
    ̼͙̳̲S.̷̘̲͖e̵̺͇͇̞̮̱̖s̰͚̭̩̼̦͠c͍̤̖a̹̹̩p͔͚̥͙͕ȩ̭͚̻̝̼̰̺S̕el̖e̟͖c͏̝̗͖̹͚̖̦t̖͙̬̤̳͓o̸̦̳͔͓̝r̬̦̣͎ = ̨̥̼̫̠d̬̼̦̮̩.̱̝̭̼̣͙̝e̤s̵̪͓̮c̻̞̥̞a͇p̜̯̦̺̲e̶̲̦͖͚̗̘̘;
    ̻͎̩͉̬͘v̦̪̰̭̣̼̦a̖̟̯̬̙͕͍r̜͍̬͇̥̥͚ ̷̪̤͚̗̰h̛̺ = ̜̙̞̝̣͎͜f͏̯͎ṵ̘͉̰̼͇n͏̹c͞t͘i̹͈̺̘̘o̧̥̘͍ͅͅn̙̪̯̥̳͉̪(e̠̼̻, ̘̙̤͢t̤, ̸͕ǹ̼͉̖̘)̭̱̣͓̞ {
        ̲̭̜͓͖̱͡v̗͔͈ͅḁ̵̞͍̝ͅr̰̼̮͎ͅ ̀r̨͖̤ = [̢̭]̖̠͔͈̯̞,
        i = ̠͎̟͞v̳͍͔oi͞d̟͉̫̗̰ͅ ̹0̧!͓ = ̫̟̜̞̱̯͢ͅ = ̴̲̫̠̯̭̯ͅn;
        w̳̞ͅhi͈̱l҉̻͔͍e̫̮͜(̯͈̳̗(̼̫e̼̘͍̥̩̥͖ = ͓͔̪̖̪̬e̠[͈̥̹̣̱t̹͎͖̝]͏̝͓̲͈)͙́ & ̼̺͖̘ & ̹̖̝̞9͉̹͉̮̤́!̧̖̯̬͎̺ͅ = ͓͎̥ = ̴̫͙̭͔e͢.̯͚n̨͔̭o͓͢d̺̞̘͓͖̖̯e̛T͚̞͠y̧̯̯̦̤̯̖p̪e̪̬͔̭̮̳̰͟)̗͕i̱͇̰̭f̪͍̼̯̼̹̳(̞̀1҉̗ = ̯̰̟͚ = ̖̹̞̩̝̜̹ = ̴͇̼͍̳̻͕ͅe̕.͏͖͚̻̮̭̝ͅn͉͕͝ò͇̣͚̞̖ḓ̶͔e̠̹͖͍Ty̛̼p̤͖͔̦͘e̠̞̘̤̩̩͕)̖͕͖̖̠͠ͅ {
            ̴̥͍̭i̲͇f̟͙̝̠͚(̱͚i & ̞̪̻̖͙͜ & ͏͓S̗͖̫̳͇̲̳(̰̮̜͙͇e͉̙)̡͈.͕̖̖is̢͙̥̺̭͈(̻͔̜͙͎̠n)̧̟̗)͉̝̣͈͞b̸͔̠̭̮̟̺r̖͠e҉̺͖a̪͝k̹͈̖͙;
            ̴̙͎r͏͉͕.̣p̙̟̭̺̘u̘̮͔̟̠̞s͖͇͍̝h̛(͖e̡̥͙)̜̟̮͕̰͠
        }
        ̗̮̤r͍̯͇̞̲̞͇é͓̮t̯͍̟̥u҉̼r̬̱͎̭̺̠̟n̙̗̗͡ r
    }
    ͙̦͓̥́,
    ̢͇̮T̴̫ = ̲̪͈̠͎f̗̼̬̯̰̳u̧̱̤̫̻͕n͇͜c̢͎̬t͈͡i̳̠͚͖̖̼o̗͖͎͇͓͖̟n̮̦(̝̦e̬̜̗͇, ̰̥̻́ṯ)̬̲́ {
        ̫̩f̷͔̼o̦̖͚̘r͖͖͍͘(̖̺̖́v̰̣̭͙͓̰̪a̖̱r̭ ̩̲̥͓̝̯̪͡n͏͙͎̮̪̩̹ = ̧̭̦[̴̰]̼̜̣̹̟͍; ̮͔̳e; ͕̗e̱̜̰̻̞̩͞ = ̘̼͔͙͔͓̙͜e̴̺.͈n̸̺̲̠̻é̲̥̰̭͓̮x̫͘t̬͙̘̩͜S̝í̲̱̼͎b̻̮̥li͇̭̪ng͙̮̫̩)̺̯̮1̼̼͙̝̦ = ͎̝̳͇̤̩̀ = ̬̼͙̀ = ̵͈͎̰̝͖̯͓ḙ͎̞͖̫̠.̦͍̠͖n̴̺͉̯̻o͍̳̻̼̩͕͞d̼͔͚e͏̮̹͖T͍̦̻͇yp̬̘̱̖͘e̴ & ̷̼͈̗ & e̱̙̝̮͇!̳͉̼͓̹̬̮ = ͓͇͜ = ̲̟t & ̮̼͕͚͈̤ & ̞̤̠͟n҉̬̣͕̺.͚͈͚̣̰̠͠p̭̲̣͕u̸̯͓̥̬͕s̪h̳͝(̺̥̗͚̠̻̤͡e̖̻̬̯̹̩)̝̦̮̬͉̙;
        ̧̭r̪e̢͙t҉̝̱̬͍̱͍̖u̡͍͈̙͇͉r̢͓̝n̷͍̥͔̞ ̰n̻̬̬͞
    }
    ̲̜̜̞̪͎ͅ,
    ̖͖̖͔̫k̛̮͔ = ̛̮S͖.̱̳͞e̘̼͚͇̻͈ͅxp͓̫̣r̴̟̝ͅ.̯m̺̭̘a͈͓̙̝t̳̼͞ć͕͉h͍̮͓.̡͙n̗̗e҉̲̩̜e̳͚͇̟̙ͅd̟͙̲͎sC̶̰͇̞͕̫͉o͕̖̮̣̣̯n̵̲̲t̙̺͍̯̩̻͟e̵̺͕̤̦x̹̟t;
    f͓̣̩̼̦u̠̠͟ṉ̟͓̞̝ͅç̖̭̟t̸̜͕̜̬̭͎i͠ǫn̵͉̤̗̳͈̪ͅ ̱̹̞A(̥̯͚e̡̲̯, ̱̜̮̣t̮͉̼̖͖)҉̜̖̞͚̟ {
        ҉r̲̟̗̼̮ęt̘͎͕ur̬̤̥͔͝ņ̰̬͚͔̜̝͖ ͇̟̤̰ͅͅe̪͍.̻̠n̘͚̲̱͎̕o̬̙̲d̟e͉̰̟͎̘ͅN̪̙͈͎am̯̝̟̜̘̰̕ͅe̵͕̞̯ & ͇̙̪̖̯̬ & ̧̣͉͍̤̭e.͟ǹ͓̣̤̖͎ͅo͖͙̻̣̕d̶̥̮̩̦̠̼e̛̩̤̤̤N̡a͔̞̥͡m̪͚͉̙͚͕͟e̙̝.̮̰͖t̯o̼̬̹͚͙̝L̺̼̲͇͎̻̙o̢͕ͅw̧͍̦̻̫̗̟e̺̣̝͉̩͖r͍̱͠C̜̠̮̫͉̠͢as̴͖̮̬͎̹͕͍ę̟̟(̹̙̳̹̪͉)͓͈ = ̗̩̣̹͍ = ̫̕ = ̼͙̩t͏.̤̠͓̞͚̣̘́ṭ͕̤̘̝͕̮o̧̖̝̱L̩̗͙̻͎̼̦o̦̦̘̖͉̰̫͝w̪̲̘erC̯͙̖̪͍̘̭a͈s̠̮̙̳̯͟e(҉̬̩)̨̺̪̞͓̳̜
    }
    ̦͚̜̲va̵r͔ ̫N = ҉̯̹̦̫̤ͅ / ̦̼̞̣̤ ^ ̭̩̠̦̦͍ͅ < ̙̜(̭̥[̳̠̝̖̝a̪̦̻̩̘͙̦ - ̫̪͕̰̮̝z̙̺̼̻͇̜͜]̫̯̳̤̳͉ͅ[̼͕̱̠̰͚̮ ^ ̳̩̫͡ \ ҉̥̘̻͎ / ̜̟̬ \ ͠0̱͖͓̞̮ > ̛̹: ͍͔̖̬͝ \ ̤̪x̭2̪͙0͝ \ ͖̞̺̘t̟̰̯̺̗ \ ̥͓͔̝r͇̼̘̹͍̖̝͘ \ n̵̲͔͇͎͖̹͓ \ ̡f̵͕͕̭͇ͅ]̨͓̭̦̬ * ͟)͙̘̻[̰̪̲̲ \ ͙̯͈̕x͈̭̜20̨̥̗̞̤͚̝ \ ̧t̶̞̯ͅ \ ̡̘͈̰͖͔̮r̦̪͖̦̖͉͚ \ ̪n̮̪ \ ̮̦͈̬͟f̪͝]̀ * ̲̬̟͔͢ͅ \ ̤͈͓ͅ / ̻̤͉̼̜͡ ? ͡ > ̤͚̼̼̖(̞͚ ?  : ̬͉̗̝̕ < ̘͈ \ ̛̩ / ͈̬̘̜ \ ͕͙͉̙͟1̻̘͎͙͙ > ̵ | ̠͔̙͖̤̼̟)$͍̤͚͝ / ͚͎͚͈͙̭i̷͓̪̳̗̹̜ͅ;
    ̘̝̥̱̠̣f͇̲̼̬̜u̼n҉͙̦̞c̱̻̩̭ț̖i̵͎̟̝̖̳o̧̞̻̟͉̯n̬̦̙̤͘ͅ ̙̣͚̳̘͎͢j̹͡(̷̫̹̺̱e̤̺̺̯̩ͅ, ̹̫̭̠̪͖͜ṇ͎̟͡, ̭̙r̰̲͖͙̫)̨͈̘̤ {
        ̤̰͉͇͙͇̲r̢̬̦͍͇͙ͅḛ͟ṯ̗͘u̶͚̞r̤͖̫̣̺͈n̟̟̩ ͖͚͔͢m̻̦̙̤̦̩͖(̥̹̜̪̮̤͍n)͖̪͞ ? ͍̭̭̫͇̤̗S̡͍̞̣̜̬͈.̢g̰̬͈̟̣̟͠ŗ̼̗̹̤̬̱͓e͖p͓̫͙̳̤̞̠͘(̴͙͖e͇̘̬͉̞, ͙͔̖̲͍̲ͅf̳̪̹̦ͅu̙n҉̭̹c͖͔͙̙̯̥t̰̀i̯͟o̭̲ͅn͚̲(̖͠ͅe̟, ̮̟̹̘͉t͎̞̩̫̰̀)̺̮̩̥ {
            ̵̟̤r̤̖e̠t̥͈̺̖͔̼̕u͈ͅr̦̱̜͕̺͜n͔͟ͅ!͖͍̻͉̲̻̦̀!̯n̝̗̫̜̠.̯c̰̳͎a̴̗̬̜̲͓̞̟l̤͈̮̲̱̤͡l̮̙̤̻̘(̣̝̱̫̼͟e̱, ̧̠t̹̖͙̞͚͙͢ͅ, ̼̥̗̙̳e̱̯͓͙̖̤̝)̙͔̹͕̜͟!̘̞̞͎ == ̞r͔̰̪
        }
            ̬)̵ : n̬̣.n̖͓͖͙̲o̫̰d̬e͓̠̗̩̯̙̺T̯̱̼̯͈͚̠y͍͎p̪͈̥̪̜̣̗͝e̤̭̥ ? ̫̲̺͇̀S͇̠.̪̭̦͈g̮̗̳̦͖͠r̜e̪̹p̨̜͙͇(̧̞̜e҉̞̲̝̟, ̯̬͚͙̲f͕u̲̭̫̥̩̩͜n͠c̴̪̺̫t̹̼͎͚̭̞̱i͉͈o̱̘̮̭̲̭̞͟n(̱̠̠e)̣͖͎͈ {
            ̩̥̼̼̥̦r̤͖͔̝͔̙̺e̜̥̼̘͉t̬͎̺͈͕̲u̘̞͚r̘̤̣̩̺̤͎n̮̙̗̤ ͡e͔̜ = ͖̘͡ = ̶ = ̦̼n̬̜!͎ = ̶̞͉͓͖̦͚ = ̜͕͓͚̦͢r̙̩̲̲
        }
            ͕̦͇̥͎̮)̜ : ̶ "̟͢s̘̩͖̩̰t̯̪̫͝r͏̱̤i͚̻n̶͔g̲͙̻͜" ͎!̻̫̭͖͕ͅ = t̛̥̱͔͔y̤͖̫͎͇̪̕p̠e̡͚̖o̜͈f̻ ̢̜̳̥̱͎͚ͅn̢ ? ̶͖̻̼ͅͅS̙̗͞ͅ.͏͉̥̠g̞̩͕re̹p̳͔͍(͓e̛̬̯̖̻̥ͅ, ̫̙̠͡f̲͚͍͡ú̩̹n̗̩̮c̠̩̹̥t͙i̫̟͓̮̞̳͚ǫ̘̗n̝̭̱̜(̳̥͉̳̩̲é̠̺̪̠̝͙)̟ͅ {
                ̮̀r͍̮̟̫̮͉̱e͎t̲̬̲̻͢u̴̹̹͖̬͖̠̳r̫͚̺͍n̕ - ̡̼̪̼̥̣͓1̝̫ < ̸̻i̻̠̭͖͖͔.͙c̩̭̰̖̙͎͈a͉͖̲̳̖̟̕l̵̰l͢(̦̮̻̱́ͅǹ̤̟̙ͅ, ̟̗̱̱̬͘e̴̻̯̠)̣̗͜ͅ!̵̪̲̗ = ̵͖̫͕̳͙̯ = ͘r̴͔͓̝̹͇̥
            }
                ͏̭͈̫̺)̫͎̜̲̰̳ : ̵S̤̮̫̫̪.̳͙͈͎̪̹̯f̪ͅį̦l̦̣̹t͔̥̯̠̲e̙̼̤͔͟r͍̗̪̮(̨̼͚͍̻n̪̤͉̗̻͚͠ͅ, ҉̤̣e̴̠̮̝, ̬̗̦̼̩̟͡r̪̦)̧̭
    }
    ͘S̳̰͇̺.̛̮͕f̵̜̙i҉͉̰l̜͉̩̗t̮̜er͇͚͙̤͘ = ͕ͅf͎͍̰̪̺͇̫u͓̻̮n̨͙͔͙͔c̳̞̣͟t̰̥̘io̮̖͉̪n̠̤̥͚̹(̲ę͕̤̞͙͖̼̮, ̱͎̗͓͖t̢̘͖̝̲̖̲͙, ̝͡n͉͚͔̭͍̹)͏ {
        ̰͕̞͖v̹̫a͈̩̮̞̠̕ͅr̫̪͍̮̰̜̱͘ ̀r͍̬̰̣̳ = t̰[0]̠̤̱̠͜;
        ͟r͓̲̦̭ͅet̰̺͉͇͠ųr͍̺̺̝ń̘̜͎ ̨̻̭̥̘ͅn̙̟̠͉ & ̹̻̗̬̼̙ & (̱̣͖̕ͅe̮ = ͕͍͓ "͍̞̯̬͢:̷n̶̼͇̮o̯̦͉ͅt͈̦̠(̹̩͍͕̻͔͟" ̧̬̦̖̦͎̙ + ̖é̫ + ͡ "̛͈͚̗̘͔̮͓)̫͕̙͎" ͈̥͎̺̪̳̞͠)͔̙͚̭,
        ͓̗͉̱̝1͎ͅ = ҉͓͎ = ͙̭͈̯͔ = ̰͉̘͕t̸̯̲̻͎̝̣̻.͢l͏͚̱͇̥͕͔e͔͖̱̣̬̕ǹ̫̩̬ģ̱̠̭̖̬̮̝t̛̯̺̰̲̙h͖̥̱̦͍͓ & ̙̰͓͍̗͎ & ̗̹ͅ1̤͟ = ͏̰ = ̫ = ̨̺̣̺̰̭̯r̸.̗n͔̤ơ̫̞d͍͚͓̖e͓̮̺͓̳̬̤͘T͏͉̞̟̦̠̭y̮̖̤̠̖͜ͅp̬͚̦̼̕e ? ̜̪̘͟S̼̻.͓̖f͓̺͙i͖̟͙̯̗͚͜ͅn̺̪̭͚d̪̲̩̥̭̞̜͢.̬̲m̵͎̬̲̩̳a̘̬̣̦t̹̝͎́ͅc͖̮̝͍̱͟h̻͕͇e̟͍̹ͅs͙̭̼S̺él̫͚̻̕ͅe̳͕c̹͍t̥̬͖̹͈̝́o҉̪̘̭̻͙͎r̵̗̞̭͈̯(͎͈̲̬̘͖̬r̳, ̯̺̫̝̣̗̀e̝̬) ? ͕̫̩̦̳͢[̺̗̰ͅṟ̘͈̬̲]̡̭ : ̛̱̣̣̦͚[̴͈̞̣̘̻]͚̳̟̹̻͔̥ : ҉S̯͓͇̺̹͘.̘f̶͎̩͉̖̖͈̠i̵͔ͅn̥̣͎̙d̢͔̝.͉͖̖m̲̞̺a̛̻̫̠ṯ̲̥̺ͅͅc̗̜̤͎̖̳̭͢h̹͉̩ͅes̹͓̜̺̕(̭ͅé͈̞̰͚, ͍̯̺͎̪͍̤S͓.̖̫͓͉g͚̙͍ŗ̱͎͍͔͍e̴̲̤̟̝̬p(̗̣͖t̵, f̥͠u͈̻̻͚n̯̹̺̤̙̟̯c̹̰̫ţ̭̺io̧̘̼̲͙̜̝n͙͘(̥̩͔̹͙e̟̭̮)̣͇̕ {
                    ͚̙ͅr͎̕ḙt̷͓̻͈͎̯u҉͓̦̭̜̘̘r̟̤n̨̳̤̮̩̱̩ ̤̙̼̲1̨ = ̯͖̭͉͉͇̱̀ = ̠͇̝ = ̻̪͖̥̘̦͘e̦͔̝͕̥̗̫͘.̶͙̰͖̳̼n̷͕͙̦o̷̳͓͚d̥͖̳̰e͖̹͘T͖͙̤̲͉y̛̥͙̥̗̱pe̱̜̱
                }
                    ͓̥̫)͓̹͠)̡̖̝͎̯͕
    }
    ̨͓̦̳̱,
    ̨̱̻̟͔S̲͚̱͙͕̥ͅ.̜͔͉̻f̮̰̦̝̯̳̰n̷̳̝͔̞̼̙̖.̼̻͝e̥̱͖̖͘ͅx̫̗t͕̹ͅe̲̞̕n̮̤͍d(̯͇̗ {
        ̵̼̦̹f̯̹̫̹̼͠i̢̺̬̖͔͖̜̹n͍͢d̘̮̻͓̲̱: ̲̗͕̯̩̼̣f̬͕̙͈͉͢ù̺̘͎n҉͕̦̤̗̮͉c̖̗ṯ͓͈̦i̶̭̖̜̗̜o̯̖̙͡n̖͠(̳͙̼̩͕͓͢e)̙̲̥̥̦͓ {
            ̜v͚̼͖͝a̖͈̫̥r̟̲̬̗̦ ̺̭͓̱͖͍͢ţ̰̤̹͓͇,
            ̜͖̼̼̰̥̞͢ṋ̷̜,
            r̫̼͈̯̯ = ̪̺͚͎͓̕t̸͓̲̰̥͕̫ͅh͚͍is̨̮̫̬͉͓̯.̸̤͉̞̣̝͕͖l̹̖e̦̩n̻̦̖̥̠̼͝g͙̰t̸̺h̻̹͍,
            ̝̱̳̦̘i͈̖̜̝̦͘ = ̱͙́t̰͎̕ͅḥ̕i̧s͕̻̳̝;
            ̰̘̬͔̹̳ͅḭ͈̯̟͚͕̕f̻̠̝͎̯͔̕(̢͙̗̺̗͇ "ś͈͕̫̟̫̩ͅt̯͍̲̰ri̜̲͚͇̭͕͟ng̴̼̰̫̫̯̯͍" ̪̤̜͜!͖͙̯ = ̭t̝͢ỳp̺͍̪e̬̤o͉̰̹͝f̠̜͍͎̪͟ ̼͙̘̳͕ͅe̥͖͉)̳̝̘re҉̰͎̞̙̣t͜u̥͓̼̖̠r̥̞͚͙̼͢ͅn̨ ͓̠̺͍͙̭̗̀t҉̜h̹͚͇͉i̥̜̗̣s͏̟̗̱͉͚̱.͜ṕ͍͇̼͕͙u̟̮̥̱͖s̳̞̹̫̪̺͟h̶͈̠S̝t͙͔̥̤͘à̯̣̱͔̰̣̰c̣̤k̦͎͍͍(̸̜S̷̜̼̗(̴̳͕̟e͞)̜̠.̪̀f̥̥͎̟͔̪͔i͇̜l̮͝t͔͕̣̭̱̟e҉͔̩̰̻̯r(̺̳̥̱͓̬ͅf̶̲u̬͍͡ͅͅn̠̱͕̭̜̺͍c̺͖̹͍͡ti̳̼͕̞̟o̷n̺̣(̝̪̭̦͎͘ͅ)̪̠̦͟ {
                    ̫̼̱̲̱̼́ͅf̹͉͇̦̯͍̙o̩̫̤͟r͇͢(̨̼̹t̲̪͙͚̹͈͞ͅ = ͉̮͖͉ͅ0̲̬̳ͅ; ̧̙̖͓̮̬̤͇t͏̭̹̙̫̬͇ < ͜r̟͓; ͇̩t͚̲ + ̸͍͔ + ̷̰̫)͏̺͈͔̟í̹̫̮̱̲̤̩f͖̞̹͇̳(̣̳̪̬̮̬̤S̞̥.͞ć̮̖̬͙͖o͈̬͕̥̜͜n̵̳t͉̣̺̦̼a̟͓̦̠i͔̺̳̥̰ͅǹ̰̻̟̹̜s̛͇̘̬̲̗͉̙(̶͕̣̫̝i̧[̣̮̗͈̘̫̗t͙̞̮͍]̭̗̜͓̩, ̡̻̼͖̼̙ṯ̱̹̭͎̗̭h̡͙i̷͉͓̩s͖͈̯̬͙͞)̺̣̠̦͙̼̀)̶r͏̣̠̹e̥t҉̖̗̺ur̤̺̖͕n̬͓ͅ!̘͚̻0̼͇͇̲
                }
                    ͎̲͇͉́)҉)ͅ;
            ͏̳̪͕̥͈̤̠for͏ͅ(̷̩̺̲n̖͍̣͚ = ̴̲̼t̤̩̳h͏̼̞̠̲̲̺̘i͓͙͕̦͖ș̷̝͈̖̗͕̠.̜p̨͎͈u͍͖̫̟̺s̢h͎̠̝̘̟ͅS̝̹͇͟ṯ͖̟͖̘̖͘ͅa͎̦̞͙̭c̥͢ķ̺͇̘͔̮͚(̜͙̖͙͙̹͡[̧̩͉]̢͓̯͈̬ͅ)̬͙̣̱̜ͅ, ͓͈ͅt̳̝ = ͙͞0̤ͅ; ̨̠͖̝t̴͚̣̗̱̠̗ < ̴̺͈̙͈r̫̦̲̗̠͇͠; t̗̻̫̥ + ̭̜̠͞ + ̱̩̗)͚͎̳̳S̰̱̖̩͘.̻f̧̞̝̯i͓ͅn̴̩̺̼̞ḓ̴(̡̦̠e͏, ͍̙̝̝͚̳́i̠̠̬[̠͎͉͙͜t̞̦̪̮̟̗͎], ̧̭͍̱͓͉͓̰n̡̲͎̺)͟;
            ͞r͇͕̭̪͈̼ͅe̟t̛̰̣̹ṳ̬̳͇̰r̲̱͈͕͎̙n̙̰̮ ͍̯̖̼͚͎͠1̧ < ̺̤͖̼̹͔͉̀r͏̝̦̮ ? ̞̜͇̳̠S̨͍̟̘̱.̴̤͇͙̯̹u҉͇̙̼͈n͔iqu̩̥̭͙e͍̥̞͝S̛̟̠o҉͕̹̩̺̳ͅr̳͉̥̣̗t̻̰͖̺͎(n̼̖̮̩̳̙ͅ)̦̱͇͡ : ̴n̲̩
        }
        ͙,
        ͖͞f͎̫͍͚̩̩i̱͖͙͈͡l̼̖̘͍̦t͙͔͉͎͚̳̫e͎̤̤̠͝r̟͈̗͟: ̲̰̰͔̦̫̀f̳͢u̢̥̪̗̯n͓̝ͅc̢̬̯͖t͇̯̞͉͕̱͡i̠o̸̪͚̜̗̭̳̗n͈(͕͍̣͝ͅe҉̣͙̖͙͇ͅ)҉͉͇̳̺̮͍̻ {
            ̧͖͎r͏e̺̲̻̥̫t̮͍̖̮u̫̟̥̝͢r̺͈̟n̝ ̦̲̘̠͞t͓͇̭h̖͔i̘̤s.̪p̛̹̙̺͖u͓͔͔͉̺͇s̸͚̞̻h̤̰̯̹͝ͅS̶̳̣̖̙̻̮̜t̬̳̫̗̕a̗͜c̶̪k̝͖(̨̖͚̤j̧̼(͏̻̮̯̝̰t̫̟͓͇̲h͎̲̮ḭ̵͇s̝͍, ̗̙͈̞e͇̩̟̫̞̠ | ̬ | ͍̕ͅ[̲͙̣̗̥]̮̣̖͕̝̮͠, ̣̳̱͍̙ͅ!1͇̦͢)̥̘̙͔̲)
        }
        ̡̯̲̩͍̩̰̖,
        ̡͙n̨̝͍̱̠͇o̜̯̤̥t̶: ̥͇͈͈f̯̝̻̱̥̦u͚ṋc̶̮̞̜̪̹̦t̢i͙̩͕̳͕̱͜o̤̥̬̮̙n(͇̤̲e)̹̠͘ {
            ̦r̝̹̘̮̬e͕̰̩̹̭t͙̹̹̼̦̟͉u̱̘̰̫̖̠͍r̜̭͓n҉̝̝̳̜̭ ̯̻̱t̘͖̦͞h̗i̝s͚͍̠̫.̰̥̺͓͝ͅp͙̙̹̙̝ṷ̴̪͈͍̥̞ś̤̫͖͖ͅh̸͎̻͇̘S̤̣̙̫͇̺̪̕t̴͇̼̹̠a҉̗̹̥̳ͅc͕̥͈̭̰͘k͏̳̜̰͈̟(͘j̘͖̰̙̹̯(҉̹̲̮̤̗͓̜t͏h̥is̷̫̤͔͇̩̝, ̠̼̖̯e̷̻̥̮̲ | ̯̯͓͕ | ͎̪̲̫̝͚͟[̼̬͈̯ͅ]̙̟̻, ̢̜͚͉͙!̣͍0̸̹̺͍̯͇͔)̦̟̜)̦͚͘
        }
        ̱̭,
        ̫͚ḭ͓̪̺͟ͅs̸̞̘̞͎̟: ͔̗̺̕f̠͕͕̠ͅu̱̝̖͉n̝̺c̼͕̲̼t̤̖̞̯i͓̺̻͢o̷͖̮̦ṇ͇͕͍̯͟ͅ(̫e̬)̷̲͖͎̘̝̪̝ {
            ͓r̯̫͚̤͖̟ͅe͏͓̬̥̮͓t͏̱͙u̕rṉ̴!̹͇̪̺̜͍ͅ!̨̦̯j͈͚͍̖͓(͉̣͇͙̙̩͠t̥̝h̟̕is̠͕͢, ͖͕̩̫͔́ͅ "̟̱̮͙s̻̫̮̦͠t̸̩̙̮͔r̫̭i̵̭̞̟̘n̡̜̼g̴̬̗" ̴͍̯͔̗̣̬ = ̦ = t̸̘̥̙̣̤̱̻ý̻͚̜̖̤ͅpe̟͚͍̠̼͕̯o̶̘͇̖̘͚̮f͉̹̗͙͇̻ ̻̯̻̮͙̳̹͝e̱ & ̗͈ & ̱͕̖͖̱̝k͇̘̙̬̹̼̺.̫t͔̮͓̺ḛ̳͕̮̫̰͜s̡̙̝͎͈̥t̥̰̭̦͔ͅ(e͈̳͇͍̬͈͟)̱̱͕̬ ? ̡͉̦̮ͅS̟̗͍͜(͕̯̱̠̯e̖̲)͈̘̻̦̞͖͢ : ̤̩̙e̢̻̙̦̤̥̝̝ || ̼̣̪̬̹͟[̻̭̱̞̜͙ͅ]̤, ͖͖͕̥͓͈͘!̻̩̖̥͉͜1͚͍̙̠̻̝͝)̮̮̝͢.̮l̘̺̥̤ḙn̞̖̤̯̫g͙̯̻̜̩͟t͇̫̯͔͙͝h̟̳͚͙͉
        }
        ̙̫̝
    }
        ̢̰̪͙̥̖͕̻)̘;
    ̣̲̮̮̻̬v͏̗̮̳a҉̮͓r̹ ̗̞̠̙̞̘̯D̨̖,
    ̠̤̬̻q͈̣͎̳͇͝ = ̴̖͓̬̮̩ / ̧̩̼̺ ^ ͔̹̪̟͔̥͓(̻͈̙ ?  :  \ ̙͚͉͇s̭̭̮͙̬ * ̖̳̺(̠̗͎̘ͅ < ͉[̗̝ \ ̯̥͠w̤̰̮ \ ̸̙͖̪̰ͅW]͇̻̞ + ̪̺̘͎̣̜͓ > ̢̟̪̺)̩͕̙̺̺[̴͚̺̲ ^ ́ > ̲̼̺]̺̻̱ * ̴͔ | ̬̣́ͅ # ҉(͚̫̣[ \ ̣̲̬͕̦̼w - ̶̮]̦͔̝̘̥̥̮ + ̗̞)̸̪͍̺͎̰)͏̱̹̹͚̪͈̮$̺̭̯̠̺ / ̲;
    ̻̺(̩͔̞ͅS̤̜͉̙.̟̙̤̪̣̜̪f̱͞n̺̼.͖̼̪̝̫ͅḭ̲̳̮͙ṋ̼͙̮͉͎͜i̭̱̞̻͔̞ͅț̳ = ͇̪fun̺̝̻̠͔̟͘ͅc͎t͔̺̗̦͚̭ͅi̥͈̮̠̩̲̖o̖̻͍͇̻͇̰ņ̠̣̝͈̭(̠̱̟͕̦͢e͍̲̜͉, ̢͉̫͚͙͇̠ṭ̟͞, ̶̲ṋ͓̪̝̫̖)͚̟̪̰͓ͅ {
            ̡v̮̜̦̺̳a̭ͅr̰͍̙͠ ͙̙́r͏,
            ̨͖i̳;
            ̷i̼̘͎̜̞f̮͉̱̮͇̱̗(̗̰̭̣̀!̖̠͖͈̤͍e̡̩̰̣)̺̫̬͎r̘͔̲̗̥̳e̼̙̲͈̠̹t͈̹̲̳̩͈͚ṵr̝͕̥̙͕̗n̟̻ ̼̰̫̝̪̯̥t̵h͈̙͙̤̝̼̀i̗͍̪̩͇s̠̦̼̝̼ͅ;
            ̙͚͓͠if(̹͟n̛̘̣͎͎̠͎ͅ = ̫͙n̴͈̺̪̝ | ҉̻͉̭̯̣ͅ | ̖͉̞͉̺̥ͅD̵͍̝̩̬̫̖, ̯̺ "̨̝͎̤s̱̝͚̠t̫͚̤̭͓̞r̪͍i̼͔̲͇̻͇͢ṋ͟g̴͓̣" ̫͈̻͢ͅ = ̴ = t̰͎̙̦̹͔y̷̖̤̗ͅp̶e̩͓͈̘̗͍͘of̲̹̼̦̠̤̺ ̫̻͖̥͔͜ͅe)̞̱͈̜̺͢ {
                ̞͕̣̕i̧̩͕̬̫̳ͅf(̶̮̼͇̣̦ͅ!̜̙͘(̝̥̙̠ͅr̙̗̙̜͡ = ̶̘̟ "̳̜<͠" ͎̫̣̘̹̫͈ = ̟̫͙̥͍̳̝ == ̜̟̬̗̝̙ͅè̩͚̥̖[̱̗͕0̰͜]̠͙͙̩̞̖̀ & ͇̮͍̥̻̺̟ & ̵̞̠̩̠͔ "̤͎̰>͞" ̢͓ = ̥̪̳̘̭̳̞ == ̲͖̦͎e͉̥̬̖͉̤̟[̻̱͙͔̫͈̠e̸̖̲͎.͔̼l̺̼͓͔ͅe̶͚͚͕ͅͅn̢ͅg̲͉̗͎̖̩͈t̙͕͕͢ḫ͙̙͙̝̩ - ̬̖͕̟̹͚̦1̬͍̞͍̼̤]̢̩̝͙̪͇͔͉ & ̥̹̱͍̫̱͕ & ̩3͉̳͉ < ̨̘̻͎̼͍̘̯ = ̸̞͖̺ẹ̝̙͍̘.̯̻͇̝͞l͜e͎̗̥̪n̵͙̗͓̲̻̦g̶̥t̼͓̠̫̭̕h͇̩͍̖̳ ? ̵[̝n̳̙͙̮̦͚̕u̧̞̱̰̖̼l̺͍̝̘̪̠͕l, ̢͙̙̭͚̻̝ͅe̟, ̀ńu̳l͇̱̠͓̙̫͘l͟]̯̺ : ̲̺q̮̥͙͍̟.́e҉x̡̦̪̘̲͕e͕̥̬͚͢ͅc͎(͇e̮̣̤̺̞͔)͏̥͚̩)̦̩ | ̛̪̝ | ̶͈͖̞̬!͔̫̻̖̞̞r̺̤̦̝̪̤͢[̪̖̳͕̯͉ͅ1͎̘͖͈̤̘]͏̗̞̪̤͔̠ & ͍̼ & ̤ͅt̛)̳̠͍̟̺̭ŕ̼̘̖̱̪ę̪͓͓̺̙̩t̹̠̟̲̥͈̘u͈r̥̳͙n!̧̰͔̹̬̻̖̘t̼̤̳̲͝ | ̱ | ͜t͕̮̤͍.̪̺j̸̼͔͓̯͕̬q̀u̲̯̭̗̝e̥r͇̖͖̼̯̗͉y̲̱̼̜̝̜ ? ̭(̙̖t̰̬̘̜ | ͓ | ̧̦͉n)̹͉̣.҉̜̟͕͈f͎̜͉̠̟̙͚i̢͕͉n̙̱̝̤̦d̷̪͍̱͉̥̖͎(̜̺e̝̫̻̺)͍͍̦̠̖ : ͙ͅt̙̭̜͕̩͠h̛͎̮̹ḭ̯̠͎͜s̭̦͍̱.̶̙͉͚̣̙͙ͅc͈̬̠̠͈͢o̪͖̤̘͇͞ns̳̹̹̼͟t̰̀r͚̲̮͚̦̱̪͡u̡͙͔͕ͅc͍͚͍țor͠(̭͎t̡̲͎̠̞̺͉̙)̹͎͈̩.̰̟͇f̱̙͍͖̜̼i̲͙̯͉̭̘̟n̵d̸͔̬̭̟͈̥(͎̮͔͚͉̼ẹ̹̖̠)̨̱̣;
                ̦i̠̝̤̹̙̯̘͝f͇̮̱̳͉(҉r͎͙̝̭͔͉̗͢[̝͍͜1̶]̯̦̠̤̥͘)͔͉̰͠ {
                    ͚͎̘͕̠͍͇͝i҉͚͖̰̘̺̯f̫ͅ(̩̘ṯ͎̭͔̠͞ = ̳̜t̢͙͇̩̩͎̱͚ ̻͖͕i̞͇̳̰͈n̥͕̺̩̰̱s̷͚͉̥͉̺̭t̯͚͈a͙̗n͉̮̥̻͚͓̦c̗̞ę̠̤̪͕o̬̖̩̩f̱̙̖ S ? ͚͕t[̷͓̘̩͓0̝͝]͏̘ : ̳̱͇̞͚͚̟͠t, ҉͈̯͇̫͈̘̘S̸̗̠̤̙̩̹̹.̹͕̺̪m̜̟͇e̢̖r̫̠̩͉̳g͖̰̬͖̬͎ͅeͅ(̩̥̤̬̥̯ͅt̠̘̰͉̦̩͞ͅḩ̬͍̞̩i̙s͍͙̼͞, ̙̮̤̤̺͖́S̟̼̣̗̕.̰̹̲̝͙͡p͓̜̭̰̦̦͢a͏r̨̯̠̬̜̜̯s͖̠̝̣̠͔̖eH͏͇̩̹̠T̳M̴̙̻̳L͙̩̮͔̯̪̮(̫̼r͚̳͙͉̩̙̠[̹͇̗̦̰͈͜1̘̬̼̫̘̯͚͘]̠͇͔̩, ͔̬͔t̻͎̭̰̭ͅ & ̦̫̘͉̻ & ͓͍̥͚ͅt͚̱̲̜̰̗̗.̼̦n̻̳͖o̭̤̞ḑeT̷̠̺̥̮͙y͓̫̜͕̰p̮̪e҉̮͍ ? ͕̖̻̬̝̘t.̸o̟̙̬̬͉wn̶̤͉͖͍̗̮͉e̳͈͎͓̫̰̥͜r̫͚̠͙͉̝͉D͎͓͎̹̠͈o̹̖͖͓̩̼c̖͔͚̝͟u̯͈̙͙̫m̧̫͎̹e̯͚̳̦̖̖̘n̛̫͍t̸͕̮͙͙̺̠ | ̗̻̘̩ | ͕̣̟̫̥̲͕t̗̞͙̞̝ : ̻̞̥̺͇̲ͅE̱̱̤̟̣̲͘, ̪̘͚!͎0̣̺̦̹)͔̹)̤̝͖͍̪͟, ̷̻N̙͎̜̩͟.̴̙͇̩t̥ͅe͉̳͙̫̥̭̕ͅs͠t͔͉͇̱̣͉(̮̮̮r̹̺̰[̗̻͇̺͖̻1̥͎͕͉]̖)͚̳̲̤̼͓ & ́ & ̰S̬̪̝͙̦.͕̟̖̻̼̫̺i̴̭̠͎̲s͈͙P̢̗̹̩̳̖l̩̳̻̠̜͞a͉̜̟̳̩͠ị͕͙̘͇̼͟n̗͜O̸̬̥̣͖͈b͉̝̯̥̫ͅj̰̥͇̰͟ͅe̱̮̼̳c̛t̗̻̥̙͔̙(̼̪͡t͔̰̻̙̥́)͈̩)͉̗f̘̯o̶̳̱r̪̜̪̲̖̙̗(̺͓̦r͙͕ ̥i̯̲̯̮̰n̵̯ ̩̠̱t͜)͞m̺͈̘̦ͅ(̵̜͚t͖̩͎̦̕h̰̜̻̠̗̰̜i̫s̢̰͚̤̣͍͚̲[͏̦̣̹r̞̩͔ͅ]̖̬̣̼̗̪͞)͓̻̝͚̺̙͍ ? ̗͓̞͕͜t̡͔̠͓̟̩̗h͔ḭ͎̙̳͢s[҉̗̬r̵̝]̞͖͇͉̯̣̦(̺͔͓̪͝t̹͉͎̻̤[̬̼̠̮̞ͅr͏͖]̬͎̺͉)͚̮͖̘̻̝ͅ : ̡̣̼̲t̳̞ḩ̱̹̳̩̘̫ͅị̵̮͚̰̜̠s͇̜.͎̮͕͖̘̗̬a̗̱͙t̹̟̭̗̹̪̙t̠̳͉̥̰̻̬ṟ̬(̞̱̞̯r̳̣͇̟̳̰, ̩̭̼̗̜̀ͅt̺͍͍͎̤̰̖͠[̴̹̘͈̯̻ṛ]͞)̗̥͎;
                    r͉̲̻̱e͠tu̮̱̪r̠̯̬n̦̣͍͙ͅ ̱͞t̩̯̙̲͎̪h̫͙͇̩i̩ͅs̡̻͈̝̙ͅ
                }
                ̨͕̳͉̳̹r̤͎͖ȩ̲̠̙̘̤t̩͈̗u͘r͜n͡(̤̹͢i̜̖͙̯̤̣̥ = ̨͎E̪̜͘.͏̟̟͙̰͓̮̦g̨̱̞̗e̻t̰̯̰̳̝̥͘E̮̮ļ̹eme͏̺̩n̷̹̭̗͚t͙͈̮͕̘B̗͍̩y̝̲̺I̥̟̭͚͙̕d҉̯͍(̶̠͕r̤̠̞̯͍͘[̵͓͍̗̲̺2̦]̷̤͈̙̣)̢̳̬͉)̧̠ & ̫̥͘ & ̭(̻͚̤̗̪̣ͅt͚̖̕h̴͓̣i͔̘̟͠s͉̝͍͓̳[̷̻̫̯̭0̲̥̭̼͞]̸͔̼̖͈͕̪ = ̧͎̲i̧͔̘̗̭͙͈͙, ̸̩̜̲̱̱t̛͕̖̠̱͓͙̯h̘͖̠̙i̘͕̙̬͇s͚͉̺.͓̝͢l͔͓͎̭̪̮͘e̩̫͚ṇ̙͔͈̺̘g͍ͅt͏h̲̼͓ͅ = ͙̪͓̼1)̢̞͔̫̻̳̹͙,
                ̖̺͟tͅh̩i̱̘̯͢s̢͈̺̹̥ͅ
            }
            ͏̦̖͍ṟ̗̝̼e̪̙͓͉̗̟ͅțu͏rn ͇̝̯̳̻ͅe̳͕.̻̫̺̞n͙͈͝o̡̠d͍̝̦͎̦͝e̮͙͚̳T͖͍̰̀y͕̗͈̻̜͜p͓̩̺͉̼̭͞e̥̹̖͎͉͉͔͠ ? ̤̤̖̘̯̪͢(̨t̙̼̯͕͙h̥͞i̥̰͎̺͔s̨̺̮̺̻̻̝[̯̲͖̹̠͉̰́0̳̕]͎͖͖͎̝̙ = ̝̰̱̹e̱̜̙̲̦̖͘, ̤̫͖̬͢t̛̻̹̗̩͖h̺̩̠̠i͇̺̺̟̗̞s̡͙̬̞̖.̜̮l͚̪̻̯͔̟̥ḙ̶͇͍̯n͍̲̠̜g͕͎͈̣̖̬͞ͅt̪͈̲̱͓͚h̛̼ = ̶͕̠̱͇̺̞ͅ1̹̙, ̫̖͔̻̼͚͠t͖̘̖h̗̹̖͈̲͓̥i̯̠̳͔̝̟̙s̳̻̮̱̪̠͘)̶̤̞͎̝̦̭̥ : ̴m̞̹̫̤̦̙͕͞(̢͚̲̲͖̼̫̫e̬͜)҉̹̟̰̹͕̮ ? ̧̼̭v̶o̠͈͍̞̠̫͔͠įd͖̺ ̷͈̣̲͈̖͇0̯̺!̨͕̰̝͔͔͍̦ = ̴͇̖͙͕̰̲ = ̲͙̘̟̺͇͢n̴̹̹̲̣.̣̣̗̼̞̖r͔̫e̡̙̹̫̰̯a̲d͕͎̟͙͇̺͝y̥͉͇ ? ̤̰͉̤n̥̠̞͉.̪̻͘r̨e̪̺̪̳̝̼a̞d̸y̻̩̠̣̘̜̜͜(̰̼e͓̖͙͈̞)̧͙̬͔͎ : ͕̺̱̯͔͍e̟̠͢(S̸̹̮̞̙̦)̢̭̭̱̺ : ̴̰̙̮̝̰̗S̠̳͟ͅ.҉m͕͍͡á͎kę̲͖̘͎̼A͉̣͡r̵͕r̪̱̮a͏̳̣̥̦̺̱y̨͇̠̰͚͓(̥̦͚͉͇͇e͍̫͚̗̯͟, ̼̭̼t̨̤̪̩̪h͉͎͖͚̣̟͜is̛̻͕̬̟͙̥)̬
        })͖̗̯.̷p̗̰̜̭̭r̲͓̻o̗̟̤͞t͏ò̘̥̣̹͓͖̗t̜̣̟̮y̦̗̼̦̕p̧͈e͏̩ = ͉̦̼̖͝S.̻̱͚̭̜̟f̝̘̞̺̭n҉̭͕̭̠͕̖,
    ̟D̳̬͎̟̥͠ = ̬S͍͖̞̟͓̮̮(͓̬̰͖̮E̛͈̪)͜;
    ̩̕v̦̬͉̩͝a͜r̬̖ ͞L̴͎̙̜̪ = ̩͙̲̙ / ͓̱̠͓̝̦͠ ^ ͏̩(̥͓͚̯ ? ̧͎̙̬̠̣̹̹ : ̡̮̩̣͚̤̩̗p͓̠̯̳a̴̜̩͔̠̮r͏̭̦̯̟̠ͅe̵͎̮͔ͅn̻̞̭̫͉͍͎t̪͍̳͈ͅs̤̝ | ͇͓̘͡p҉̳̯̰͎͚re̼̥ͅv͔̟̬̰̻(̠ ? ̴̼͎̖ : ̯̝͔̳̘͝U̲̝͉͍̠nt̳͢i̱͟l̷̺̤̠͍͇͇̗ | ͉͓̼̬A̪̮͙̲̜̪l̗̹̝̜̣l̷̺̺͚̫̥))̷̰̥̪̞͈̳͕ / ̻̟͜,
    ͔͎̟̳̹H͉̮̜ = ̰͉̲̹ {
        ͏͉c̨̝̦͎̞͎̦̣h̦̗̦̖i͈̦̙l҉d̺̀ŕ̳̻̭̲̦̹̱e̡͍̺̮n͚̪͍̘̕: ̨̙̜̮̲̙̜͔!̼̮͔0̬̙̞̻̬͙,
        ̣̯̗͔͚͡ͅc͚̫̹̩͘o̷̬̜͎͎̰͓ͅn̜̩̜͇t͇e̼̰n̙̯̝̼̰͞ţs̀: ̥͚̯̱̲̀!̷͎͔͈̟̰̞0̠̣̱̻,
        ͍͇͓̫͍̹͇n͏̲ḙ̱̲̺x̝̪͈̩ͅt̫̜͉͚̀: ̛͎̟͔͔!̜̬̼̼̺͠0̢͕̭,
        ̡̣̘̻̗ͅͅpr̷͓̪̖̖e̡v: ̵!̟0҉̯̦̞̦̱̙
    }
    ̵͔̤̼̻̙̪̺;
    ̴̻̣͖f̜̥̥̱̤u̲̖n̝̫̟͘c͚̼̖̲̥̱͓t̸̳i̦̘̰̞͢o̵̘̜n̦̲͎̞̭͞ O͓̫̯͍ͅ(͉̥͕͔͍͎͎e̴͇̜̖̭, ̬͓͖̫͖̘t̼̥̩̥̬)͇͖͚̻͎̺̤ {
        w̶̞̩̫̫̯h̖̰̝̰̥̻͝í̟̭l̩̲ẹ(̵͈̼̞̩̣͓(̰̱͡e̲͈͕̖̦ = ͚̘̼̻e̱[͙̟̤̮t҉̱̲̮̹̩]͍̼̼͘)͖͇̦̮͢ & ̝͉̮͟ & ̲̮̝̮͙̼͉̀1̠!͙̲ = ̬̖̝͖̳̻͝ = ̷͓e͔̙͖͎͍ͅ.͏͇̭̞n̟̺͢o҉̫̩̘̫d͙e͈T̥̙̩͉y̨̜̭̙̣̼̟pḛ̠)̡͖̻̩̥;
        ͇͚r̢̩̲͓̫e̝̙t̫̞ͅͅu̘͓̥̩̺͎̩͞rn͖̲̬̤̲ ̺̝̩̖e̱͈͖̤̘̯̲
    }
    ̩͖͚S̹̹͓̲.̘̤̲f͢n͚̼̘͕͕.͍͜ḙ̣͍̞͡x͙̦̙͖t̴̗̞͚̫̺̠e͢n̴̖̜͚͓d̰͚̯͎͓̮͇͟(̟̲̟̻͔̥̀ {
        ̯̙̙͕̬̳h͔͙̕a̷͚s̸̫: ̞̘͎͉͢f̺̳͙u͚̜͎̯͚̲͡n̫͍̺̙͎̠͟c̨̫͙̱̮̩t̼̲í̺o̲n̡̜͙͇͎̥̖̣(͍e̝͞)͚͙͈̥ {
            ̘̼̞v̢̠͓̦͉̤a̖̤r͉̲̬̖̜̮͕͡ ̣͉͉̠̦̻t̡̜ = ̬̝S̸̝̙͚(͙̻͚̝̱̩e̪̺̜, ҉̠̙̪̣͕ͅt̸h͓̣̳̲̟͉ͅi̳͕̜͞s͍)̫̗́,
            ̧͍̖̱͕̲̩n͢ = ̰̣͓͔̮̬͚t̛̪͚͉.l̶e͕͈̦̫͡n̮̱͜g̳t̴̟͈̣̱̫͓h̫̘̳͖̙͢ͅ;
            r̢̲ę̯̻̳ț͉͎̱ù̬̺̰̮ͅr̤n̢̘ ̘th͉͘ị̹͎̦̠͉͜s̼̻͈̳.̤͎̰͠f͓͙ͅi̧̥̟l̶͚͕t̲͟e̗̩͕̟͟r̫͈͇̲(ͅf̯͇̠͓̳ͅun͝c͈̭̮̖̗͓t҉̗̖io̖͇͈̮͇̬̱͘n̢̪͎̼(͍̟͍̼̗͔̫͘)̪̥̮ {
                ̢͔̟f̻̮̻͇o̲͔͚̬̣̩̮r̡̼(v̤̠͍͍͇̦͠ͅa̞̭̮̻̥r̕ ̶e̜̯̠̘̗͖̝͟ = 0̣̦; ̞͈̯̟̮̯̞́e͉̹̫̝͘ < ̝̣̰̲͇͍͙n̪͔͇̳̖; ͍̟̼̠̩͎͟e̩̯͝ + ͖̲͖̠̰ + ̣̪̤̠̩̻̲)̶̙i͟f̗(͍̺͉̟͠S̠͜.̶͚c̗͖͖͠ón̨͚͕̩̱͖t̰a̛̹̱i̗n̖̳̳̯̞͍s̲͞(̲̼̜̺̳̟t̛̻̘̙ḩ̺̖͙̯ḭ̗̺͎̞͡s͍̮͚̩, ̫̲̗̦̀t̮̫̗͇͚̭[͙̻̞̣̹e̹̻]͔͔͚͞))͖̝̘̘r̟͚̝̣̞e̥͝t̘̣̹͔̰͖u̢̗̲̬̭̻̖r͚̼̫͡n̫̘͚!0̹͉͢
            })҉̫̗̤̝
        }
        ̖̬͓̖̱,
        ̞̝͢c̩͜l̥̦̼̹͉̼͎o̝͚͎̹͍͓s͎̮͔͎̟̤̕e̛̼̜̮s̬̝̘̺͈͖t͔̩͔̦̗͉̦: f̻̺̫̱͙u͍̩̣̟n̥̘͎̯͞ͅc̯̮͖͕̦̩͝t̹i̭̱̻̲̟͡o͔͇͖̘͙n̤͖͎͚̰(̫̱̻e̲̝͔ͅ, ̦̪̟̰͠t̗̠̲)̪̮̞̕ {
            ̥̝͠ͅv̜̣͙ͅḁ͍͇̘͓̼͉͞r̙ ́n̸͙̪̟̥̙̻̫,
            ̺̟͎̞̘̠̝r͇͔͕̼͖̦ = ͕̫͇̠0̥̤ͅ,
            ͓i̸͙͖̖̹̹̻ = ̫͙̫̗͈͇͢ṯ̸̯̯̖̠h̥̺̙͍̗͢i̶̮̲̘s̤̞̲̖̠̙̱.̵̩l̢̯̙̟̬̼̗̦e̘̺ṉ̖͔̙̘͎͎g̙t̘͖̲̣͟h̠͇͇̖̲͙̗͟,
            ̫̳̲̬̪̭͈o̷̳̻ = ͉̭̦̫[̧̭͇]́,
            ͇̤͎͇͓ͅa = ̡̝͍̳̳͙ "̮s̙̞̘͔̗̥̺̀t͎͍͎̦̻͜r̥̬͙í̮̠̥̤̪n̶g̷͎" ̷̪̻̬̯̖!̞̪͙̝ = ̕t̹͕̹͙y̡̺̫̦̹p̳̩͖͘ͅe̸̮̘͕̩o̦̗̪͎͚f͕͖̤͍͓̭ ̗̪̯̫ȩ͉͎̲̖̦ & ̪͎̘̹̙͔ & ̷̘̦̼S̡͕̬(̯̣̖̫̩e̙)̧̠͓̖̰̘;
            ҉i̝͈̘̯͎̠͠f̥͖̜̠(̜̖̙̩͙͝!̫̖̞̦̘k̠͕̫̼͎.̤̮̬̰͢ͅt̡͎̻͖̪es͎̺͈̝̦̕ͅt̸̟̦̠̦̮̦ͅ(̞̯̰͖̜̩̖e̦̥̖͕̗̗̦)̦)̛f̶̻̲͚̜ò̰͖̺̠̟r̺͉͜(̜͙̩̯͉̀; ̙͓͎̖r̼ < ̪͇̫̮i̺̲̭̫͘; ̵̰̜͙r̰͍ + ̩̜̣ + )̰͓͙̲̗͚f͈̳̺̪̼͠o̳̫̤̬̱̞̟̕r̳̗͙(̶̠͉͎̟͕͈n̸̙̱͚ = ̸̤͎̻̝̟t͏̗̬͚̱͉ͅh͚̯̦͇͞i̵̩̼̳̞s̭̫̬̻[̦͇r͘]͈̲; ̨̺̖̲̯̭ṇ͎̠͔͖̱͞ & ̫͜ & ̙̣̖̝͉̖n͍̹͇͉!̭͕̲̭͉̟̪ = ̵̝̠̭̯͈ = ̛͍̼ṭ̱̹͚̯͍͟; ̷ͅn̷͎͇̲̬̝ = ̭͈̘̙́n̺.̠̯̟͍̹͓́p͞a͔̹̠̗̘r̀e̥ͅn̜͔̟̗͖̦t͓̖̬N̬̺͙̬ơ͖d̵̫̖̘ḛ̲͓̕)̩̕i͙̼͞f͓̺̼͉̠(̯͇̮̳̹̞n͚͙̗̟.̺͘ͅǹ̦͍̲̻̯̥ó͇̺̗d͈̼̪̲̞̮͔͟e̮̗̣̫̪Ṭ̀y̧̦p͔̣ḛ̰̗͈̺̲̯ < ̦̠̬̤̝͎1̫͕̥̀1̨̳͎̣̮͚ & ̯̣̩̱̞ͅ & ̟(̷ą̬̹̫̹͍ ? -ͅ1̷͔ < ̧͈̩̬̜̹a̧.̺͖͕̭́i͔͉͉̻n̗d̤̤͢e̯͠x̯̼̜̘͔͓͎(̧̟̲͈͍n̶̥͕̱͉̮͓)̡̪͓ : ̝͈̰͖̜͔̱͞1̘ = ̮̦͍̞͠ = ̹ = ̬͙̲̺͕̫̲n͉̲̪̖͓.̰̣̝͟n̶͎̦̮̫ọ̗͓d̰̱̼e̴T͖̗̰̮̖̲̹y̱p̤̟̳e̫̳ & ̺̗ & ̴̤͔̻̫̞̩S̴̱.̢̰̦̜̰̲͕f̷̘͈i͇n̛͙d͓̜͎.m̛̫͓̻a̱͎̦̰t̖̪̤̠̥̕c̙̙̬̝h̟͚͈̮es̲̱̫͖̺͝Ś̪̭͍e̪̗̩̣̗̥l̩̜̦͉e̵͍̻͙̮͎̳c̤̱̖t͓o̦̰̭̳̤͞ṟ̡̞̩̠(͏̟̖͕̺̠n͙͔, ̷͙̼̗e̺͕̻̩͉)̟)͙̼̦͔͚̩)̘̤̤͕͇͢ {
                o̩͖.̤̤͔͎p̯̹̗͞ͅͅu͉͉s͓̱͕̩̰̥̹ḩ͍͚̤̻̙̫͓(̹̘͈̥̥͓n͖̥͉̗̞̩̥)̪͈͍̮;
                ̼̥̜͔͞br̘͈̱͈͇̬̖e̦̲̠͍̱a̶̳͙̮̬̝̤k̯
            }
            ̱̺̘͍͙͉r̬̭͈̝̺͎̝̕et̢̜̱͍̺͙̯̺u͇͔͖͘ͅr̮̥̫͓̲̱̯n̦̭̦ ͏̭͚t̹͕h̼̬͕͍is̱̙͇̭̝̝.̻̙͙͔̳͎͚p̴̟u̠͕shSt̵͍͓a̭̙̲̹̻̮c̻̬̠͓̫̣̝k͕(̴1̶̰ < ͕͚o͕̟̯͈͇̖̥.͖̤̼̞l̟̝͕e̘͞n̷gt̩͚͓̱̤̖̀h̶̘͉̳̘̲̹ͅ ? ̬̣S͙͔̲̀.̜̝̹̤̪̩̱́u̙̲n̺̹̙͈i̸͈̥̝̦̰͔͉q͖͔̜̙͖̰̯u͕͔̱̣͎̝͖e̴̦S̳͚̟̹͠o͔̤̙̜̠̫ͅr̦̗̖t͍̜̙̱̺͜(͔̝̙̙̺̯͍o͖̥͕̘̝)̨̹̲̰̳̪ͅ : ̗̞͙̻͔̯̳o̝̼̪̻ͅ)̠
        },
        ̸̺̦ͅi̧̯ǹd̗͠ex̦̘͈̘̮: ͚̱͍̣̺f̡̦̬͚͍̠̯̰u͓̙̫͈̰̪n҉c̸̺̘̟̩t͖͡i̡̖̩̩̫͙̮̘o̟͍̳ͅn͈̩̣͢(̢͚ͅͅe̟͓̦̱ͅ)̤͓̮͚̗̱͈ {
            ̣͔r̰̼͎̱̺͍̳e̠͇̰̻̦̥ͅt͚͕̯̝͕̯ur̭̣̰n̗̕ ̙͖̼̕ȩ̘̪͙ ? ̬̼̺̖͔͝ "҉̝̜͙͔̮͕̭s͟t̻̮̱͉͖̠r͟i̦̘n̻̠͉̺̮̫̜g̞͙̪̥̜" ̰͖͕̦̳͕ = ̻ = ̫̰̜̦͟ͅt̞̳̳y̝̯p͙e̻̘̞̬̤̕o̤f̴̥̯ ̟̗̬̗̼̠̩́e͕͘ ? ̼̺̟͇̯͞i͟.͈̠c̘̺͈̟̗̼̺a̼̦ll(̗̜̣͍S̭̖̭̀(̮͜e̝̘͍͍̠̯)͝, ̱ͅt̳̖͍̲̬͎͞h̴͕̳i͏͈̞̩̮̟̯͎s̭̩̮[̝͖̭̗̠0͈͓͎])̣̭ : ̮̩̳i̦.͉͕͈͇̝͟c̲a̫̫͖͕̝ll̲͍͍̜̜͎͢(̱̣̖̝̬̩͘t̴̖h͔̜͕͍̳͇͍͘ḭ͍s̮, ̹̤͟e̻.͔̯̥͇̦͍̯j̢̫̻̘̜q͠u͏e͓̟͈̤̥̻ͅr̘͔̭̗͔͢y̪ ? ͈̘͉̗̳e̲̙̠̗͈̜[̵̯̦͔͉̣ͅ0͘]̴̦͉ͅ : ̲ͅe̵)̺̬͎̗ : ̷̪̟͚̗t͖̯͚h̞͈̳̖͍̺i̡͉̯s͕͓͖̫̜̯̥[̯̯͖̹̘̀0͚̳]̱̙̩͜ & ̼͇̣̝̭ & ̳͔̗̲t̳͈͕̖̠̲̪h͇̘̪i̪̙͙͢s̷̖̭̜̪̠̲̻[0͙̞̟]̞̻̝̠.̱̜̘̮̤ͅp̛̫̜̪͓̠̬̥a̲͕̰͔̳̪ͅr̰̣̮̤̩̪͞e̙̬̹̝̪ṇ̲̘̦͕͈t̤̠̩͓͖̻̞N̵̰̤̞̘̣͙o̞̰̤̻ͅd̗̼̜͖̣͖͈e̶̮͈͈ ? ͈̠͇̼͉͢t̮͉͙͉h̪̻͚̥̀i͉̤̗̞̘̗̕s̭̟̦̥̘̬̩͜.̦̱͔̯͞f̞͉̱̻̩ị̖̙ͅr͕̝s̻̳͕̗̮͠t(̧̥̞͍)̠͙̭̤̝̟͝.̺̺̭̯p̡̪r̫e̟̟͎͈̯͖v҉͔͎͉͍ͅAl͙l̮(̰͙̣̦̩̫)͔̤͚̰̀.̞̝l̘͇̱̞͚̤͎e͉͖̰͕̘̹n̠̬̦̳̲g͈̪̘̻̝̹͞t̞͎̩h͎̮ : ̪̥̞ͅ - ̺1̶̻̙̳̥͚
        }
        ̛͙̣̫̥ͅ,
        ̧̰ạ̯̭̼̟͔̙ḏ̸̘̙̲ͅd͖́: ͔̠͙̺̘̩̖͜f̖̝̫̗̰u̘̼̹̼͈͉̜n̶̺c͔̜̝͇̪͝t̖͖͓͍͚̩̮͞i̗̙̱̯̼̻o̖̬͍n͏(̴͓̺̳̘̪e͎̼͈̲̜͚, ͈̳̖͍̥͝t̰̼̥̝̝̠̞)̵͕͉͓͚͚͔ {
            ͚̝̘̘̦̥̀ͅr̺͍͕e̬̲̤͚̻̪͠t̼̻̖̜u͚̻̯r̲̞̣͉̬n̢̬̘͈̮͇ t̩̹̗̝̤h̥̱̞͎̗ͅi̡͖̪͍s.̛p̷̬u̬̤͔͜ṣ̨h͚͔͔̭͜ͅS̝͡t̖a͙̙̬̘̟͜c͈͖̼͡k̹̪̘̩͔̟͖(̝̲͉͟S̮.̟u̞͡n̙̦͍ḭ͇̩͙q͍͕̥̩͉ụ͔̝̭e͏͕̥̜͉̦S҉̹̭͍̬̗͚o̹͉̖̙̟̤͞r̶̼̦͎̗̤̯ț͕̺(̧͖̗̯̺̼̬S̝̕.̶̦̘̻̲ṃ̪̀e̬̤̞̭̭r̞g̥ę͚̬͍̠(̪̖̥̰̺̮t͕̖̙̯ͅẖ̠̻i̦̱̱͍͜ͅs̠̞͉̗ͅ.g҉̯e̝̤̺͎̹͓̦t̩(̲͍̫̼̪̮̘)͓̜̭͓̗̹̻, S̖̱̖͓͔(͍e̺̬̼̗͎ͅ, ̺͓t̷̫̘̦̪͖̫̞))̖̖̹̲̠ͅ))̶̬̳̼̪̲͙
        }
        ̀,
        ͍̞̕a҉d҉̞d̘B̥̳̪̥͙͈͚ḁ̶̠̙̜̰c̸̼̰͉k͎͙̱͜: ̸̥̣̯͕̜̼fu͙͖̘̻n̫͉̹̩͈̖͍c̺͉̹̘̗͎t͟i̸͇̝ó̼̞n̫(́e͉̺̩̥͚̭)͕̹͈͕̳͔͔͢ {
            ̶̠͙̜͕̟̻̺r̵͍e̯̺t̩͍͎u͎͔̲͎r̴͙͙͎n̴̳̮̻̯̘ ͍͕̝̝̻̮t̤̪̜h̳̬̱ͅi͟ͅs̩̥̰͎.̷͓̣̱̖̗ͅa̶̲̼̦d̠͔̺͢d͎̣̕(̡̟̠͙͔̪͍̻n̦̦ͅú̘͎͓͙l̷̼͕͙̳̜ĺ̼̫̳̻͓̻̥ = ̢͉͚̪͙ = ̪̖̝̭̯̻͝e̘̫ ? ͖̪̭͎̙ṱ͇̩̩̪̻h͙͚̬͈̣̞͡i͚̱̞̖̬̜̭͞s҉͖.̫̘͔͖̦̀p̤̳̥̬͜r̶̥e̛̻̱̞v͎O̵b̴̤͓j̣̞̜̹̕ec̴̱̲̯̲̠̲͚t̘̘͎̩͞ : ̳̪̪͙͔͚͝t͎̘̥̦̹͡hi̮͚̖̖̥̗͖͜s҉̩̤.̸̯̠ͅp͓͕r͢é̪͇̭̯̳͔̫v̝̤́Ọb̗̮j̴e̤̰ct̻̫̺̙̭.҉͕̙f̡̟̯̦̜ilt̰͔̻͕̦͞ͅe̙͓̭ͅr͇͈̳̯̤̻̖(̹̳͙͈̳̖̻ẹ̣͇̺̺̜͝ͅ)̩̙͙̲͕̹͠)̠
        }
        ̞͔͡
    }
        ̴)̝̠͕̫,
    ̡̬̗͚̺̥ͅS͚̺̹̭.҉̖̪e͞a̮̮̟͎c̖͚̝̭h̼͙(̻ {
        ̩͎͡p̫̩̥a͓̰͍̪̰̮r̵̹̱̭̠ȩn̡̖̲͚̹̭t̞̬̣̖͟: ͎͉͙̯̝f̯̖͔̩́u͓̦̜̕ń̻c͇̬̣̳t̙͖͕͍̰̭ͅi̢͉ͅo̦̼̫̻̮n̢̼̝̦̺̻̙(̟͈͙̲̼͝ͅe̤̜̻͇͎̥)͍̹́ {
            ͕̪v̘͚͓̟̣͉͘a̳̜͞r̰̪̪͍̮ ̙̼͔̟͟t̰̘̝̲̜̼̀ = ̖̥e͠.̘̰͔͓̱͖̰͢p̢̩̖̪͉ͅar̢͈̜̣̠̗̗̮e͕̙̤͘n̯̮̜̤͙̻͎t̯̗̺N͔̰o̝̠͓̝̹d̬̮͍e̗͓̤̺͓̪̺;
            ̪͚̫̭̤̹̖r̥̣̙͕̘̗͓͟e̝͇̘̣̠ͅt͇͍̹̱ͅur̠͖͔n̢̺̬̲̱̼ ͏̫̫̱̫̝t͚͎̫͇ & ̤̦̕ & ̴̺1͕͎͉1̖!̳̲̞ = ̹̹͚͈͔͉ = ̺̘t̩̻̜.̖͕̲̝̹͉ņ̭͔̪o̻̩̳͇̙d̸͓̣̪͓̰̳ͅe͈̝̝̠̗̳͠T̳̠͈̝y͖p̵͚e̲̯̪̹̥̙͓ ? ̳͈̪͚̝͜t҉ : ̭̣̯͙̹ͅn̬͓̘ͅu͎̭ll̯̩͉͈̪
        }
        ̤̦̲̜̼͡,
        ̱̘̫̮̀p̹a͏̦̤͖̰̤̙̣r̳e̖̗ͅn͎̞̤͝ţ̰͚͕͍͇͇͇s̥̹͖͕͔̱: ̲̻͕ͅf̙̦̺̣ṷ̲̹͓n̜̝̠̳ct̫i̸̟̠̠̭o̖͔͎͓̹̮n̲(̝̞͇̟e͏̯͓)̨͔͚̰͇͇̮ {
            ̨̭͍͍̱͖͔r̴̻è̩t̜͚u͔̦͘r̷n҉ͅ ̤̦̱̹h̙̘͎(e̤̘, ̣̰̦̱͡ "̙͔̱̰͘p̭̝͍a͉̫̬̦̪r̘̹̱̼̩̙ḛ̼̞̤͔n̬̥̝t̻̳̲̜̠̬̀N͇̭̭̮̩o͔̘̞̳̺̼d͖͙̲̦͇͡é͚̟̫͓̘̥" ̷̻̲̪)҉̼̖̖
        }
        ̻͙̥̳̝,
        ̪̦p͓̙̬̘̘͈̞a̢̞̺̘r͚̥͠e̠̞͔̭̪͍n̢̞̮̟̳͍̯̫t̯̘̜̤͔̥̙s͙̠̞U͔̬̤̞͇ņ̞̣t̘̭i͇͔̺l͉̯͞: ҉̱̼͖͎̜͙̩f̩̰u̸n̟̰̬c̶͚̬̹̣̮ͅt̩̼̹̟i̛̥̼̥̤o̧̞̪̼̙̘ṉ͇͍̱̝̰̙(̞͕͖̻̫͡e͚̩̬, ̙͙̼̯̞̠̺t͏͍̻͓̼̩̱, ҉͇͓͈̜̮̣n̩̙̞͎)͈̰ {
            ̱̖̘ṟe̡̩̗̥t͎͔̝̞̤̞́ú͓͎̬r̦̻n͓̦͓̬͠ ͈͉̞͚͙h͡(͈̺͎̬̳̙͖e̵͔̘͕͓̩͎, ̢͖͎ "̸̤p̼͎̩a͈̙̖͚r͍̩̝͝e̲̪̲̻̝n̸͙̱͓̼̰t͙̬̙̯͇̝̟N͍̞̜̜̼̯̯͟o̹d̦̜̻͈̭̦e̦͟" ̡̥̲, ͓̥͕͢n̹̗͈͉̕ͅͅ)͈͖
        }
        ̨͙̳͖,
        ̗̘̻̦̣n͇͈̤͉̟͞e̡͕̤̦x̩t͍͚̜̯̞̳͉: ̘f͍͍̖̝̤͎͘u̧͙̪n̻̪͎̠̳c̸̲̳͇̭̙̞t̸͚͕i̮̬̫̦̹̦͚͠on̝̖̣͈͔(̤͇͇͕͇͉͘e̩)̡͈̬̝̪͕͍ {
            ̫̝̻̞ṛe͍̗̪͈t̪̦̜̥̪͉u̗̘͕̪̮r̴̟̣̖̥̮͈ṉ͎̤̞͜ ̬O̖͓̣(̙̲̜̺e̷, "͏̹̩͔̰͈ͅn̝͔̻͚̘̖ͅè͚͙͇x̯̥tŚ̪͇͍̣ͅi̭̬̠̮͇̼b̧͖̪̩̥ͅl̟̰̰͙͓i̹͈̯n̸̞̝̦̰̭g̹͎̙̟̜̺" ̮̻)̥͙̜̖͓̟
        }
        ̷̺͚̺̬,
        pr̖̦e̦͔͙̳v҉̤͍̰̭̝̬͙: ̡͔̳͚̥f͍̯̪͟u̻̮͔͚̘̕n̲̼̗̻͝ͅc͎̺͚͈̭͖t̵͈̗i̮͍̫̲o҉͔̦̳n̻̮(̠͕̪̖̠̀e̝͈̦͓̘̣̤)͍͔ {
            ̫͖r̴̖̤ͅe̫̞̩t̠̦̱̭͝u̢̠̬̬͚̝r҉̦͇̦ṋ͎̝͚̜̳̺ ̢̹̞͓̮͖̮O̰͝(̗̤̱̳̮̪ẹ̵, ̼̼ "pr̦̫͕̣̠e͠v̱̹̬̤̩̱i̻̠̹͈ó̭͍̲͇̣̞ú͍͙̺̝s͖͉͓̯̱Si̦͓͇͘b̴l͙̠̠͖̱͇͔ìn̶͙g͈̙̣̕" ̯̜)
        },
        ̴̪n͕̲̪͍ex̜͝t̝͘A̘̙ͅl̹l̝͙̥̗͔̦͎̕: ̻͈̞f̬̟͕u͠ǹ̬̥̠͙͕͈̝c͎̼͔͉̙͞t̀i̭̣͓̮̞̺͢o͉̲̼n̷̠(̛͔̝e̮͇͡)͏͇̹̗̫̮̪ {
            ͙͙͈͖̳͈̣͞r͢e͔͔t̩̝̙̳͕u̘̞̲̣̫͡r͕͖͠n̲̹̟͈͈͈̼ ̧h̼̙(͏͓̺̖̬͈e͉̖̭̣͟, ̼̳̻̪͔ͅͅ "̦̫̘͇̕n͕e̤x̸̦̼t̺͈̮̟Śi̖̖̞̳̹b̫̯ͅĺ̰͓̬͔͇i̛̠̘̳̜͔ǹ̬g͕͎̱͞" ͘)͔
        }
        ̩̻̼̦̱,
        ̢̬̱pr̟̖̟͞e͚̝͔̣͓v͎͈̰͡A̹̮̟͖̠l͇͓l͇̱͓̠̝ͅ: ͇̮̼͉͢f̟̞̤̖u̹͖̭̝̺͓̜͟n̤̠̩͍͕̪̟͞c̹̜̭̰t҉̦̥̥̯̙͔̻i̷̳̟̗o͚̤͎̝̳n̴͙̗͎̠̤̠(̠͎͉̼͙͙̙͞ḙ̩̕)̪̜̝͈̖̫̀ {
            ̢̲̣͕r̡͍͔e̳̯t̠̹̺̩̲͉͖u̦̖̤̙r͉n̵̤̟̫͓̬ ̞ḩ̱̘͕̖̙̟(̮̰e̖̱̕ͅ, ̲͕̹͚ "p̷̟̘͚̗̪̥̫r͕͞e̠͖̝̺̗͍v̴͈̹̫͚̼̯ͅi̙̦̥̦̥͜o̹us̟͔̪̤̥͕̬̕S̢i̲̻͙̦ͅb͖̼̣̲ͅl̮͔͎̺i͙̱̣̠n͓͘g̻̬" ̩͕̤̙)̳̣͕
        }
        ̨͍,
        ̬̯̠̘n̤e̲̮xt̯͡U̠͇̘͇n̷͕͇̗t̶̟̘͍͓͚̱i̻ḷ̲̼: ̩͖̞̘̱͠f̶͈̦̪͖u̩̲͙͓n̹̬̼c̻̯̝̥͓̭͚͞t͈̠̜̲͓̠̦͝ì͚ͅo̷̝̦n̸̙(̦̭e̛̻̰, ͕̫͝t͏͔̦̰̭̥̣, ͎͔̮̤n̺̰̪̖)̨̯̙̠̥̖̱̩ {
            ͘r̗̦e̱̟̘̞ͅt̠́u̳̩r̝n̖̟̼͉̙͓͈͞ ̝̖̖̞͖̫͓ḫ̝̥̯̞͓̥(̬͟e̹̜͝, ̲̝̗͉̞͕͝ "n͕̮̱͚èx͚̺̙̲t̩̫̞̪͇Si̶͇͔b̙̬̳͓͚̩ĺ̼i̷͖͈̗n̺̖g̢͕͖͎̦" ̱̖̻̞̳͠, ͖n̺̼)͓͙̥ͅ
        }
        ̢̣̯ͅ,
        ̪͔p̨r̝̪̱͓͓͓e͈̭v̛̻̣U̸̮̩̩̻n̯̩̩͎͖ͅt̠̟͕͚͙̼̰i͓̱̪̹̥l̨̗: ͎̟͓̞̟f̻u̜͓nc͕̦̯̫͍̬̞͜t̡̻ͅͅi̯̤o̵̻̤̣n̴̹̳͍(̠͕e̡͉͙̺̫͉̠͇, ̢t, ͙͎͓͕̘͕n̳)͇̻̪̼͚͓̳ {
            ̟̩͚͝r̯͙̲̝e͕̗̲̜̜̼t̬͖͎̞̗u̱͕̯̜̰͘ͅr̰͈̭̪̱n̸̪͓̻̳ͅ ̘͈͍̝͓̲͢h͇͉͕̭̯(̖̠̤͈͕̲̀e͉͚̹, ̢̮̱̪ "̭͖̩̩p̩͔͖͖r̼͔͖̬̼̻ͅḙ̴̱̜v͉̞̤̹̞͞ͅi̦̗̹ͅo̸͙̤̺̟̭u͖̫͘s̬͖͕̩͉͇Si͇̯̜̣̗b҉li̷͚n̟̦̩͇̰̭͙g̜͙" ̷͕̺͍̣͙ͅ, ͎̞̮̜͔̖̹n̰͍̤̖̭̰)҉̠̲
        }
        ̵̖,
        s̰̱̝͚̦̩i̷̞͙̭͚̫͍b̳͖̤͞l҉̟͉͔̣̟ͅi̥̦͎̦n͢g͈̣̯͉̮̝͝s̭͘ͅ: ͍̹f͚̟͝u͕̙̫̤ͅn̖̞͙͎͕c̦͓̯͕̰̺t͖͍̜̲̬i̦̼̦͎ò̦̥n(ḛ̛̳ͅ)̖̗̙̫ {
            r҉̠e̻̺̹̖͔̝ͅt͓̀u͓̱̦̦̲͖̪rn͖͙̤ ͚͚̺͓̮̺̺Ţ̮(͓̬̺̗͍̜͝(̸̺e̮̠̭.̬̮̤͇̳̪p̵͎̮͔̗̥͉a̛̗͖̖̤͚r̫͖̜̱̗͕͔e̝͚̬̹̙̼͢ǹ͉tͅN͞o̹͚̯͕̱͔ͅd̦̱̝͘è͔̗̣͈ͅ | ̵͇̙̤̮͍̦̱ | ̙͇̣͢ {
                    ̢
                }
                    ͚͍͚̣̪̥͝ͅ)̘͕̣̹̻.͚͖̫̣̱͚͈͡f̴̲̫̙i͍̻̲͉̥͢r͈̫̦̕s̛̝̭t̶͔͚̘ͅC̟̬͖̭̙̜h̻͕͟ͅi̯̳͈̘̦ͅl̙̝̺̮̫͢d҉͈̹̟, ̕e̱̭̭̯ͅ)͚̦̟̼
        }
        ̼,
        ̖̺͓̮͢c̳̻̯̝h̯̳i̦͘l̶̹̰d͍̪̻r̵e̜̱̠̟̹n̞̪̥̲̠͘: ͏͚̬f̢͕̥͙̩̲u̶ͅͅn̡͕͕ć̠̗t̵̮̤̦̟̺̲̭i̬̝̼o̖̩̯̤n̹̫̮̞̘(̨̫͙e̼) {
            ͟r̤͍̻̜̲̯et͕͎͈̼̝́ͅu͢r͙̝͕͖n̥̭̺̫̣ͅ ̝̰̠͉̻T̺̼̻(҉̼̮̱̤e̵̬͙̣͉̪.͈̹̪̞͓f̼̰͖͈͍i̻͎̰̗r͈̙st͏̤̩͇̟̝̯͔C͚̩ͅh̞̬͍̖͖i̺̻͓̣̜̕l͈͝ͅd̻̪̠̭̙ͅ)͕̮̜
        }
        ̯͇̤͎̞̩,
        ̰c̥̖͎̯o̰̮̳̞̹̫n͇t͠ḛ̶̻̝̪̙n̲̻͓̰̲̪t͍s̭̩: ̴̜͉͉̰ͅf̡̫u̳͕̩̬̣͟n̖͇ͅc̛̜̪̦ͅt̢͉i̝o̗̦̗͕̻ͅn͓̭̻̘͖͇ͅ(͏ḛ̘)̵ {
            ̢̪̠r̲̩̹͓̹ͅe҉̫̝̺̰̣̲ͅt̳ur͍̮̥̳͕͞n͈͕̳̤ ̧̖n̩̣͙͙̗u̺̦̮̺͈l̥͓l̰̰͖̠͝!̧̤ = ̳e̻͉.̨̦̠̘c͕o͇n̷t̗͍̳e͏͎̹̠̳̤͉n̟̯͞t͏D͎͔̙̬o̷c̩ṳ͚̤̣̘ͅm̹͉͉̗̗̹e͚n̯̳̭̙͔t̝͔̘͞ & ̬̳ & ̰̫r͓͓̘͕̰̻(̸̤͍̻̟͕̩è̮̰͓̖̮.͏̫c̰̳͕̺͚̝o̧͔n̪̱̤̩̤̟͝ṱ̫̣̺͎e̝n͚͉̫͍̦͈͞t̡͔̪̜D̯̭̜̭̫̮́o̹̯̪̬̳̞c̻̞͕̲̟̗̘͝ú̠̠m͇̗̕ę̥̳̱͉̼̘n̟͔͈̱̻t̼ͅ)̯̭̠̥ ? ̛͙̯͙͉e̱̫͞.̬̲͚͎̦̼̥c̬͠o̗̱̭̮n̘̼̭͎̱͢t̗̼̲̦̜̦͘e̵̬͈͈̯̖͎̺n̲̣̬̞ͅt̯̻̭̗̝͝ͅͅD̸͍̳͕̞ơc̗̠͍̼̪̦̼̕ụ̺̲̱̳̜̭m̨̳̼͍̫͕͖e̹͕̜͇̹n̫t̝͞ : ̷͇̦̻͚̟(̙̰A͘(͈̱͈͚̟̙̘́e̵͍̦̝̜, ̱̹͈̥̝͈ "͉̠̥̺t̺̹͍̝e͜m̺̬̱̥p̹͇̰l̶̝̖͉͈̗̟̦a͉̦͓ț̗͖̮ͅe")̸̪̭̤͕̹ & ҉̣ & (̠̹͙͖͓̻ͅe = ̻̫͔͔͉̩͟e̖̺̠͎̦͢ͅ.̱̪c̡͔̼̦̝̣o̺̙͔͈͖̕n̲̦͈̙͓̱t̢e̼̤̟n͉̯̻̟t̥̟̭ | ͍͘ | ̪̲̩̖͉̫͘e)̀, ̠̟͚̤͘ͅS̤̭̥̦͇.m̞e̳͢rg̗͕̳e̶͖(͇̭̪[̙̖͔̗̰͖̭], ̪͎e̗͎̳̖̦̣̕.̘̩̺̱̭͢c͏̮̟̥̞̺h͇̝̩̲͖͞i̸̪̻ld̖͍N̡͈̭͇͓o̟̟̤͖͝d͖̳e̛̩͖̠͔ͅs̟͖̫̭͓͚̕)̤̩̖̼̜͚̮͢)̪̭̜͞
        }
        ̘̤̗͎̞̕
    }
        ̫͔, ̛̘̲f̴̩͍̗̩̯͚u̪̼͈̖̰̣n̩̤̘c͉͓̘͇͡t͇͕i̟͞on̝̠͎(̺̗r͔͝, ̡̲͇͖̯̥̺ͅi̱̖ͅ)͍̦͟ {
        ̙̺͇̖S͕͕͙̝͎ͅ.҉͎̯f̧̬̬͚n̹̯̤̫̞͡[̬̰r̳̼]͖͇͚̟͇͖ͅ = ̢̟f̜̻̬̹̩u͙͍̠͈̥n̤̞̣͉c̵̝̮t̤i̼͓̮̻ơ̻̹n̥̤̤̣͡(̱̱͡ẹ̯̫̼, t͏̺̜)̛̳̝͚̜̻͎ {
            ̜͇̝v͜a̸͈̳r͢ ͙͖̠͇̼̮͝n̸͙̟ = ҉͙͙͕̬͕S̸̹̯͔̩̹.͏̹̩̠͙͕̖̳m̪̟͘a̖͙͚̻̜̮̙p̩(̙̜̗͠t̺̝͎͓͘h͏̦̤͇i̖͇̗ͅṣ̴̞̝̹̘, i, ͙̻̖̳͈͖͍e)̸̭͚;
            re̫͍̝̗̩̻t͓u͉̹͓̥ṟ̰̺̩n̤͎̩̝̻̭ "̡̬̪̱͍̹U͡n̸t͈̝̗̺͝ͅi̺̤̪̖̱l̠̹̰͙̜͎" ̝̪!̧͚̘̟ = ͉ = r̖͔̻͡.̨s̳̺͍̠̺͈l̻̜̮̼ḭ͖̼͓͖̳c̢͇̠͔̭e̝̬̳͡(̮͙̫ - ̢̙̣̻̝̮5̥) & ͈͓ & ͈̫͇͉̥͚(̝̲̲̹t̤ = ̫é̦̻̗̣̙̯)͙͇̱̺̠̦͞,
            ̨t̻̥͈̝̺͓ & ̼ & ̼̠̱̱͎̲͚ "̝̜̬̯̠͎s͙̘̯̭ṯ̙͞r̯̺͚͎̝̼ị̞̜ṋ͇̯̫͙g̟͕̤̰̠̼ͅ" ̫͢ = ̢̫͈̞̳̰̟ = ̻͍̰̖̙̥̭͜t̫͚̯͡y͈̣̣̗͠p̗̥͎͝e̦̘̘̰͇͡o͓̮̜͇̫f͍͘ ̪͙̹t̢͇̖̟̭̩ & ̭̮̖̺̙̺̬͢ & (̢̣n̞̠̖̻͢ = ̞̘̪S̷͈̣̘.̜̦̭f̠͓͈̝i̞̩̟͚͇̗͚l͎̟͕̯te͖̼̮͕r̴͍̳̻̩̮͔͓(̣̦͍̙t҉̟̙̪ͅ, ̻̲͖̪̩n̹̰͉̞̭)̥͚͔̼͍)̭̗̟̯̜̟,
            ̷̘̞͚̲̖1̸̪̞͍̤̤͔ < ̝̩̳̩ͅt̳̪̮͓̗͠h̷̤̜̜ͅiș̷̬̱.̳͖̦̻̻̤̜l̺͈͠e͚̬͓͖͟ng̛̙̙̝ṯ̖̹̕h̞̱͍̲͝ && ̷̭̲͔(͈̪H̞͎͢[̸̪̲̼̤̹ŗ̝͚͓̮ͅ] | ̣ | ̫S̰̪̙̪̪͖ͅ.̵̼uniq̙̥͜u̺͎̯̱̮e̱̩͕͙̻͉ͅS̟͔͎̙̰̮̀o̵̲̜͉̬̼r҉t̯̺̪͖̱̫͉͡(̸͉͕n͚ͅ)̻̳͙̦͕, ̰͔̙̟̖L̳̤͙͍̝͍͝ͅ.̥͟t̯̞͇̜̠̩͟e̷s͔͜t̷̳(̳̯̘͈͖̲̺̀r̴͖̻̖͇)̟̦͉̟̭̪͙͠ & ͕̺̞̦̮̻ & ҉̪n̡.̣̰͟r̦͙̮͙͎̠͡e͕̫̺̜͖͕̖̕v̨̼̟e͖̥̜̮ͅr͙̣̼̟̰s͇͎̺e͍̗̞͉(̲͖̞̺̱͚)̡͈͎͇̪̱͖)̶̥̠ͅ,
            ̫̦̜͠t̼̳h̯i̛͉̳s͓̻.̢̦͚̭p̤̘̟̺̱u̠͍͢s̪̲̝͈̬ẖ͠S̷͕͇͈̗t̨̜a͍͕͖c̷̭̭̼͓̲͚k͍͟(̸͙͉̪̯̱n̫̰̥̜)͘
        }
        ̧̘̝̠̖ͅ
    }
        ̪͙͎̠͈͍)̼;
    ͇͎̙͙̲̝v̥̘a̗ŕ ̭P = ̡ / [̞ ^ ͏̼̪̩̥̼̮ \ ͢x2̣̦̟0̷̖ \ ̗͕͔̹͇̯t̘̪̠͕̖͘ \ ͎̮r̝̺͍̬ \ ̖͡n̦̺͕̲̘̙̯ \ ̡̱̣f̮̹̮͔]̺͕̀ + ͇̹̤͕̮͝ / g̯̱̕;
    ̡̘̲̟̩͈f̢̠̥̥̤͈̩u͍͖̟nc̤̥͉̰t̸̝͕i̻͔̖̠͇͞o͟ṉ̬̼̤͙ ͚̪̘̤̺̰̠R̠̻(̫͕é̹̮͍̥͓̮)̲̞͉̙̫̥͜ {
        ̬̫r̸̖͓e͇̱̪͎̖̤t̵͙̯̯̮͇͙ú̬r̢͇͎n̙͖̬̱̳͜ ̨̪̩e
    }
    ͕̝̱͖̺f͇̤̦̻͇̰̯u͇̼n̳̟̝̝c͔̖̬t̢̰̹̯i̲̥͡o̖̩̰̖͔͈̰n̸̜̪̰͚̮̯͓ ͈̩̕M̴̮̣̤̹(͔̫ͅe̝̭)͇͕̣͚̗̤̬͟ {
        ̱͔͘t̲̲͚̀h͇͍̫̰̲r̙͈̳̹͟ow̤͉̫̰̝ ͍̠̪̯̘͠e̟
    }
    ̼f͖̙̦̞͉̟u̗͖̗n̛̩͎c͓̫̙t͇̲̦ͅị̙̹̙͓͠ͅo̼̙̥̣̹̭n̠͇̥ ̯I(̵é͓̥̬͚͖, ̩̯͉͇̻ͅt̳̹̩̫͖͈, ̖̱̖͡n̢͓̼̘ͅ, ̯̭̝̲r͙̪̫̞̣̲̀)̧͍̙̼̻̯ {
        ͎̳̪̗̣ͅv̱̳a̸̮̯̥r̦ ̞̪i;
        ̻t̲̰̠̝r͉̥̟̰y͈̩̥͈̦̠͓ {
            ̸̯è̺ & ͔̀ & ̖̯̩̞̻͜m̲̻̘̰(͇͘i͍̭̲͕ = e̤͇̺̪͍͎.̛͍͕͉̟p҉͎̖̞͍̥r̦̩͎̯o̩̮͠m̤i͙̘͍̹̥̰͟s̲̬e̵̝͇)̞̙ ? ̧̳̣i̠̖̜̮͖͙̺.̨̯ͅc̟͈̞̦͘ͅa̶̦̬̝͖l̜̝̼̳̯̗l̶̤̥̯̬(̼̣̬̩̣͘e)͍͇̬̣̝̯.̰̻̪͔d̮̯̦͟o̢̤̮n̴̺̞̬̥e͏̠(̖t͍)͚̳̬̭.͘ͅf͇̮a̘̣͔͞ì̩̙̩l̵(̷̲̮̺̥n̯͍̭̩̜̯̤)̱͉̹ : ͇͙e̯̬̫͚ & ̘͖̘͝ & ̦͔̼m͓̤͚̬͍(̠̜̥͉̣͞i̹̞͜ = ҉̰͉e̪͈͈.͈̦̹̞t̲̩̤͠h̲͍̗͙͓̮̀e͔͓͙̼̝͓n͖)̱̘̱̝͞ͅ ? ̣̺i̢̼͙̳͓.̮̠̜̣̬͉͡c҉̣a̺͉͚̯̤̰l̼͍̬̪͚l̤(̣̖̪̞̱e̹̠̝̩̕, ̡̟͖͔t̵̠̜̖̫, ̬͎̗̣͎n̬̰̼͉͖ͅ)̶ : ̖̠̣t̷.̹a̲͔p̭͖̮̘p̶̥ͅl̠̬̥̻̤͞y̬͍͎͓͖(͓v͙͚͔̟̹o͞ì̼̺̩͙̤̳̦ḑ̙̞̙͚̟͎ ͍̘͉̞͍͙͉0̺̯, ͓̼[e͔͉̺͟]̵̱̗̰̟̝̘̝.̢̣̩͙͈̞͔̥s̳̮̯͈̟̝l͏̤̟̩̝i҉̲̞̝̦̝c̦͜e̖͖͜(͓̳͍̱̰̰̕r̴̖̠͎̣̹̦͈)͖̟͕͇)
        }
        ̩̩̘͕̠̠c̜͔͖̻̠̫̯͞a̻̦̤tc̦̹͙͕̻̼h̷̰̞̰̩̺ͅ(͇̪̮e̮͚͕̺̰̞̞)͓̣̫̤͎̣͘ {
            ͇̺͚n̶̩͎͔͉̞.̣a̲̹̙̘͘p̸̼͇͖̝̙̫ͅp͙̯̱l̴̮̰̯̗y̭(̵̝͚̭̟̯̞̘v̵̞̺̥̣͔̤o̺̟i̵̦͕͎͖d͖ ̩̻͙͙͢0, ̡̬[̬̟͚̞̹͖̼͜e̞])
        }
        ͇̜͔̜̗
    }
    ̗̳̱̮͓̺S͏̙͖͎͇̣̙̺.̷̰̙̭̹̣̦C͎a͕͎̤l̤l҉̥̠̮̟b̯̤͢a̛c̗̦͇̗k̰̫̤͙̙͔͔s͙͕̳̳̤͉̪ = ̢̞͇̪̮f̠͕̰̞̪̞͎͜ú͉n̳̖̪̦͉̜͞c̵̜̤̬̦t̞͚͖͢i̱ơ̰n̟(̳̩r҉̭̼͍)̞͕̩̟͉ {
        ͏͍̹̳̬̦̬v̰̞̯̼̮̹̜a̻̟̱r̹̟̭ ͚̱̹̼̗ͅḛ͉̪̀,
        ͚̙̭̼̪̞ͅn̢͚̮̟;
        ̶r̫̩̲̮͔̗ = ̖̫̟̯͇͕ "̧st͚̭̠̫̜̱r͔͉̲̪̞̟i͟n̷̘̝̭ͅg̛̰" ͏͎̟ = ̬̪͙̮̤̱ = ̯̰̮t͓̬y̱̭̺͍͇̖p̙̞̲͙e̞͈o̥͜f̸̙ͅ ͇̱̗̱͍͡r̬̜͙̗ ? ̬̞(̰e̩͉ = ̗r̩͓, ̸͈̘͉̣n̤͕̮ = ͕͉̦͎͕̣͕ {
                    ͉͕
                }
                ̣̩͇͉̯̜͠ͅ, ̲̦͉̹̦̖͇S̰̣̝͠.e̺a͖c̨͔ḫ̸̭̹(̬e̤͓͞.͓͈͍̼̺͙̖m̗̕a̪̟͎͘t͖́c̠̪͚͈̣h(͉͚̻͘P͇͜)̣͓̱͇̜ | ̺̣͜ | ̟͎̘͈͍̹͉̀[͔͎̤̹̖́]̗̲͎̰̤̤̕, ̴͇͖͇̯̖̰fùṉ̬̬͕̙̥͝ͅc͖͖͎̫̼t̷̼̱̖͖̖̦̮i̖̦̮̮o̤̣͝n͈̝(̷̙̮e̟͈, ṯ̯̖̮͕͎̺)̮͕̯̗̬ {
                    ̩͍͕̳n̥̝̥̜[̶̥͍t̹̖̹͜]̜̗̻͡ = ̢͔!̟͟ͅ0̬̖̜̳̠̮̜
                }
                    ̵̺̼̤̟)̬, ̨̺̻̝̬n͙̠̬͖̙ͅ)̸͔̫ͅ : ̡̪͉̤S̸.̳̹e̗̠̱̰̳x̟̟̭̗̯̗ț͚̳͇́e̺̮̩̬̗͇̲n̲̭̬d͉̘(̕ {
                ̣̣̥̰̲̦ͅ
            }
                ͙̻̬͓, ҉̻̞̘̖͕̰ŕ͉̲͓̼̻̗̰)̗̜͇͢;
        ͏v͖͚a̼̜̻̟r̨̤̬̰ ̩̜͚̰̗̳ị̪̜,
        ̴̹͉͓t̹͖,
        ̥̘̞͢ǫ̠͇̠̤̜,
        ̶̤̣̫̱a͇̪̳͔̜,
        ̤̫s̘ = ̖̦̺̜̠̲͠ͅ[̵̞̹̼̞̫͎̜]͇,
        ̹̠͉ù̖͈̹̮̞̝͙ = ̤̯̟ͅ[̴̻]̥͓̙̤̱̼̳,
        ̥̪̜̙͕̩̜l͚̱͓͚̣̲͔ = ͈͈̮̙ - ̶͇̗̳1͔̟̠̬,
        ̜̼͕̖͈̙̪c̯̖̦̤͕ = ̷ͅf̪͙̕u͇̖͖͓͍n͕̠͢c̵̳̥̩̙̝̞̣t̻͉̻̮͟ì̗o̟n̨̯̻̗̳̰͙̘(̮͙̬̳̹͜)͈̹ {
            ̮̀f̺͠o̧̯̱͔̪ͅr̵̺̺̖͔̦̠(̶̻a̛̮̗̦̙͈̙ = ͕͎̳ą͍̘̥̤͉͇̲ | ͏̱̙̻͖̖͔ | r̠̜͖.̷̠͙ơ̤n͚̤̳̳͍̟ͅc̠̼̗͉̝e͕̗, ͔̻̻̣͟o͙̤̙ͅ = ̤͖̬̥͍̪̟i͉̩̜̜ = ̙͍̺͈̠!̬̠̠͓͔̜̲͝0̻̩; u̠.̠l͔͔̝͚e͎̣͝n͇̪̪̼̞̩͘g̨̻͔̫̟t͕̠̯͟h̩̤̻; ̼͜ĺ̼̭̬̻ = ͔̫̼̘̥̠͟ - ͍̯̺̯1̗͙͙͉̹̣)́ {
                ͔͉̣͙͇̜͙͢ț̣͉̭̫̰ = ͠ṵ̸͇̙̫̺͔̰.̯̗͙͖̰s͉͖̙̙͈̀h̶i̜͍̙͖̲͙̘f̦̮͢t͏͉̳(̳͎̹)̧;
                ̦̺w̫h̡i̦͝l̫͈̝e͉͖̻̱͉͟(͏̺̲͎̥͔̯̙ + ̵ + ̙̰͙̥͚̩͟ͅl̶̻̥ < ̰͙̹s̲̼͟.̮̼̣̮̝͉̰l̵͖̘͙̣̹e̗n̛̩̫̺̮̖̜g̞̪̣̦̝̺tḥ̭̖̀)!͡1͔̰̞̤͈͍͓ == ̩͙͓̻̪ = ̜͓̺͎̳s[̦̲l̪̭̪]̡̯̲͎̠̩̠.̹a̶̝p̟̪͍͉̪͙̕p͖̠̞̖͉̟l̛y̞̫̙̝̳͓̣(̘̫̙̱͉̝̠t̲͠[̷̣̣̥0̪]̘̱̞̞͞, ̢̖̠̩̬̟͙̘t̷̻̟̻̦[̧1̡̞̳͈̱̮̩]̨)̜͇̼̦͞ & ͇́ & ̨r̲̥̮̼.́s̼͖͢t҉̟̦̣̝͔͚͉o̵̬̪͙ͅp͔͚̲̲͘O̺̖̼̼n̙F͍̦̝͔̤a͚̝͇͚̳͖̟l̤s̛̟̭̩̤̮̮e & ͓̯̤̫̬ & ͚̮͖͚(̢̘̖̝l̮̞͇͍͖ = ̪s̮̤͇̘̞ͅ.͙͈̱͚̼ͅl͝e͍̫̟͔̙ͅn͖̼̲͖g̴th̝̝̘̦̳̯͢, ̵͉̟̻̟̗̲t̪ͅ = ͏͓̬̳̱̰͙!҉̼̗͍̞̩1̝)͘
            }
            ̺̥̝r̮̳̱̦̰̹͇.̶͓̞me̘̝͕̟̝̖̦m̯͕̬̕o͇̦͓̰͢r̠͖͝y͈̠͉̜̮ | ̙̻̘̪́ͅͅ | ͎̭͕(͈̦͕ͅt҉ = ̙̩̙͢!̱̗̼̩1͇̳͔͈),
            ̱i̴̪ = !͠1̼̳̘̟̮̘͖,
            a͉̳̣̬͓ & ͖̀ & ̻̰̳͖̮̻͖(s͟ = ̯ͅt͍̮ͅͅ ? ̝̫̥̻̟̱̰[̻͙̪̬̦̲̜́]̭̜͚͓̞̜ : ̗͕̳̱ "̸̝̘̦̳ͅ" ̴̟̭̥̼͇̬̩)̡
        }
        ̳,
        ̥͇͉͖̫̘͘f̼̼ = ̣̘͕̪ {
            ̫̬̣̝͞ą̥̠͖͉̬̙̤d̻̫͇͇d̻̙̥: ̗͕̫f͍u͉̻̩̕n̘̺͍ç͇̮̹̮͉t̝i̗̦̗̞͚o̡̮̼n̜̞̜̤(͙̗̗͎͇̞)͙̜͎͢ {
                ̦̩r͙e̤̤͎ṭ̦̮̪̘͙͠u͇̟rń̟̠͙̹ͅ ͕͖̯s̩̲̥͕ & ̛̻ & ̻(͟t͙͙ & ̷͈̟̫̰ & ̰̯͖̞̫!̜i̝͇ & ̣̙̱͓ & ̮̞(̶͓l҉̗̟̩̭͔ = s̳̬͈̗.̸̳l͙̗͍̪e͍̜͕͕̰͝ͅn̗̞̗g̳̥ͅt̙̹̯͇ͅh̺ - ̠͓͠1͢, ̝̥u.͔̱̤̠̫p̟͓͇͈̖ͅͅu͜ṣ̜͈h͓̖̘̳͔̙̟͢(̘̻̳͖̹̥͡ͅt̗̹̳͕̤̳̥)̸̹)̠, ̵̝͔f͔̹̣̙͕̘ù̯n̴c̕t̬͎͕̹̮̻̪i̷͈͉̲ó͕n͔̜̟̹̠̼̖͝ ̥n̦̞͈̖̜̬̠(̶̻̩͚͖̲̱è͉̦̳)̘̜͙͙̹ {
                    ̻̞̩̯̹͖͢ͅȘ̖̟̠͠.̳e͝a̦̭̬̲̠͉̗c̡͙h̴̼̼̣̲̝̺(̗̯̪̗̺̮ẹ, ͙̳̞̝͓͓̯͝f̀u̖̤͇̱̠͈̳ǹ͉͈̰ć̱̩̙̖͚̰t̬̟̰̩̠io̯̖̤͎n̮͔̜̱̙͓̮(̻̗̰̠̯̜̭e̹̭̳͍̘̲͍͟, ͖̮͙̞͕̺̯͡t̠̞̩̦̗) {
                        m(͎̗̙͔͙̟̺͡t̳̰̘͚͕̪̟͠)͎̲̜ ? ̫̠͎͈̣̝r̢̰.̜̮̘u҉̞͉̪̮̤̦͍n̦̺͉̩̦̝̤i̵̼͚̘̗͖̜q̻u̴̻̖e̴ & ̺̟͓̠̻ & ̡̗̫̜͙͈f͙̯̼.̛̗h̶̭̭̖á͖̥̪͓̭s̬͟(̺̬̤t̪͚͔̙͡)̱̥͈̤͎̬͜ | ͏̠̘͍̘̖̲ͅ | ̥͔͜s̮͈͔.͈̥̻̯̘͕̜p̺̪u̵͓͎͍̦̞ͅs͔ḥ̟͇͎͇͠(̬t̰̙̼̜͔̟)̪̟̤̯̜ : ͖͉͚͈̥̪t͙̠̮ & ̬̠̝͢ & ͟t̷̳.le͖̗̲̰̟̣ͅng͏̭̯̙͚th̡͉͚͚ && ͚̱͇ "̩̦͔̠ș̵̠̹̝͕̣t͈r̬͙̰͕̣͢ͅi̪͓͚̞̜͓̭ṋ̟̤̱̳̫̯g̱̦ͅ" ̳̙̬͓̖̫!̭ = ̼ = ̜̫͔͘w(͚̮̺t̪͚͙̞ͅ)̶͔̜̤̪̣͕̠ & ̬̦̼̗͕̻ & ̴n̹̠̬̣̠̭͎(̗̱ṱ̢̻̙̳)̤͙̳̭
                    }
                        ̱̬͚̦)ͅ
                }
                    ̫̗̕(̘̤͎̭ͅa̱r̙̞̫̺̲g͡u̻̜̗m̺̤̫é̜̭̘̫n̵͚̤̥̱t͓̮͍̦s̸͍̫̜̣̱͇)̧̣͉̪, ̲͍t͖̺͈̫͈ & ̞̯̺̼̜̳̕ͅ & ͎͠!̧̥i̙ & ͎̪͈͠ & ̪̺͙̣͚͠c̥̺͍͓̩(̘̮̗̲̦̞ͅ)͕)̝̜͙̳,
                ̲̩̠t̳̫͉͔̠͙̀h̥i̹͙͔̜s̰͇͟
            }
            ͙͈̯,
            ̰̪̖̖͟re̪̪̝͇͕̬̭m҉͖̘̫ͅo̧̭̱̦͓̮v͝e̝̹͙̮͉͖: ͓̮̟̠̰͜f̥̹̞͍u̥̺̞͟n͍̣c͔̖͕͜t̟̫̘̱͔͠i̛͖̫o̦̘̥͈͇̥͠n͎̜͔̮̣(̙͍̭)̤ {
                re̦͝t̨̪̙u͖̻̭̰̯͇r͠ͅn̠ ͉̝̠̗̗̞̦S̱.̵̞̭͖̜̤̜è̝ḁ̢͕c̣̣͚̦̜̗͍h̦̩̲̝̱͘(̝ḁ̖̞̘r̼̩g͔͍̲u͚̠̥͉̖me͓͎n̛̗͈̝t͏s͚͔̮̞̦̘̀, ̪̠͕̤͚̳ͅf̷̤̫̣̱̬͚ṷ̯̤̹̖n̪͎̱͔̖̮c̱̪͍̬͙̻̣t͎̘̘͞i̞̱̬̻͘ͅo̶͕̦ǹ̜̥͓(̴e͖͟, ͏̥͕t̩̝̪̩͉͔)̪̮̝̮ {
                    ̲̕v͍a̬͚r̼̠̖̹̫̝͝ ̬͍n̯̞̰͉͚̖;
                    ̹̱̤̥͡w̧hi̦͙̭̙̻̥͢le̡(̺̭̰̻ - ̟̘̟͖̟1̵̥ < ̤̲͓͙̜̯(͝n͙ = ̸͔̫̩̪̟S̙̳͓̞͖ͅ.̨̜̱i̮̝͕͕n̡̗͖̼̮̞͖͎A̯͕̞r̺̥̩̤̖̠͝r̖̥̠ay̵(̘͔̩̪̗̼͟t͔, ͇̪ͅs̴̗̰̫̙̳, ̗̗͚͙̱̘n͏̤̼̫̟̙͉̤)̷̙̠)͖͚̬̘̤)sͅ.̵̳̲̯̱ş̠̠͎̞̥p̮̻̭̺͚̤̀ḽ̮͔̥ì͍͕c̸͈̳e͈̪̠̩͕̣̩(̨̖͕̻͉̣͙ͅṇ̝, ̤̘̟̙͙̰͓͟1̡)̝̰̜̣̭,
                    ͕̙̳̤n̦͡ < ̠͙͜ = l̼͍͖͈̪̣̫̕ & ̢̹̱̟͖̤̘ & ̜͓̙͙̥̬͞l̠--̥͚̻ͅ
                })҉͖̥̥̗̤,
                ̦̜̥̗̪̜͡t̮̮ḫ̦̗̘ͅi̯͖͚̠s̫̳̗͔͓ͅ
            }
            ҉͔̥̗̩,
            ͕́ͅh̠a̸̫̻̞̣̟͚̜s̡̗͎̭͙͇̻̗: f̻̙ų̣̯̮n͜ct̷̺̘̗̘͈i̴̤͉̫o̸͔̠̳n̶̺̬(͚̤e̫̳͚̥͍͓̬)̥͎͙ {
                ̢̪̤̞͓̩̘̹ŕ͇͈̱̪̞̰e̹͍̦̱͔ṱ͎̞̻̩͜ù̝͖͚̞͍̣ṛn̜̱̟̘̫͚̗ ̭̬̥̲ȩ̩̱̦̼ ? ̴̖ͅ - 1̢̯͓͈̟̠ < ̙̰͙S͢.͔͉̭͍į͎̩̼̲͎̤ͅn̜͈͍̭͜A̤̫̖̱͇̯͘r̡͉̥r̪̠̞̬̀a̴̻̝͚̼͈̼͍y̺͍(̵̭̙èͅ, ̞̬̙͉̟̺̖͟s͇̰͚̲̻̥̕)͖͓̲̯̫̥̪ : ̘̼̲͟0͍͉̩̞̤̦ \ ̥̤͝x̧͎̺̼̭2̹0҉̻͙͍̯̗̤ͅ \ ̟̦̮t͚͎̹ͅ \ ̸̪͔͈r̢̬ \ ̧̦͕͖͈̱̺n̮̞̰͡ \ ͔͓̝̲̘f͇]̭̫͉̹̝͖̙͢ * ͖͈̤̩̜̀ͅ)͍̳̘̗̻̭̣͜ / ̸͚i̴̝͚̯̯,
                ͎͉͎̲͚̙̖͟h̝̝̗̪̳̮͡e̜̬̪̜͇̟͡ͅ = ̥͎̪̮ / ̱̩͘ ^ ̛͉͔̦̥̳$̷ | ͉̦̹̥ͅ ^ ̗̳͎͘m̦̱̖̘̪o̻͉d҉̭̲̪ù͍l̳͚̕ͅe͕̹$ | ̶̝͔ \ ̵̱ / ̝̥(̶̲ ?  : ̘̻̙̮͕j̲̮̦̀a̡̠͕̜̮̻̜̘v̧̲a̻͖̜̮ | ̙̺̟̪̳͎ͅe̴̯̱c̱̪̯̝̟̝m̙̩̖a̴)̞̘sc̯͙͔̘̭͔͉͘ṟ̛̲̭̰̻͍i̘ͅp̡̦͚̥͚ͅͅṯ͔̰̯͘ͅ / ̙̻̹̠̮̜i̷͍͈̰̺̖;
                ̬̖̭̠͘c͔̱͖͎̦͡ͅe = ̺̦̻͈E͏̰̜̘̯͔.̱̪̦̦͈͞ćŗ̘̯̹͔̘e̺͈a̝͇͔t͎̘̤̙e͓͎̘̱͍̩͡Dǫ̣c̘ṷm̟͔̭͉͕̥̦é̳̣̥n̯͇t̞͙͎̗̲̠ͅF̯͍̲r̮͓̹̟͠a̡̮͎̮g̶͖͙̰̩͎m̞̹͓̩̞͎̤ẹn̛̜̬̞t̞̤̦̝͉(̜͓̖̠)̗.̝̯̼͈͉̪̩a̛̱͕̯̗p͍̫͕̼̮̰p͍͚̟e̩͡n̴̲͕̯͓͈͕ḏ̜C̛̦̭̗ḥ͓͚̖i̹͉̰͚̜l̸̰d̻̘̮̗̞(̣̘̤͙̞͇Ḙ̹̠.̶c̟͕̠r̵̞͖͓̼̤e̤̟͢a͢ţ̯̘͚̻̺e͔E̯͙̱̞̮l̴̻̻̟͔͚͉e̦̳̙̕m̦̮̺̗͎͍e̹͖͍̰̜nt̡̲̥̘(̜͙͍̞ "̟͎̳̤ͅd͓̹̪̗̫i̲̣̥̬v͙̰̀" ̘͙̦͇̝ͅ)̶)̨̯,
                ̛(̠f̦̪̺̗͙̻̦ẹ̸̟ = ̴̱̭̱ͅE͙͙̳͚.̰̹c̝̻̘̮̘͈̬͝r̛̰e̱̪̬͇ate̝͉E̪͓̳͍͚͍̝ḷ͚̹̬͔e̡͉̟͖̭͎m̱̭͎͎e̸̩͍̠͎̼̱n̡̰̬t̼̫̦̮̦̜ͅ(̹̯͖͠ "̤̮͖i͍ǹ̻̼͍͓ṕu͔t̠̼̮͇̻̻͞" ̥͎͖̜̫̻͟)̵̬̻)̟̮̰.̯͓͇̬͟s̫̹̤̥̯̞̮e̵̞͚͙tA̴̯͈t͏̳͖̭̭̺t҉͇̖̳̹̠̙r̙̞̗̹͇̼͞i̶͙bͅu̹̱͍͎̤̠͓t͕̤̖̜̕e͏̹͔̥̫̝(̭̞̜̥̪̥̫ "̻t̹̣y̢p͙̠̺͎ͅḙ̸̙͉̳" ̺̭͍̼͖̤, ͇̼̰̣̳̫̮ "̗͍̦̗rạ̧dį̹̫̥͓o̗̺͖̜" ͔͚̪)͕̘̻̝͎͍̝,
                ̡f͎̜̘̭̭e̤͎̯.̤̻̱̖͙ş͔͕̭e͚̙͇̮̞t̰̜̗͟A̫͚̫̱͔̯t҉̯̮̦̪̠̱̲t̗͖r̤̖͇i̢̙͍̱͚͇̟̰b͍̜u͓͎̙͕͕̱t̰͕͍̻͡e̢(̮͖̬͖̗ "͏c̷̙͔̘͈̻ḥ̵͉̺̳̟̫ͅe͓̩͔̥̩c̪͙k̷͍̗̱̭e̮ͅd҉̻" ̴, ̮͘ "̱́c͔͖͘h̥̗̥e̗͚̗͍̥̰̞c̮̟̥̗̕ͅk̨̘̯̠͉ͅe̞͡d̥̰̼̠͕" ͏̞̲̦̯͖̘)̲̭͍̙̖̼,
                ̡̺̭̻̗̞̫̙f͓̝̞͎̳̟̻e.̧͖̝͖̜s̹ͅet̶̠̹̰̟̤A̬̩̦͈̪t̥̯͚̦̪͝t͏͕̭ͅri̬̻̯̗̥͡b̳̩͍̮͚ụ͖̭͈͚t̲̥̯̼̤e̸(͙̬̱̰ "͙̦͍na҉̱m͓̺e̻͟", ͏̻̤̙͓̖ "̤̻͓t͏̪̞̝̠̟̰̱" ̬)̼͙̙,
                ̙͙̪̮͍́ͅc̼͈̯̱̰͔͖e̦̣̮͕͉͘.̠̳̫a̖̫p̜̼̬͓̬̗͡p̴̭̣̠̲̲̺e͎̼̞̻͈̣n͕͝d̹̰̟̯̟̻͙͢C̤̣̰h̺̼̼͇̜̣̮i̖̦̳͓̜͞l͍̗͓̹d̡̜̥͙(f͍̀e͚̘̜ͅ)̝̘͉,
                ͙͜y̝.̖̪͠c̶̼̣̝̭̳̜h̟̯̫̟̹e̞͡ç̗̜k̞͖̠͝C̵̭̘̗̤l̟͔̣̝̰ͅo̢ņ̯̩̬͉͔̰̙e = ̤̘͟cḙ̷̜.̳̟̰͝c͈̪̺͇͍͔̲͟l҉̟̥̻͈o̝̳͉͙̠͖͜n͟e̶̯̫͚͚N̪͙͚͚̣͔̹o͚̲͉̤d̵̜͎̦͖̰e͖͍͍͔͈͟(͎!̡̞̳̼͙̲̹0͔͉͇̜͙͕)̶̖.̦͡c̥͝l̝̤̘̞̭͙̕o̧n̹e̥̗N͙̩oḏ͉̦̱e̗̹̬̲̝͝(͇̼ͅ!̛0̩̞̦͈̩͕̫́)͇̳̟̤̞̬.̰̤̰͚̹̙l̴͎̞̫̼̘̬̲a̗s͝t͇͓̲͞C̬̤͝ͅh͙̕i̘̯̙͍̲̤l͏͉̝̙̲͇͖d̟̱̩̪̙̙ͅ.̻͖̰̣c͚h͘e̢̪͙̫̠͔ͅc̰͉ͅk͡e̼͎̩̲͟d҉,
                ̵̙̘c̘̯͍̀e̱̦̫̞̳.̼̱̗̟i̧̻̜͓͇n̴̮n͓e̵̤̜͖̙̥r͎͙͞H͈͉͔͓͙̪̞T̬̣͚̹M̱͚̣̺͍̥͕L͏ = ̯̝ "̠͙̘̫̫͎̻͝<͙͉̠͢t̯̮̮̖e̻̣͕̥̙̩̤x͓͉̦ta̡̖̘̲͈ŗ̙̜̖̰e̤̠̻͖a͚̬>͈͙x̲<̧̫͍̰̞̯̞/̣͙͈̥̣̳t͓̫͔̥e̬̬̦͇̻x̴̜t҉̯̖̟̬a̪̲̳̫̝̬r̶e͏͔a̲̻>̥̰̺͍͕̝̦" ͔̞̟̱̳̩̼,
                ͕̝̞̩ỳ̲.͖̀n͇͚̮͎͘o̺̮͚̜̩C̼̞l̛̜͚̰̹͔̱̦o̴̹̞͚̜̺n̻̤̳̳e͙͙̭͍̳C̤̩̖̯̫̖̝h̸e͏̺̪͈͍͈̠c̵͓̳̗̰̟k̫͇̤̪̰̱e̢̳͇d̳̦ = ҉̰̗̰͇̫̗!͕!̲̤͝ͅc̛͕̦̠̱̜e̻̯͚̮͚͖͚.̡̹̰ç͉͕͖̪̟ͅl͕̬͈̝̖̘o̲̜n̜e̢͕̖͎͉N̡̖̲o̠͓͕̙̯ͅd̯̝̬̣̟̞̮ḛ̴(̬̬̭͜!̨͉0̤͜)̘͙.̜̘͉̯̟̥l҉̪̰̳̘̰̝̗a̴̖͔s̟t͏̖C̥͠h̥̙̘i̛̖̦̼̥͎l͈d҉̟̼̫͉̪.̪̰̺̥͝d̕ef̹̖̫̫ͅa̴̞͈̪̥̜̠u̬̱̺̪͈̯̰l̗t̷V̤͔̦͈a͏̣̗lu͎̯͎̟̜e,
                ̜̹͝c͓̣̦͟e̡̩.i̛̼n̡̦n̤̦e̦̞̰͎̰r̨̞H̺̙̼͙͎T͎̯̯̬͜ͅM͖̞̱̭͈̮L̸͓̣̠̠͚ = ҉̪͔̗̯͉̗͉ "̳͚̞<̼̦̟o̥͇̣͙ͅp̲t̪̟̤̗̲̥i̱̖̪̞o̰͈͉̩̩n̴̘̜̮̫̬͈>҉<̹̙͓̩̼̗/̰̹̩̞̰̭̼o̰̼̜p̖̞͓̲̲̕t̫̦̬i̭͚͔̭̦o҉̼ͅn͠>̻͈̱̘͔͕̖" ̬͚̞̪̞͎,
                ͕̪͚͖͞ỵ̶̼.̠̼̹͠o͎̘̲p̧t̴̤̥͇̘̠͇ͅi̷͖̜on̶̗̲ = ̨̝̭̭͇̙͙!̤͔̠!̨̱̰̭̪̥͖c̠e͕̕.̱͉̮̭͡ḽ̤͎͍̭aś̲t̢̩͚̮̙C̫̻̀ḫi̷̠̪̥̙̝͇̱l̜͓̦̩͚̭̥ḓ;
                ̹̣̪̞̞̰̕v̶̤͚͖̫̠̺a͉͟r͕̳̼ ̤̘͓̘͝g͙͝e̲̜̺̤͖ = ̵ {
                    ̞ț͕̞͚̺̕h̤e̟̬̺̻a̡̰͉̼̮d҉͙ͅ: ̻͕̠̤̺͎͘[͍̦̯̳1͜, ̹̫͓ "̦<̯̭̲̰͡t̻̫̠̱̪̣ḁ̢͇̙͍b̶͚̭l̹͇̟e҉͖͖̟͉ͅ>̞͙̬̲̗" ̫̼̬̥͇̬͟, ̟ "̩<̻̕/̤̭t̨͙͈̞͕a̮̮̤̲ͅͅb̷lͅe̮̺̹͎̞ͅ>̨͈̘͙͇̥" ̶̬̙͍̟̘̖͙]̳̹̭̦̱̫͠,
                    ̗̠͈c̛̲̞̟o̴̞̜̥̗̩̖͍l͔͝: ̵͉̦̘̫̣͚[̸̗̤̯ͅ2̼, ̹̲̳̖̻ "̷͎̼̠<̞t̖̺͇̗a̞̬̼͖͙̲̲ḇ̕le̲̤>͇̩̀ͅ<̻͉c͜o͙̯̻̫l͏̘̮g̠r̨̺̟̹̹̟̺o̼̳u̱͇̰̘̻p̣̪̖̪͟>̱" ͍̼̤͍̭͔͡, ̶̣̻̪͈̮ "̗̱̣̺͎͕<̶̥͇̠͈̖͍/͎̫̙͈c̗̝o̴̜̳͍̫̬̖l̴̗͈̱̥g̛͓̰̫̣͓̭r̙̭͎̳̟̘̗̕o̗̪̻u͕͓̖̺̜p͈͉͕̮͖>̣̳̟̳̟͟" ̟̤̘̜̯]̭̥̝͟,
                    ̙͕͎̖̟̫͢tr̻̗̲̮͕̳: [̖̣̥̼̘̕ͅͅ2̬̮́, ̻͙̯̤ "͉͉̯̣̣̠<͉͍̫͖͟t͎a̙̪̬̺b̴͙͎͎l͖̺̲e̷̲>̥͍̭͚̼͡<̖̲̝͖͇̙̻͢t͟b̢od̀y͈̺̕>̩͈͍" ̞͙̫̲̹͍̺, ̗̻͔̭̗̩͍͟ "̵̪̹͎̪<̮͚͎/t̸͖̻̣b̻̹̻̘̝͢o͔͔̝̠͞d͍͉̭͡y̜͉͜><̵̠ͅ/̸̱͙̥̞͓̖t͇̞̠͇̻̠a̭͖̹̗͍̺b̵̬̰̥̺͉͈l̵̗̱͎͇e͕̩͍>̗̯͓͙̠͜" ̳̭͇̬]̯̹͓̜,
                    ͅt̰̘̘̩̼̠͢d: ̸̗̜͚̥̹͎͓[͙̪3̸, "̙͉̤͇̫<̧͙̣̹͈̜͈t̯͇̭͖͙̻̞á̰̩b̯̘l̴͕͔̜̭̺̞̦e̹̼͉̱̳ͅ><̨̣̲͉̪͓t͏̥͙͎͍̤̫͓b̗̝̻̳̠̀ͅo̩̲̞͓̩̬̦d̪y͕͇͇̳͈̹͔>̖͙̝̰̳̦̜<̨̝͎t̘͚͓͖r͍̜̖ͅ>̬͕̯̫̯" ̙͇, ͙̰̤̹̭̪ "̘̻͈̳<̧̦̝̘̩ͅ/̡͉̱t̙̰͓̻̣̞r͉͍͙̙>̛̫͖̜͉̰͎<͉͓̳̺̩͉/̷͕̘̹͚̹t̙̹̬̝b̞̯̼̮̲͟o͚͘d̸͙͍̯̝y̶̳̤̪̫͇͇̭>̶̦͈<̬̣̗/͍̥͔̟͕̙t̺͖͜a̛̝͖̲͖ͅb̗̦͇ĺ̼ę̭̖̮̰͈̪>̖̲̮͇̪̤̀" ͍̹̩͎̟̯ͅ]̬̪̞,
                    ̜̤͚͖̤_̱̞̳̪̻̯̤d̝͔e̫̬͎͔̘̫͡f̪̥̘͕ͅa̱u͙͇̺̰̺̳l͖͚t̬̮͙͓̝: ̵̝̠̹̣̯̩̣[̨̦̟̜̹͍0̛̻̪̻͍̱͚ͅ, ̘͔̮ "̪̭̝̘͢" ̡̫͈̫͙͕͎͖, ̣̤̼̥ "̶̹͈̲͉̖̪̺" ̻̭̫͇͉̳͈]̞̝͕̺͚̥͓͡
                }
                ̢͎̤̦̝;
                ͇͔̰̬͕͎̀f̸͖͕͇̬̦̝u̡̩̼̙̻̜̙n̦̰̜̙͖̼͕c͏͉͚t̮̞̱̬̟͜i̠̼ͅo̠̜̹̭̻n̫̥͙͇ ͇̕v̺̝̜̻͓ę̙(̘̼͉͎̮̠e̫͜, ̨̬̩̫t͍̮͎̱̩̖͈̀)̙̟̤̟̟ {
                    ̢̙̱̮̣v̯͈̰͉̠̰̤a̱̪̫͕͍r̘̳͞ n;
                    ̷̰̱͖̲̮̹r҉e̬̪͖͝ͅt̗̬͘u̶̫̟̘͖ͅr̗͇̖̖̪͙̞n̠̜̙̙̼͖ ̸̞n̞̜̱ = ̥͇̼̘̻̟͠ "͉͎̙̪͎̯̥un̶̻̗͇͈̗̞͈d͔̬͎͈͎̺ͅe͍f̹͖͎̙i͉͉n̘̗͈̕e͉͇̭̬d͏̣̪̮͍̫" ̘̮̳̤͖̻ͅ!̘̠͔ = ̨̩͈̣t̝̠̝̦̙y̪̲̳̟p̦͡e̦̝̜͍̺̖̺o̤͓̭̘f̥̱ e͎̪̞̦̪͜.͓͈͔͝g̺̜e̞̼̰t͈E̸͎̹ĺ͚͔̦͎e̮̹̣̲m͉͖̤͡ę̠̲̭̮̜͎̼ṋ͈͈̭͇ṱ̼̭̦s͖͇͍͎̱̭̰B̤̰y̠̭͕͙͝T͎͙̳a̠͔̙͕͖͉̖g͡N̰̠ͅa̩̝̺̲̯m̬͕̝̱ͅe̼̻͟ ? ̭e̺̺͙.͙̜͍̻g͎̥̠̼͇̣̀ẹ̮̟̞̠͎ṯ͈́E͙͚̯̺̩̺͙l̻̠̫͚̼ẹ̳̫̰͘m͇͕̮ȩ̮̩̖n̵̦̣̦̰̫t͇̦̣̼͉̝s̗̹̪̣͡B̢͕͕̬̯̼̮̗y͚̺͚̲͢T̰̼͕͚̠͉a͇g̩̩̫̠͈̻N̰̭̟̟̝̣a̝̗̝̬̭̲̭m̜͎̯̭̥̞̀e̷(̬͎ͅt̬͙ | ̷̜̲͉̟ͅ | ̧̭͉̜ "͙͔̭̱̮͓*̶͈͎͇͖̬" ͈̯͖̣͈͜)̤̥̮ : ̧͖̦̳̞͔ͅ "͚̺̞͍̕ͅun̵̺̘̮̩d̲͇̰̰͖͙́e̴̤f̻͇̺̹̻i̸̳̤͚̹͍n̸̰̺̩̭̩͓e̮͎͖̘ḓ̵" ̧͕̼̩ͅ!̙ = ͍̠̦͓̦͢t̲̹̹͎̜͡y̙̠͈̹̗̲p͓͓̥̯e̩͓̣ó̞͙͇̝f̠͔͕̯͙̱͝ ͖ͅe̗͎͔͕.̤̺̤q͇͖̜̳̱̠ͅue̢͕̜̙͔r͓̳y͜S̯̥͈̞̞e̺le̶̳̣̹̲̣̱̱c͈͓ͅt̕o̭̼͝r̰̠̻͉̫͢A̬l̦̠̗͍l̖̣̪̦̠͎ ? ̲̥̭̘̀e̱̤̼͞.͏q͔͖ue̤̰̹̰̼̪r͔̤̜y̺̲̖͖͠ͅS̛̥͔̰̫͚̼͇e͡ͅl͓̝̗̙͉̲͞e̙͕͢c̸̥̭͍t̩̩o̝͉͓r͔͈̠̘A̢̤̲l͎̞͎͠l̺͕̜(̞̪t̞̝̺̻̕ | ̵͙͕̗ | ͢ "̩͈͓̳̱*͇̫̜̥" ̴̘̜)͚̫ : ̸͎̩̞͖͙̭[]̞̩̖͖͢,
                    ͈̀v̫̫o̯̤i̯̼̼̗̮̘d̵̪̲̟̦̩̦̞ ͙̰̖0̣͇ = ̧̯ = ̷̥̬̳͙̹ = ̟̩̱̤̰̠̙t̳̺̲͇̦ || ̙͉͈̝̮͞ͅṭ̼͈͎ & ͙͓̼͍͔ & Ḁ͘(̸͙͎̗̳̩e̼͓̻̯, t̼̦̹͞)̳̰͢ ? ̲̝͈̝͍̯̳͜S̴͉͖͍̜͇.̯̤̻͠m͎̖̖͢e͈̭r̘̼g͈͎͕͠ͅe(̲[͔̪̥͉̭̯e͕]͖̬̝̗̦͜, ̬̝͉ṋ)̵ : ̛͎n̩͎
                }
                ͈̻̳͚̦̫f͔̙́u̟̖͉͚͎͎n̜̣͟c͕̘͟t̯̹ị̺͇̠o̭͈͎̬̰n̴̯̖̰̳̺ ̨̗ye͈̪̙̹͇͢(̵͍̰͚ͅe̲̩̭̹̻̦̻, ̖̙̣ͅt̡̩̱)̷̪̠ͅ {
                    ̡̳̙f̞͚͉̯̮̖̫o̧̮͚̳͕r͇̗̪͎͞(̦̮ṿ͉̻͈͉͇̹͟a̶͔̘̹̥̝̬r̤̫̬̼̦̝̤ ̩̗͖͔̜ṉ̩̼̞̼̪̟ = ̧͓͓̩͕͖͓0͓̬̪͇͞, ͙͍͍̯̬̫̻͢r̮ = ̺̠̻̲͍e̼.͈͔̳̠͉l̮̘̖e̛̤͉̪͚̺̬n̞͓̦̩̳̭g̀t̟͖͔͔h̡̘̱; ҉̬̹͖͚̞̙n̹ < ͕̘͜ŕ͔̮̠; ͏̺̺̗̬͉ṉ͝ + ̺̺̗ + ̥̩͜)̩̱̬̮Y.̰͢s͚̞͎͙e̵̻̥̺̭̠͇t̨͖̤̲̲͓̱(͝e̯͘[̴n͢]͖͈̟́, ̛͉̮̹̩̞͕̖ "̲̳̻͢g̳͇̰̙͓̀ḽ̪͙͕̬̱ͅo͇̻̰̬̹b͓̮̱a͇͓͇ͅl̠̳͓E̢̤͕ͅv͏̫̫̠a̜͡l͏̫̯͓̱ͅ" ̠̦̣̮͠, ̨̹̞̜̥͕̥̹!̻̖̼̬t̜̱̗͎̰ | ̱͈͇ | ̘͔̮̲̗Y.̺̹̩̲̘̺̤g̨̳̤͖͖̹ȩ̜͉̜̜̯̲t͈̜̯̯̭͈(͚̮͍͈̟̩t̘̘̱͈͢[̗̺̩͟ṋ̤̝̝͎̺ͅ]̢̥͙̹, ͇̰͉̫ "̴g̯l̯̳͍͜o͇̱̣͈͚͕͢b̭̖͎͢a͕̮͡ļ̖̲̞͈̞̰E̝̙̞̣͍ͅva͔̰̩͓̗͘l̥̤̜" ̘̤͔͝)̭̻̲̞)̝͇
                }
                ̫̞͍̖̗̜̲͘g̴͖̞̲͍̭e̛̱̜͎̞̺.̴̬̙̟̱t͖͖͙͜b̝̰̼̘o̟̖͖͚̥̺ͅd͙̖̰̯̦̗͔y͇̥̗̘̙ = ̷̻͖̰͎̰̖̰g̬̤͙̠̕e̖͎̱.̴͕̱͔̫͎̞̹t̶̯f̫o͏̺̳̟̯͎͔o͡t = ͇͍͉͘g̻͓͓̪̤e̶̞͉̘̼.̨c̜̦o̙̭̯̪̕ḷg̪̫̙̬͇͠ͅͅr̝̺̺̥̪o͓̫͡u̯̹ͅp̧̙̮͎ = ̣̞̪͍̹̺g̠̮̩͉̼͍̖e̘͉̖͙͠ͅ.̵̱̯̜̠̼c̼͍̦a̰̦̟̰p̸̳̭̠̰͎t͖͓̲͜ͅi͈o̲̼̟̖̮̣ṋ͔͕͎̞̞̀ = ̮͈̝͚g̬̞͝e̗̻̞̻͎̗͈͠.̙̹̥͍͟ͅt̮̖͎̀h̫̠͇̗̦͉͈͝ea͏̯̫̥͎̭͍ḏ̠̞,
                ̺̠̪̣̥̝̼͟g̬͕̟̯̕e̴.̶̤̙̠͚̬t͓̺h̜̩͎̻̳ = ̞͉̤̣̘g͏̠̦̯e̘͓̤͓.̸͚t̀ḍ̜,
                ̷̳̠̬y.̥̝͙̘͉op̥̻͍̺̰̟̀t̸̺͖̥͔i̴̤͓̮͚̻o̵̝͍̬̳̯n | ̲̠̩̮̩̺ | ͠(̗̰̗̯̥g̱̤̠̱͝ͅẹ̗̭͙.̱͇o̢̝͉͖͚͕̰͉p̀t̡gṟ͎o̷̠͇͎̤̜u͕̣͖̘͉͍̩p͎͙͇͇͔͡ = ͚̳͉̗̖̙̲g͏̳̻̭̣͙̱ͅè͉̯̜̭̗̱.͕͉̗͚o̠̼̳̞̫͠p͎̹̲͙͉t̡̫̦͙̹ị̣͕̥̗on̸ = [̡̪̣̳̳̜1͙̬͓̙̪, ͈ "̦<̨̘̖̬̝ͅs̰̜͚̱͚̙̝el͏͔͇̥͖̤e͟c̬t̝̯͕͖͓͇͇ ̸͖̬̝͇ḿ̯͇̰̤̙̙u͇͉̥̥͕̞lt̺̠i̩͓͓̪͉̩p̠̼̹l̷̥̟͇̙̤̩ͅe̜̫̗̣̗̲=̞͔̙̱͖̤̺'͉̠͍͈̝͘m͘u̼̬l͎̖̱̝ͅt͔̤̟̞̱̝ͅi͖̠͙̤̭p̤͉̪̩̰͔̬͝l̻̙̰̗̹ͅe'̵̖̳͈̤̙̩̭>̤̟͓͇̯̞" ̙̼, ̺̫ͅ "̤̯͍͍̞̥̭<̣͕̤/͎͉̱̀s̥̞̦̦͇̪͔͝e̦̻̺̖̞l̩͈̱e̡̪̘͓̱c̱͔͍̥̻͡t͈̦͕͙̩͈̘>͓͙̙͔͞" ̼͇͕]̲̳̝͔̯)̣̤̠;
                ̥̰̯̳̬͍ͅv̭̜̫̤͓͚̭a̡̲̮̫̺͕r҉͉ ̦̤͜m͉̫̠͔̺̕e̼̯̰ = ͓̥̭̀ / ̲͈̬͖͇̝̞͘ < ͏̭ | ̝̣̯̺̼̬ & ̠͉͢ # ̸̱̩͚̯͔̻͔ ? ̧̯ \ w̮̲̜̼ + ;
                ͏̬̲̹ / ͎̮;
                ̞̻͘f̷͚̣͙̫̟͕͔u̥̖͍n̝͕ct̘̠͕̰i҉̖͈̩̼͔͖o̰̫̮̥͇̖͝n̨͉͔͔͎̖̪ͅ ̜̕x̬͖̫̯̬̩̖e̟͉̥͖̼͎͝(̳̙̠̹e͓̘̮̗͍̗̗, ͏͙̦͖̲t͖̮͇̼͉̱, ̛͉̮̦̪n̶̻, ̸̞̦̖̺r̸̤͚̦̠̖, ̶̱̙̱i͔̬̟͢) {
                    ̮̼͠f͘or̷̹(̻̳̬͍͚̜v͏͉̫a̡͓͈̠r̞̘͈ ͍͚̙̻o̭̪͟, ḁ͓̻, ̯̥s͍͇͠, ̦̰̕u̥̹̻͓͞, ̵͙͔̖l͔̦͇̯, ̭͎͓c͎̹, ̳͓̘̻͓f̗͇̗̭ = ̦̪͞t͎̪̦̗.͚͕c̬͓̀ͅͅr̠͘e̥̹̲͉͍̕at͈͉̳̤̟́e̫͖D̷̖̱̝ͅo͟cu̦̭̳̳͍m̵̻̥̬en̜̥̳̮̯͎̩͢t̸͎̟̗̫̜͇̭Fr̬̘̘̘a̗͙̣̹̯̝̤͠g̫̮m̤͓͓̥̯e̵̞̺̭̞͖̙ͅn̼̱̦͈̲t̰(҉͉̮̪̣̲̳̤)̨̲, ҉͓̝̭̖̦p̠̫̫̩̭̗̜̕ = ̤̰[̱͟]͖̲̬, ҉̹̘̟͍d͈͓̀ = ͖̗̼̱͉̗0̟̼͎̤, ͏̜̗̠̜̠̦̗h͏͎͈̞̦̹̲ = ̛̖̹͙e̲.̤l̙̞͉͉e̸̝n̯͙̮̣͔g̣̖͕͓̫̥̩t͍̩̰h̸͕̙͓̥̯; ̩͎̩̠ḏ͉ < ̼̤̠̥̙̠̟h; ͓͚͖d̨̬++͕͈̯)̟i̘̯͓̮͉̭ͅf̫(҉̣͓̘̞̰(͉̭̥͇̱̺͕o̱̺͚͖̬ = ̺͉͇̮e͏̖[̴͈̹͕̩̤̗ͅd̨̳͍͇̘̟]̵̪̥̖̥͙̤̟)̡̖̦̬̟͎͎ | ̫̪̝͝ | ̻̲͚̫̰͇́0͇̰̼̲̪̼ = ̭̪̜̠̼̼ = ̣̹̫̰ = ̥͇̦̭͍o̞̯̘)̢̪̺̩̙̱͙ͅi̡̬̙̮̮f̫͎̯̼͔͉̲͠(͚̲̺̭̲̺ "̬͚̩̩o̝b̝̱̗̮͎̼j̣e͏͕c͉̬̳̪͇͍̟t̸͓̙̤̫" ͢ = ̠̱̤̻͢ͅ = ̰͉̫͇ = ͈͔w̜͎͍(̘̻̬̩̱o)̢̗̦̹̼)̫͎S͉͙̞.̧̻̯̞̳m͔̣̩̪̬͝ͅè͍̞̰r̭͓̫̭̫g̲e͈(̞͎̜̰̹̦̘͠p͏̖̺̩̲, ̺͖̦o̞͚̗.̼̪͖̤̱̟ǹ̘o҉d̢͓̭̙ȩ̘̬̪̳̞̣T̼͙̳̮̬̫͜y̘̲̟̟̰p̼͚̳̫͖̘̮ę͎̺̱̗ ? ̡̣͚̪̳̹̱ͅ[̳̟͇͈͙̻͔́o̱]̣ : ̷̘o͝)͙̗̳͍͙̹ͅ;
                    ̧̼̟̦ͅe̴̤̟l͙̹͍͎̰͈̜s̶̙̪̖͓ẹ ̸̻͈͍͚̰̗̥í͇̞̩̮f͞(͇͕̀m̨̹͔̰̰̲̺e̬̤̩͚͉͇ͅ.t̫̼̹͇͕͎͎̕e̬̣̰̖͓͙̺s̛t̜͙̱̯̱ͅ(ơ̼̝)̝̱͕̗͖̦) {
                        ̝̠͇̮͜a̧͓̩ = ͏̖̟̪͔a̞̙̬ | ̘̬̙͕̤̲̱ | ̪̣̪̼f̩.́a͔̹̫̪̬ͅͅp̠̤p̴͎̤̺̺̱̱̣e̵̫̖͉̞̠̠̝n̺̲̮͎̩̤͘d̷̯̞C̶̬̦̪͕ͅhi͓ĺ̻̜͍d̴͔̤̝̹͔̤(̝̙̟͓t.͔̯͇͍̙͎̀c̻̪̲̮̱͇r͕̪̼͘e̬̬a̱͈̣̙t̮̮͙̺̼e̲͢E̷̱̰̲̗̦̣l̤̱͇̝̗ͅe͔͙m̠̜̬̰̩ę͚̼̮̞n͇̜̙̟͘t(̶̙̝̼͚̼̯̫ "̵̰̮ḑ̞͖̼i͈̜͟v͔͍̤͖̥̳̘" ̷)̦̣̠)̻̻͎̩̙̼,
                        s̗̺̜̟ = ̭̭̣͘(͈͚̯͇̫͠d̝̖̘̺e̙̱͙.̷̳̻e̬̫̭̲̘̘̫͡x̦e̡̬̳͙̬̝ç(̶͖̱̱̼̦͎̦o҉͉)̸̭̺̭̪ | ̞͜ | ̛[̖̭͓̻̥͙ "̫̤̟̦̣̮̱́" ͍̺, "̷̦̞̞̲̭" ̱̻̳͠]̬̼͜)͇̪̺̣[͡1̻̻]͍͎̀.͘t̺͎͍̗͘o̯̱̼̙L͟o̡̰̩w̧̭̗͎e̝̖̲̜͟r͙C̣̝̱̹̯̝͡a̲̹͔̮̟͝s̤̙̞̟͚̩̜͘e͇̖̝͎(͖̤̦̰̞)̰͖,
                        ̖̞̳͚̱̜͍u͓͔ = ̻g̭e̟̟̹[̙̙̗͖̼͟s͓̯̜͔̮͎̘]̠̣̘̘̘̙̕ | ̠̣ | ͏ģ̱̝̙̱e̙.̗̕ͅ_̡͈d҉̠͓̗̘̥ͅe̢͍̲͇̙͓̪ͅf̘͍̣̰̥̪͟a̷u͙͖̝l̶̥̠t͎̖͚̘,
                        ̺̦̦̦̭a͖̮.̗̦̺͉i͚̬̙̜̖̜̯͡n̛̮n̜̤͔e̵̲͇̗r̡̲͓̬̬̮H̝͖͓͈̦T̲̗͓̫̺͟M̠L̯ = ̵̲̦̘̪ͅu͍̞̯͈̗͔[̸1̛͔͉]̻̞͓ + ̨̯S͉̺͓̮͍̫.̜h͉̞̙̹̣̪͡t̷ḿ̠̺͖͓̤l̦̺̣̞͔͜P̛̻͚̦͓̰̠r͎̞͈̤e̠̺͚͎̘̭fi̵͇͔̭̩̻l̜͟t̟ę̫̝̲̰̣r͈͟(̺̻͔̣o̧̲̦̯̥ͅ)͕̗̳ + ̣̹̼̫͎̮u̼͙͇͍[̢̜̩͉̻2̠̮͚̥͜]̢̱̣,
                        ̺c͙̰̼̱̙̠̝ = ̖̱͉͎͓̜̤ư̠̙̲̙͖͈[҉̘̬͓0̶̤]̡͇̜̪̗;
                        ̖̺̤̖͎w̯̥͙̪̝̳͈hí͎͕̳ͅḻ̷̻͇͍e̵͎͍͉̱̰̝ͅ(͏̱̳c̣̫̼̼͔̰̞ - ̟ - ͈͙͓͙͙̤̹͜)̠̩̖̹a͚͙̤̣͈͎ = ͉̯̮̗̟̤a̤͖̤̺͔ͅ.͎̫̜͎̪͡l̹̜a̼̟͚s̴tCh͎̭̪͔͡i̥̰̪ḻ͈̖͇̼d̢̗;
                        ͈̩ͅS̛̻̜͔͎̱̝.̱̜̲͍͕͕ṃ̣̪͙̝͎̕er͎̣̳͓̖̭g̰̞͈̝e̖̕(̭̱̞̦͢p̹̻͈̼̫̲̫͞, ̺͙̗͉̳̝͠ͅa̲̰̞̱͢.̟̜̖c̙̮̮̕h̬͙ͅì̪l͚̳̺̣̭̼d̟͙͟N̠͔͝o̯̝̰͔͘d̫͇̗͇e͓͙̤͝s̻̼)̛̬͓͍͚̤͉̲,
                        ̧͇(̰͎͘a͓ͅ = ̱͇̮̺͠f̟̭.̻̼̞͕f̛i̞͍̝̤̞̙̥r͚ṣ͓̰͍͙t҉̼̫̻C̴̟͈h̲í̼̣̰̖̞ͅl̖͓̤̟ͅd̸̠̰͎͙͔ͅ)̖̯̺̼͚͇.̣̫̹̞͉͉t̹͎̝͢e̻̼x̝̭̣͚̣͉͟ͅṱ̡̹͇̙̜̥C̷̹o̗̞̼͚͓n͚̣t̷̠͈̬̗e̬̯͕͢ͅn͉̠t̯̫ = ̷͕̝ "͓͉͞" ̮͙
                    }
                    ͙̙͙e̫͚͢l̦̠̞̞̬s̹̘̣̟̪̰͟ẹ̙͉ ̱̞͓̭̗̥p͜.̳̝̣̟͚̥p̫͙͉̦ṵ̞̮̰̥sh͍͍̹͔̺͎(͈̦̲͙ͅt̹̦̼̝̣.͔͓̥̳̝c͏͙͉̘̺̟̱r͏̞̺̹̗ͅę̻̙̪̬̩̖a̬͚̳̦̼̤t̴̳̭̣̙̣̩̯e͔͙̞T̩̙́ḛ̞̫̹x̥̀t̺̤Ṉ̛̳o̭͖̟̯̞̼͜d̞͙̟̖͉̜͘e̜̤̳(͓͓̜͈̘̺̹o̵͍̫̭̟̻̟ͅ)̷͕̩͙̬)̜͖̤̯͖̜́;
                    ̥̫̭f̘̜͔͉̻.͏̼͇͕̩t̵͎̺è̳̱̻̭x̹͝t̡̯̯̙̫̭C̙͇͉o̪n͓̣͓̘̳̜t҉͕̰e̵͈̮̮͍͚͖n͘t͔̳̝̻͓ = ̱̫̫̼̝ "̀" ̖̬̞̹͠,
                    ̘͍̺d͖̼̱̖ = ͖̱͓̲̱͍̰́0̮͙̝͠;
                    ҉̙͉ͅwh̭̲̲̠̰̜į̲͓̲̻̙̼̰l͟e̯̱̥̩̪̝͓(̱̪̟̯o̤̤͘ = ̻p[̶̞̟̳̝̰d̴̪͎̯͍̯͇ + ̤̮̪͖͈͈̙ + ̥̳͉]͔̗͍̰̤͠)í̮̗̟͖f͏͉̙̯̖̬̥(̖̖̤͎͙͇r̛̘͖̪̦ & ̘̜̱ & ̡ - ̮̣͎͔1͙̰͚͓͙̕ < ̧S̼̼̥ͅ.͇̤̼͎͇̣̘͜i̦̙̕n̶͙͇A̡̳̠̱̹͓̹r͉r͖̹͇͇a͎̰͓y̵͓͇͈(̛̳͈ͅo͏͔̪̯̖͖, ̳͉̙̲r)̣̟̖̫)̘i̡̮̩ & ̙͖̮̘ & ͉͜i̳̥̫͈̭.̣p̰̩̰̭̥u͞s̭̳h̫̥͔̘̱̱(̝͙͚̤͎͈͈͞o͍͇̤̪̬̮)̙͇̮͚̥͕;
                    ̶̘̜̘̫͈̩e̛̺̟l̪̥̠̻̘̺s͚̬̩̺͚e͖ ͉͇i̪͍͉̻̥͖͈f̪(̠͔͘l͡ = ̗̮̥̘̀i̸͈̦̖̳̞̩e̫̣̖̭(̺̙͓̹͖̭o̞̹͇̘̤̺̙)̭, ͚̫a̶̙͇ = ̵͓̙̗̙̖̞v̳̼̘̩̀e͕̼̯̲̫͡ͅ(̙̼̭͇̳̺͜f͕̥͚̱͕͟.̯̰͕̼͟a̬̺̕p͝p̬̹̭͕͓͇͙e̷̙͔͖n҉̦͍̩̤̖̫̹d͜C̺͈̫͚̪͍̱h͕̣̝̠̤i̻̲̦̪̳ḷ̻̬̮d̪̜͉̻͘(͚̬͇̣͇̤o͈͍)͈͞, "sć̹̦̜͕ŕ͇̮ͅi̟͕̻̱p̧̣͓̙̻tͅ" ͍)͖̼͍̗̦, ̥̯͔͙l̸̰̳͙ & ̟̱̙ & ̠̭͖̤̯y̪͎͇̩͍̦e͓̖(̗̕a)̵̜̪̦̘, ṋ͉͚̘̻͘)҉͚̰͕ {
                        ̩̼̻̻̣̀c̩̲̺̳̟̱͘ = ̠͓͚̩̫͎0̼͓͓;
                        ͎͔͙w̳h͍i͚̹̫̪͜l͖̝͎̲͈͕e͔͝ͅ(̶͙̫̻͚o̜̦̘̪ = ̧̬̰̼a̱̮͓͡[̘̤̜̜̣c̖͇̙̠͙̙͜++̗̖̗̦͡]͚͎͓)͚̀h̨̤e͏͚͔̬̠̜̬̙.̘̙̬͙̙t̟̣̀e̘͍͓̼̪s͖̯̫̻t̛̻͍̰(͟ͅo̴̙̹̦.̬͍ͅt͎̯͈̱͕̭y̜͕̩̪̣p͎̥̻̜e̲ | ̴̜͈̳̱̼͓ | ̝̤͖̹ "̩̲̰͓͚ͅͅ" ̦̗̗)̞ & ̜ & ̧͈̥͕̬n͘.̼̀p̯̘̞̭̖̜u҉͍̟͎s̶͔̥̮͕̯h̖̠̘̯̹͠(̧̥̲o͜)͎̦͓̪̤̗͉
                    }
                    ͔̼̻͍̭͎̀re͈̲̝̫t͏̹̳̦̰u̳̩͍r̝͇̪̟̪n̫̝͉ ̜̞̦͚̳̩f̸̻͈̘̺͇̦
                }
                ̥͎͖̗̪̞̀ͅv̺̘͍a͍r̡̻̖͙ ̹̼͙̙b͝e̼͉̱͎̖͡ = ҉̠̦͇̺̞ͅ / ͎̕ ^ ͓͇̹͚̠̟ͅ(͕̗̬̞͓͚ͅ[̢̮̻͎̦̫͈͖ ^ .̧͕̻̹]̥̪͞ * ̢̩͇̠̼ͅ)̩̙͕(̘ ? ̖͉͖̙̼ : ̲̘̦͓ \ ̫͉̖̱͕.̶̻̯̱̼̳̮̳(̗̻͍͍̼.̬͚ + )̮̤̝ | )̻̱͙͎̳̲̤ / ͘;
                ̞̼̣̣̕f̬̞̖͓͠ụ̬̰n̶͚̟̮̥̲̲̰c̗̗ͅͅt̜i͙̹̪͚̩͕o̻͓̼n̦̼̕ ͢w͍͓͚e̫̩̜(̞̟̲̭̪̗̖)̸ {
                    ̷̦̝̜̭r̵̻̗̘̯̻̦e̙t̹͔͙̮̟̟̣u̹̩̤͞r̷̻n̷!̹̙̜̙̙0́
                }
                ҉̼̘f̥̯̼u̩̣n̢̪̰͈̰c͈͇t͔̬i̶̞͉o̶̗̻n̯ ̸T̪e̩̠̫͝(͖)̦͞ {
                    ̵̻͈̹͚̱r̫̖͝e͎͖͜t̗̮̝͇̪̘͢ͅu̗̬̖̗ṛ̞͖n̪͉̮̬!͇͖̗ͅ1
                }
                ͕͇̣̺̺ͅfu͓̣̟̞̳n҉̩͕͖c̪͔͉͟t͈̬̜͇̣̼̞͡i̬̥̜ơn̹̹ ̤̖Ć͎̞͕͈̟e̱͓̰̻̩̙(͠e̞͎̟̥, ̸ṱ̝̫̦̣)̱͚̘̺̬̝ {
                    ͏r̸̖͈̦͍e̛͔͉͇̦̬̣tṷ̭̬r͖͔̬̮̗n ̻̰͖̖̜̜͜e̶̹̫͔̗̣̪ = ̛̱̗ = ̴ = ̣͓̩̼f̻̺̮̟̺̲̪͡u̯̣͚̙̱͓̰ṇ̣̼͔̻̹̲c̝͈̹͖t͕̮i̕o̞͕n̷͙()̩̩͖ {
                        ̣̪̲̜͈̻tr̼̞̹̩̰̳̼y̢͙̦͎ {
                            ͓͔͓̝͈̘r̼̰͙̮̝̰̝e͏͙̖̖t̠̰͕̼̪̬͡u̟͓͍̣r̸͎͇̣̻̟͎n̘̬̤̙͟ ̶͖̬͚̮̫͇Ḛ̝̺̘̰.a҉̟͇c҉̱̪͉̟̝͇̜t͡í̫͈̘̘v͚̯̬͔̳̗e̦͚̱͓͓̥̳E̴̜͚̹͖̖̻l҉ḛ̷̮̗̠̞̝̝m͖͔e̦͓ͅn̡͉̗̦̳̤̘t͉͕̫̫͍̮͎
                        }
                        ͓̫͎̳̱͡c̼͈̀át̳̠͢c̻͘h͓̞͙̺̻ͅ(̘̼̰e͚̮̣̳)̵̯̫̟̠̦̪̜ {
                            ̴̼̯
                        }
                        ̫͔͈
                    }
                    ̼̹͉̯̲̳(̴̰͈͓)̙ = ̗ = ̴̜̺̣̭̺ͅ(̲̮̺ "͕̜͕f̶̱̪̫̯̖͍̫o͎̭c̦͔̠̠̫u̯̥̻ͅs" ̰̦͈͎̞̦͠ = ̦̯͍ = ̗͚̳ = ̦͈͚t̩͕͕͓̀)
                }
                ̺͍͚f̛̺u̯̜͖͎n͎͠c̟͙̻̘̞ͅṭ̦i̴͉o̧̱͉̖̲̲̰͍n ̢̠̭̝̥̖̦̺E͉̦̼e̖͇̮̹(̴̠̬e͎̥̖͇̤͙, ̹t̪͕̭͓͎̱, ͓ͅn, ͍̤r, ̷̣̞͚͈̖̖i͔̦͔̭̗͚, ̤̟͖͕̳͇̲o̖̻̘)̟̠̟ {
                    ̛̗̺̮̗̦v͙̤̣̫̬͕a̡̭͈̝̱͔͎r͏̬͔̥̪̲͚ ̝̳̩̞̀a̰,
                    ͇͔͙ͅs̟̝̥̭̜̣̦;
                    ͎͎̥̼i̷̦̮̳̭̤̫f̵̟(͖̦̲ "̩͕̻o̟̖b̴̜j͚̘͔̳e̴͇̹̳̝̳c͇̯͖ͅt̺̠̙̦̘̣" ҉͔͍̫͍͈͈ = ̭̯ = ͉͖̗̝̝̼t̡̹̦̰͕y͚̲͓p̼è̝͍̫̦̙͉ͅo͉̞̺̝̟f̮̲͈̗̪͝ ͉̲͕̖͖͔͝t̩͞)̯̻ {
                        ̟̳͎̳̬͘f̶̟o̷͇̻̠̪r̬͓̣͕̫̥(̷̻s͏̤͇̪͖̘̰ ̗i̪̫̘̳͠n̟ "̴͉̺̹̳s̴t̴̗̥̗̺̣̺r̪̗̗i̶̦͉̳̜͇̭ͅn͎͖̜̺͈͍g̦̜̺̞" ̪!͟ = ͔͚͚t̤͈̘͍̱̫̩y͕p̺e̖͝o̝̯͔̟͈͜f̢̘͖̪̥̳ͅ n̶̳͎͉͔̥̖͉ & ̫̻̪͖ͅ & ̢̱͙̺͎̥̲(͎͈̼͉r̬̖͝ = ̴̠͕̣̭̱͉͙r̛̫̺͕ | ̺̪ | ͏̤̦̞̥n̴̠̝̱̰̩, ̛̼̞̼͍n͏̹̣̙̮̼ = ̩͙̙̱̲̯v̞́o̲͓͕͉͡i͕̟͇̫̭d͍̜̱̣̳̹ ̫͟0̺̣͍͠)̭̺̰̲͞, ̯̭ͅt)̢̫̯̦̮̝̰E̴͓̳̦͔̬e̮̳͖(̺͈̻̼̗e̪͓͈, ̣̱͈̖̪̯͙͡s̱̱̰͖, ̗͜ṉ̷̙̲, ͚͔͙r̻͖̮̪͚̮͟ͅ, ͠t͈̯[̲̖͖s̻͈̞̰̟]̦̱̹̪͔̹, ͟o͈̟)̘͍̘͚̲;
                        ̷͈̖̘r̡̪̦e̗̭͉t̥̦̠̻͈̼̺u͎͞r̩͞n̯͎ ̘̘̣̳̩͖̠̕e̸̼̰̣
                    }
                    ̫͟i͏̘̟̟f̭̰̼͓̪(̴ṇ̱̞u̪̟̝͉ͅͅl̮̟l͍̯ = ̗̦͙͡ = ͉̠̟̫̞̮ͅr͍̫͈̝͢ & ̗̺͎͜ & ̣̬̻̫̤͖̟͘nu̻͎l̝̥̺͓̝l̟͕̦̺̫̱͜ = ͇͙͚ = í̙̺̮̖̻̩̥ ? ̢̰̟̮̣͙(͡i̸̦͚̺̱ = ҉̙̻̜̥̥̻͍n͔̘͚̜̹̘̩, ̨̪͎r̭̤̞͟ = ̧̟̦͔̮n̸ = ̨̬̜ͅv̬̣̺̹͖̲̩o̲͚͇̘i̵̼̝̤d̦̹̹͚͎͜ 0̦͔̭̮̘̝)͙̖̫ͅ : ̴̘̞̤̙̞n̢u͡l͚̳̳̲͚̯ͅl͈͙ = ͔̥̟ = ͏̞̻̹̖i̺͉͙ & ͎̫̫̩͈͎̜ & ̞(͎͚̼͎̘̪ͅ "̭̩̲s̘͖̦̰ţ̲̩̜͍̳̞̱r҉̯i̫̭͙̘̠̕n҉̜̝͎͎̺g͕" ̳͕͇͕̜̟͘ == ̨t̹̯̮̳̬͘ͅy̳̭͇p̪̹͡ę͔ò̬̰̺f̟͠ ͇̰̺̹̠̮͜ͅn̮ ? ̭̜̜͉̙̩̕ͅ(͖̱i͖̖̻͍̞̭ͅ = ̟̜̘̰͜ŗ, r̪̰̲ = ̗v̶o̙͖͓̘̳ͅi̟̤d̢̳̞͍̹ ̱͉̜̬̱͇̼0̗̮̙)͓͚̖̙̳̜̮͜ : ̪͈̰̝̭͎̪(̨̼͇͙i͘ = ͚͡ͅŗ̲̣͇̖, ̧r͟ = ͎̦̜ǹ̳̼̺̤͉, ̳̣̣̪̬́ͅn̝͚͕͇̥ = ҉̯̳̜̠vo̫͚͔͜í͇͕̳̯d̟̙̭̼͎͇ ͕̠̫̝͚̰0̲̺̦̫̰)̛̖̻̙̥̬)̺̭̜͉͚̫̘, ͏̳!̱͚̮̫̜͔̰͡1̦̫͜ = ̥̱̻̥̫̪̖ = ̙̗̙̟̹̗ = ͙i͚͞)̮͓͎̱į̹̞̩̠̰̬ = ̞̟͔͙̩̤͘T͕͞ͅe͇̦̻͡ͅ;
                    ̰̤e̱͈̖͓̙͚͞ͅl̯s̬͇͎͓͓͜e̡ ͓̱i͕̩̲̬̬f(̴!͎i)͍̰͍̳̠͓͓́r̷̤̤e̖̼̗̝͇͓t̵u͍r͓̦͔̤̝̳̤n̞̣͇͞ ̺͓̝̻͍̦̜e͈̫̯̩̥;
                    r̹e̗̪̕t̟̦̥̲̙͔ͅu̳r͖͈̟ń̻ ͖1͎̼̼̩ = ̮̗̮̘͔ = ̛̬̥͖̳ = ̰͚̠̱͜o̷͉̙̫̪̞̬̬ & ͈̖̼͖ & ҉(̙͉̳̪̯̼̝a͈̹̬̣̰̻ = ̖͠i̱̣͈ͅ, ̗̪̺̬͞(͕̝̙̬͠i̴̯̮̪ = ̮f̧u̖̳̠̝̜̹̰͝n̨c̹t͈̹̪͎̦̞͇i͏̞̘͎͈͇̮o̡̺̻̲͈͍ͅn̦̙̯̲͡(̟̮͍̻̣̺̲e̦̜)̧̺͓̱̝̙͎͓ {
                                    ͏̘͙̫̞r͞è̝̜̖̝ͅt͎͎̳̳ͅu̹͘r͠n̳͚̼̯ ̞̜͙̹̦̯̝S͍(͚̻͉̹̺̰̗)̤̬.̲̟͙̮̣͔̱͜ọf͔̩̘̺̤͍͚͠f̦ͅ(̝̩̪͚̬̩̻e̡̖̖͕̥̹̤)̫̝̪͕,
                                    ͙̲͈̜̪a̖̭͇̳̳̜ͅ.̣̮a̢͔͓p̝̹͓̼̥͙͢p͚͍͕̲͘l͇͇̼̩y̡̗ͅ(̜̘͢ͅț̕ḩ̗͉̟̝͇̤i̛ͅͅs͇̯, ̰̟̻̼̮͞ͅa̧͇̞̬͚͇̙͉r̫̺͝g̻̱̼͉͈͇̝u̧̱̬͉̹m͈̙̞͉͢e͓̲n̠̘̘t̘̖̬̳ṣ̴̖)̣̝̘͇͕͈̣̕
                                }
                                ̨̖̗͕͔͓͕̳)̯̘.̸̻͉̝̲̭̹g̻̝̗̣̺u͙͕̝id̘̠̳ = ̴̹̜̘̩̣̗͎a̻͈̱̹͍̙̟.̨͉̖͓̦̻̻ͅg̹̺͙͚͟ui̘ḍ͈ | ̵̲ | ͉̹(̶͈͚̖a.̶̻̻̯̭͖g̱̪͚̗͚͇͕u҉̗̹̲̤͕ͅi̡̟̯͖̙̥d̴̯ͅ = ͙̱̥̱̱S̨.̴̰̯͔g̨̰̘͙̯̳͈u̟̦̖̱̩i̵̦d̥̖̺̯̫̣̻͢ + ͙̖̜̖̘̹̫ + )̦̕)͓͙̼,
                    ̦͇͇̮̹̕e̞͝.̥̼̪̣̗̦ḛ̗̘̮͕̰͕a̯̟͎̯͜c̙̬͖̤̤ͅẖ̢(̝ͅf̦͚̞̱̩̬͜un͏̳̩c̙̫̟̟͕͇͞t̡į̺̘͎̤̭̰on̛̙̙̬̣͖͖(̯)̥̖͚ {
                        S̖͇͉̠͜.̰̺e̡͉͍̰͇v̶e̸̙n̳̼̪̞̳̦͉ţ͈̳̩̼.̗̖͉̰̭͍a͏̻d̷̥̟̘͖̜̰ḍ͙͞(̤̹̤͎̟̹͙́t̗̫̗̖̫͚͠ͅh͕̯̝̹ì͍̜s̷̱, ̨͕̬̪͍͓͎̰ṱ̸, ̭̟̫͉̟͝i̧̼̼̹̻̦̥, ̠͚̳̹r̶̩͓, ̷̞̼̦̩̠̹̠ṇ͔)̷͚̞͕̱̘̠
                    }
                        ̱̬̩͖̝̹)͓
                }
                ͖̱fưn͙̘͍̪͉̣̺c͍̝̫̙̬͚̺t̬i̤͉̘̺̟͕ͅo͖̟͙ṇ̨ ̛̜Ș͕̪͈͙̦̪e̙̣̲̪̖͢(͖̟̺͙̮e̡, ͏͍͖̠̯͈i͕̖̰̳͕, ̖̗o̱̝ͅ)̘͔̱̟ {
                    ͔̲̫͍o͎͖͈ͅ ? ̡̻̬͍̜̺͖(̛̜͍̺̦̥̩Y̥̖̘̻͓̩̯.̝͉̘̝̫͟ͅs͙͟e̱̝t̴͈̹(̡̪̲̞͕̼̣ͅe͉̲̣͙͚, ̸͓̱̳̻i̶͍̙̙͖, ̮̪͎̫̞!̷̠̤͍͕̝̯͓1̱̩)͘ͅ, ҉̠͓̭̯̫̪S̜̘̕.̻e̢͈͉̞̫̹v̭̥̞͚̜̱ͅḙ̶̺͎͇n͕̥͎̖͇͉̕t̨͇͖̠̻̝.̮͓̝͇̹͕a͉̯̮͕ḑͅḓ͉͇(͉̬̠̲̖̪̙e̥͓̪̦̺̟, ̙̳̻͠i̵̙̳̱̺, {
                            ̗̘ͅṋ̶̖̟̳ͅa̲m͠e̵̤̤͈̹͉̳s̴̯̲p̦̮̙̱̖̩͝ac̥͎e̢̪̙̮̬̰͖: ̢̣̣̖!̝͙̖̜͔̖̦1̠̰̤,
                            ̷͈͇͔̥ͅh̪̣̞̼̮̩̼a̸̝̦̮̩̻n̜̘̠ͅd̩͈̭̮͙̤̙͠l̸̬̞̬̜e̳̜̖̮͚͠ͅr̡: ̷̥̹͓͎̯̦f̘̥̥̬̤̻̤͞u͙̝̩͎n͓͔͕̮̜̘c͏̲͙͈̼̫̭t̰͕̰͠i͔̩o̡̭̭̣̫͍̟̠ṇ̱̣̬(̫͓̦͕́e̶͕͉͍)͇̟̹ {
                                ͖̹v̝̠̳̲a̴r͈͖͘ ̨̮̞t̶̘̼,
                                ̸̗̳̭͔̲n̘̞͍͓̘,
                                ̨r̦̪̼̭͡ = ̜̩̻̫͚̗Y̯̲̪̱̖͠.̘͜g҉̣̬̖͇̭̫e̺̣͠ͅt̖̩̦̰͘ͅ(̠t̶͎̠̟h͖ḭ̲̀ş̼̬̹͓͉̘, ̘͖͓i̗̥̟̯)͏̬;
                                ̰̹i͍̣̲̝̬̥͜f̝͍͉(̡̹̟̥̦̤1͈̳͜ͅ & ̰̠è.̧̦̭̰̗̱i̞̟͖s͙̼̜̬̤T̡̺̫͈̬̥r͏̬͕̣i҉̹̠̳̬̭̭̩g͚̲̫̼̮̪̜̕g̭̝̭͍̹̩̭͟e̤r && ͎͠t҉̬̺̗͈̘h͈̯ͅi̶̺̻̗s̤[̬̖̺i̘͉̝]̭̬̠̼̰̀)̙ {
                                    ̵̞̖̣̗̝͙̖if͖̰̬̯͟(͠r͜.͡l͉̳̲e̝͖̯͍̤̕n͔̘̹̠͕g̲̫̥͡t͡h̙͚)̝ͅ(̴̬S̭͔.̪̕e͉̺̜̤̝̩ven̯̬̦͎ṭ̜̠̝̼.͓͎̫̫̜̣̯s̛̫̣ṕ͈̱̗e̶̯̞̳̫̠c͎̰̯̯ia̤͉̦ḽ̩͙̬͉̗̜[͏͙̰͉͙̮i̱͡]̸ | ̘̤̠ | ̬͕̪ {
                                        ̙̹̹̖͡
                                    }
                                        ̦̞̺̱͙̘̼)̫̮̼̭͔.̠̻̥ͅd̞̞͓̘̙̰͞e͈͔͖̹̻͇͠l͟e͚͔͘g̨̺͚̮̪̬͎̱a̪̠̙͎̭̯̟t̩e̖͙̣̬̯̜T̜̳̬̠y̕pe̮̰̥̬̪̪ & ̢̰̮̯ & ̵̟͙̞e͏̲̥̲̺̙̝.s͍̟͇̟̗̯͟ͅt̜̦̯͢ó̱̦p̩͎̳Pro̧̺p͔̟̰͓̫͉͘ͅa͝g̼̞̙a̯̭̜̬̹͉̥t͏̰̹̗͚͓͔io̩̱̰̫n͓̟̬̤̞͉͠(̢̠͇̠̙͕̤)̻̤̥̀;
                                    ̫̝̭̘ͅel̲͇s͓ḙ̱̣͔̥̱ ̫̱͜i̘f͚̝͇̭̣͉͖(̟r͎͙̟̲̲͘ = ͔̝͕͇̬̰̖͟s̶͓̩̘͍̦̳̩.̼͓̣̱̳̝ç̫͖ͅa̜l͚͈͈̪͕ͅl̨͔̥̫͓̰̣̹(̸ar̳̲̭̫g̖͖̠̻̖̪u̜̖͖̞̝̫m͘e̗̹n̶̫͈̱̠̫t̝̠̠̭̲̺̭s͎̩͎ͅͅ)̬̹̜̗̤̯̘, ̳͙͠Y̭̮͉̼͍.̤͎̰s̝̝e̱͎̹̜ͅt̨̫(̡̘̮̼̤̠t̗̘̘h̪͍̣i̗s͉͖͓̹, ̲̪̠i͉, ͇̲͠r̢͍͇̗)̸͓͔͈, t̟̠̘̠͈̩ = ͙̻͙̳̻o̪̙̺̞̙͞(̪̱̥t͉̼͓͎͕̗̀h͏̝i͇̰͙͞s͝, i̤̣ͅ)̳͍̥̫̤̤, ̼̺̘͝ͅt͞hi͕s͖̱̪̻̰ͅ[̴͉̲i̭̲͓̦̩͍͙](͓̱̼̺͕͟)̲͔͇̳͙͡, ̙̤͖r̜̞͙!̛͇̹͈ = ̹ = ͓̜̙̩͖͙͢(̷͈̝̞ͅn͕͔̬̪͘ = ҉̞͎̦̖̜͎Y̶.̻͇̞͔̖͎g͕̫͙̕e̳̖̦̬͉̖t̜͔̫͞(̼̯̪̠ṯ͙̠͈h͓̜̮͈͠is̻̝͎̪̣, ̘̥̭̩͖͖̬i͖̥̣͕͙͉))͞ | ̘̞͈̰͓ | ͕̻̖̻̹t̹͇̲͈ ? ̪̩̮̘̣Y̭̟.s̷̙̤̼̦et̻͙͍́(̧̜͚͙͙t̬͚̬̖̥͟h̤̘̮͖͍i̵̮̤s̙̺̳ͅ, ̥͎͉̲i҉̗, ̟͕͖̙̗͓͙!̼͍1̞͙̦̱̥̪)̢̫̘ : ̼̲̖̩̣̕ͅn̫̭͜ = ̢̠͇̦͔̖̜ {
                                            ̺̙̠̤͔
                                        }
                                        ͖͍͖̼̰͇, ͙̭̲̘͜ṟ͚̫͔̟̹͓̀!̵̜ = ͇̰̜̝ = ͕̦͇͖̖͉̣͠n̫̖)́r̨͓̱͉éţ̠̥̝̻u̹̣r̫̫̖̹̖ͅn҉̭͙̫͇ ̹̼̥̝͚͚e̛͖͙̪̠̜̙͎.̷̹͕̥̺̯s͈͎̰̠t̹̼͔̱͜o̫̟̟͙p̷I̩̞͖m͈̥̳̗m̡̱̯̳̙̤̗͔eḑ̥̭̞̝̖i̝̳̤̻̟̮a͏ṯ̶͎͉̳̝ͅe̺̣̫̮̝̕P̻͓̫̭̺͓͘r̷̝o̟̯̮͙͚̩p̬͡ͅa̢͕̫̖̪̤͖̯g̭͍̥͕͢a͔͎̪͍t̘i̸̫̘o͏n̳͎̩̜̘̕(҉̺)̩͘,
                                    ̢̠e.̻̬̤p͏̰̳̝̲r̝̝͚̥ḛ̙̮͇̙̰ͅv̫͍̝̮̖̭͝ȩ̫̟͖̺̗̥̹n̼͈̺̳͈̤͚͘t͇̗͕̠̣͠D͉̯̳̫͚͚̻e͇̻̹̟̮̥f̟͔̳̠̹̘̘a̤̰̳̟̳̯͇u̶̬̺̺͈l̬̻̺͚̕t̠̫͉(͚͘ͅ)͕̻͙̗̮,
                                    ̯̘͎̹̲n͈͙̖ͅ & ҉ & ͖̖̥͉̝n͖̟̘̼̦͢.̺̬̺͔̕v̸͕̝͔̰̭á̭̦̦̖̪̙l̙̰u̥͙̯̮e̮̺͖̩
                                }
                                ̲̥̩͕͞e̸͙̟̫͔̦l̫̙̞̬̩͡s̝͚̞̤͕͙è̺͚̦ ̹̬͕͜r̙̮̱̝̼.͙̦l̝̞e҉̙̤̣͙͕̫̖n͙̦͙͙g̨̩̜͇̤̰̤th͔̤͉ & ̱̮͍̮̼ & ̯̩(̙̩͙͔̜Y̵̦̪̰̼̰͈̬.̳̼̺̺͉s̷͈̠̖̳̘̤e̙̱̣͎͘t̨̖̖͈(̞̺̞͎̯ͅṱh̺̘͕i̞s͙̳̟͇͙, ̩̳̯͝i̟͈͈͉͍, ̙̖̥̫̪͉͙ {
                                        ͖̣̭̖̜͖̳͠v͈̗̖͙a̳͖͈̫̝l̵u͇͙̰̞e̟̥͟ͅͅ: ͘S͉͢ͅ.̶͍̫̦̙̺e҉v҉͙̺͈̼ͅén̟t̞̝̞̹̜̕.̟͇̜̠̥̙t̠̮͍̜r̳̦̖̲̥̰̬͡i͔̘̮͉͓͓g͍̪̬̺͕̞̺ģ̺͖͙͚̘͎̪e̵̫̱̥r҉̤͖͙̼ͅ(͓͘S.̟ę̪x̫̯͟t͇̲e̙̯̩n̥̜d͎̫̺͈(̜͎ͅr̡̗̠̘̼̼̱[̝0͎]͇̗̮̣, ̡͉S̮̖̬͡.E̙̣v̥͇͎̻̬̻̙en̡͚̼̙t̡̖͇.̥̻̟̤̻͡p̮͙̰̞͝r҉̱̯̫ó̼t̷̫͓̻o̩̙̝͙̕ṭ̮y̦̙͍̘͈ͅp̶͔̱̰e)̙͖̠͎͡, ̲̱̮̬͘r.̯̰̱́ͅs̠̯̕l͈̭i̻̰̟̫c͍e҉͓̙͈̗ͅͅ(̲̟̮͔̗̲͈1҉͎)̢̱͚ͅ, t̳̭̠̟͎h̶̜̮͔̻̯̲i̘͈̖͎̙s̟̬͞)̫
                                    }
                                        ̲̺̤̻̩͉)̵͖̳̝͙͔͙, ̘̘̭̲̪́e̶͕̠͓.̸̪̟s̲̳̼̠̙͔̼t͈͇o̭̠̲p̱̺̩̭̤͘I̙̕m͎͞m͔̙e͏̦͎̩͙̫d̺̭̻͈̪ͅḭ̴̤̪ͅa̤̞̬t͚̱e̤̺͔̞̲ͅP̪r͕͍̻̙͉opa͖̰̦ga̱t́i̗̤o̪̰̼̮̦ͅn̖̟͎̩(̛̩͓̫̪͍̳̥)͓̣̯̹̻)̗͚̲̜͍
                            }
                            ͏̫
                        }
                            ̭̣̀)̯̮̜̦̞̰̤̀)̫ : ̟͓̗̭͙v̼ò͚̻̘̯̤̻i̱͖̰̼͟ḓ͙ ̳͝0͎̳̳̣̺ = ͉̥͈͎̩̖́ = ̢̳̻̥ = ́Y̹.̴̟͎̝̫̳͎g͍e͎͇̼ͅt̖̳̭͈̺̫(̯̘͜e͕͉̖, ̗͕̭̠ͅi̶̩͕͍̳)̪͓̫ & ̛̤̳̞̮͍̯ & ̺͇̪̞Ș.͚͕e͓͎͡v̖̬͖͞e̴̬̲͈̠̬̦ͅn̶͉ṱ̩̲ͅ.̩̻͎͟a̘͉̤̤̺̤͞d͝ḍ̢(̯̰̖̥e͟, ҉͔̟̗i҉͓͈̯̯, ̣̼̙w̴̦e̫͙͖̟̹)̙͙̤̖̫̮͙
                }
                ͓̮̭̱Ṣ̺ͅͅ.̯͔̫̰̦͠e͏͍̙̠͉v̢͔̻͇͈̬͔̘ę͍͎͍͈n͈͉̲̹t̤̞͢ͅ = ̸̻ {
                    ̜̲̀g̝̹̖l̬͉̜͡o̳ͅͅb̷̼̹a̵̳̙͓̙̝l̲̭̻͠: ͔ {
                        ͚
                    }
                    ̡̙͓͚̦̫ͅ,
                    ̰̖̻̙a̠̠͖d̨͙͈̜̪͇͓d͘: ̢̤̮̠̩̞f̭͓̬̫͎̜ͅu̱̰̹̕n̴̤̪͙̹c̥͙͙t̢i̷̯̯͖ͅo͏n͈̺̞̫͝ͅ(͔̬̯̦͙͠t̰̫͖̣̦͖̜͞, ̼̙̪e̬͇̼͝, ̡̪̫n͍͇͉͖̦, ̘̼̯̰͘r, ͉͉i̡̙̹̦̯̻̩̬)̹̱̺ {
                        ̙̤͚̺̬̪v̭̻̝͓̗̰a̹̝͖̬̦̘̠r̵̼̘ ̖̮̯͚̫͓̕o҉͎̬,
                        ̧a̫̪͍̳,
                        ̱͉̖̻̹̗ͅs̨̞̼͉,
                        ̤͚̩̣̰̣ͅu̡̘͇̲͇,
                        ̙̗ḽ̠̺͓̞,
                        ̰̥͙c҉̼͍̲̱̖̪͉,
                        ͎̠̻̞̠̫̖͡f̭̩͍̹͕̳,
                        ̡̞͍͔̲̭̣p͏,
                        ͈̗͍d̥͍̮͚̰͇̕,
                        ͕̩͓͔̗̹͍h͔͓͚̺̹͕̞,
                        ̵̞̥g͕̞̦̗͍͡,
                        ̙͎̦͇v̱ͅ = Y͈̕.͙̜g̷e̲͍̻̘̻̲͞t̲̭̙̯͎̱(͕̹͖̘̦t͚ͅ)̖̕;
                        i̘̖͙f̶̺(͕̮͎V̤(͍̳̜͝t͕͕̜͟)̼̻̻̬̬͠)̶͖̩̮̜̳̩ {
                            ̰̼n.͏h̥̠̲̻a̖̳̞̠̦͠n̸̪̜̳͔d̞͍͇̯̗le̮̜͘ͅr͈ & ̺̞̭̻̻̱̖ & ̖͔̦͚͔̤̗͝(̢̯̠̰̼̙̜̫ṉ͍̭̱̤̼ = ̥͙̫̭͕̝͕(͖̫̲̦̜ͅǫ̝͖͎̝̯͉̙ = ̶̳̝͓̤͚̦̫ṋ͎̮̥̘̬͙)̸̖̫͚̝̜.̱̥ẖ͕a̦n̲͈̟dl̡̜e͍̱͈̩͡r̘͇̹̺̗ͅ, ͍̯̘̞i = ͚̀o̢̳̼̗̹̥̻̗.̲͕̹̺̬̥ͅs͏̻̥̬͔̮͈e̬̠͓ļ͉̟͖̭̠̩e͕c͎̣̙͇̠̰t̞̲͡o͏̹̭̗̼ṟ͍͠)̝,
                            ̷̥͖i̟̲̝͕̕ & ͇͞ & ҉S̟̥͝.̩͟f͉̲i̭̙͇͎̬̫̥n̴̝ḏ̺͚ͅ.m̵̫̙͓ą̳̝͙̺̟ț͎̙̜́c̢̲̖h̪̤̬̟͠ḛ̞̲̳s͓̪̦͈S̮͉̗̟̯͇e̩̙̞̼͍̲le̙̣͙̤͠c͇t̯̹͚̤͕o͇̰̦̰̥r̢̤(r͕̹̰͓̞̖ͅę, ̦̫̻͜ͅį̦̜̩͔͍)̭̟,
                            ̧͇̻̰̗̼n̗̳͔̣͉͘.̷͍̤̻̯̬̰͔g̣̥̺̝͖̯ú̠̟̗̥̞̖ͅi̫̼̼͇̭͚ͅd͉̞̹̭̬ | ̶͙̟͉ | ͖(̪̪̖̮͓͉̳n͏.̟̙̞̞̕g̰͕̫͔͉u͇i̭d͏̹̗̰̝ = ̳͉̞̳̦̦͜S̫̰.̺̫̼̱̣ģ͖̞̗̦̦u̴͉̟̖̬͕id͕͢ + ̙̝̼͕͢ + ͇̥̻)̧͖,
                            ̳͇̺̩̪̜(̮̱u = ͚v͈͖̳͜.̰̦̭e͕̲̪̮ͅv̨̙̙͈e̥̗̹̻̭̤̕ǹ̖t̫̳̘̩̹͍s͕͎̥̤̝̥)̶͇̠͉͔̟͚ͅ | ̵̯̹͕̬̮̰ | ͕̱̩̙(̮̖͜u̴̫͖̞͖ = ͔̬͕̦̖̻̘͡v͍̘̙̞.͞e͈̪̘͔͕̕ͅv̰̥̫͉̱̝͈en̬̻̺͎̦͖͜ṱ͚̭̠́s̫ = ̻̫̜͓̺O̤͈͖͈̩b̻j̨̭̤̹̦̠̱̟è̬͖͎̲c̲̹ṱ̙͍͎̪.͕͙̟͖̼͡ͅͅc̟͘r̡͎̟̭̤e͏̙ͅa̶t̲͖͕̗̦̠̱e̵̞̞(҉̜͈̰n̲̙̺uͅl͔͇̬̱͍͡l̹̱)̱̰̝)͏̯̟̞̜̩̲̪,
                            ̰͙(̭͎͎͈̘a͇̖͉ = ̪̻͔̙̮̩v̝̪̩̤.͚͙̱́h̠̺̭͚̥͙͔́a̺̮̪̟n̠̯d̪͉͍́l̦̬̤͎͉̜̗͞ę)̢̲̭͚̰̘͈̦ | ̵͓̘ | ̨͚̦̜(͎̲a̭͍̹͞ = ̧̼v.̳͔h͈̘͕͡a̫n͕͓̩͓͇͓͕d̫͎̘̟͍̣ͅl̡e̷̠̩̲̮̞̪ = ͏f҉̗̼̪u͙͍̙̮̭͖n̷̤͓̹̟͕̫̭c̟ț̘̯̖̗͔͜i͙̭̥͈o͙̙̜͕͖̗n͠(̻̮̬̙̱ͅe̖̬)̦̟̣͉̰̞̥ {
                                    ̮ṛ̸͚e̛̹̘͓̳̣͓t̥̦̪͉̝u͚̦̼̫r̡͎͉̼̖̩͉̹n̲̞͖̼̦̦̩ "̺͖̻͚̪̘͖u̠̯̗͚̭n͍͓̣͕ͅd̛e̤f̸̜̤͕̬͍̲͎i͍͙͙͎̬͢n̦̘̞͚̫̫̝e̯̲̰̱̬̳̖͞d̥̝͇̰" ̵͙̦͉̪̫̟!̞̲͍͟ = ͔́t̷͇̘̬̼͉̯̼y̻̬̯͕̙p̬͇̝̝͎̪eo̪̲̤̤̳̩̞f̴ ̧̱͈̹̻͇S҉̦̼̫̺̺ͅͅ & ̨̣̹͍̱ & ̨̰̠͈S̷̟.̘̼e̳̹̰͍̬̺͝v̞e̟͈͟n͢t.͕̝̱̠͍̟̀t͚͔ͅr͎̪͇̠̰͖i̛͖͈̤̹̪g̘͓͚͈̜g̴e̘̜̟͙͍͝r̟̫̺̺̻e͕͉̯̙̻d̨̮̪!̫͍̥̘ = ̮̝̫̟ = ̣̱e̙̹̼.̨̲͈̻t͉y̢̱͉͎̣̝̪̪pe͘ ? ̮̀Ṣ͇̘̘ͅ.é̠͙͙v̴̳͖̫en̪͔̕t̪̮͝ͅ.̰͉d̜̺̭͍i̭̩͕s͎p̵̭a͓̪̯̺̗̖͟ͅt̖͖͍̬c͏̳h͏̩̩̦.̱̦̀a͈p̸̼͈p̨̬̜̤̘̩ḷ̢̘̹y͈̭̘(t̮͎, ̣̞̞͠a͉̤̳͕͠r̫̟͙͞g̫̗̜̤͉̱͝u̘̳mé͎̗͔̜̩̠n͍̲͈͎͔̗̝͘țs̀) : ̫̯̟̟͚͓͟vò͓̮̜̘̥̣i͈͉̫̫ͅd͎̦ ͇͕͕͈0̴̠̤
                                }
                                ̹̭)̳͚̰,
                            ̹̥͙̥̞͔l̠̟͕ = ̫̺̞̞̖(̲͖e͢ = ̵(̱̯̪̯̳̮̼͟e̼͓̤ | ̮̬ | "̞" ̸̭)͓̮̙͕̯̘̭.̥̼̜̼m̭̠͈̥̱a̡t̟̳̤͎̫̫ch̻̙͚̹͜(̮͖͡P)̦͟ | ̨̻̲̼̭ | ̛̮̻̬͎[̯̗͚̝̞̀ "̬̲̩̞͖̥" ͏̘͖̜̰͔̣̪]̹̗̳̟͡ͅ)̪͙.l҉̩̹̣͍̻ḙ͕̳̼̺͔̙n̝g̷̺̙̻̻͖̟͇ţ͔̮̞̬̠̹h;
                            ̗͎̭̙̣͉͟w̯͎̳̻̙h͇͉̣̦̮i̮̼̺l͚̖e͘(̶̖̺͕̫ĺ̪͈̳̰̩ͅͅ - ͓͖̗̙̠͙ - ̟)̦̲d̴͇̝̻̼̮͕̱ = ̸̫g̟̝̼̜̥̳͙ = ̢(̙͇̀s = ̡̞b̢̠̝e̫̣̳͠.̷̪̞̙e̜͔̦x̬͕̭̼̞̬e̜͕͉͍͝c̶̻(̸͉͎͙͔̖̼e̮͍̘͓̰̯͜[̢̙̗͓l̰͓̝̀]̫)̻̻͚̥̝̤̯͘ | ̺͎̖͇͟ | ͈̦̺̰[͈̰̦̫̗]̗)̷̰̯̙̺̜[̬̤1̱̰͔̠̱̲͎],
                            ̼̙h͕ = ̴̺̻̤̫(͓͉̩͔̯s̲̥̜͡[̛̲̥̖͇2͕͚͡]̡͚̥̣͕ | ̪̪ | ̭͉̼̲ "̳̗̘̣͝ͅ" ̶͇̥͚̺)̵̞̲̫.͓̩͚͕͇̹͟s̼̠͙̙̤̠pl̶̜̗͉̝̙̻̪i͍̹̹̣̼͖͚͢t̠̞̤̲͜(͕̠ "̲̩̭̪̲̘͘.҉̖̹̠" ̞͓̪͔).s̲̯̲̺o̷̘͖̪͎r̟̮͔̟t̮̱̩̺̱̗͎͢(̲̤̜)̼̕,
                            ̵̥d͖̗͈̜͙̞ͅ & ̟̭ & ͕̳͎̱͚̀(̹͍f͎̺̯̤̘̬͡ = ̵̱̣̳S̵̤̩.̗̺̪͚̥͚͟e͎̝͉̩͍̞̣͡v̪̼͚̤̘́e̗͟n̵t.̥̞̱͇͔̟͕s̩͍̱̙̗p͔̤̻̼̰͚̠ẹ̯͢c̨i͕͔̦̯̩ͅà̮ĺ̥̥̥[̫̗d̥̥̩]̶̺̻̙ | ̨͚̰̺̬̬͔͉ | ҉͔̲͉ {
                                    ̖̙̫̯̞
                                }
                                ̧͓̥͕̟, ̳̝͚͕͇̘d̫͈̼̖̹̥ = ͇͙͢(̶i̭̮͔ ? ̘̟͍̘͡f͏͓̤͍̘̬.̸̪͖̯͍̼͉d͕͓́e̥͖̯ͅl̸̟ḙ͔͎͔̬͘g̸̘͖̜a҉̥̻t҉̩eT̥̜̖̜y̢̰̝͙̥̬p̞e̦̘͡ : ͅf̨̼̠͔͚̗̭.͞b̢̙͕͈͖į̥̥̜̬͕̝̗n̝͡d̩T̞͕̲͖y̪̰̝p͜e̦̩͝)҉̬͎̬̜̯̗͔ | ̟̜̪͎ͅ | d̠̥, ̟̻̟̺f̰̙͍̣ = ͢S̮͓̻̞͖̻.̡͓̜̗e̗̝̞͙̭͔v̹̳͔̘e̠̦̤͇̦͈n͉͈t̪̱̟̼.̨̞̬͕s͈͎͉̬p̴̜e̟̘̭̞͍͜ci͏̹̤͈̯̰̭̫ḁ̧͇ḻ̥͖̠̹̗[҉͎d̶̬͖̰̖̪͓]͙̪̪͍̤͚͓ | ̦̥͓̯̭̱͘ | ͓͚͔̖̠̰ͅ {
                                    ̲̞̠̜͕͔̕
                                }
                                ̳̱̫̜̲ͅ, ̸̜̭c̵̱̦͕̺͕̳ͅ = ͇̝̤̠̳̭͝S̶̘̳͖͈̤̜ͅ.̤̫͞e̶̼̘̹x̴̦t̛e͈̙̠n͙͈̲̻̥̳͚d(̥ {
                                    ͇̲͠t͎͡y̥̩͝p̖̘͔̥͙e̸: ̩̜̙̖̰̬ḓ̣̟,
                                    ͔͓̲̗̙̥͕o̼͓̦̮̲̩̫͡r̰į͕̪̘̠̞g̺̬̲̟͎̱Ț̸̺̘̠y͉̠͖͓̞̤̤pe̮͈̬͔̞̣͠ͅ: ̫͓̖͇͎͙g͏̬͈͖̖̳̫,
                                    ̞̘̹̼͠ḏ͕̩̘̘a̻͠t̥͙͎̼͓a̯̯͙̣͟: ̼̠̗ͅͅr͚̞̠̦̤͚,
                                    ̣̬̩h͏̮̝a͔̣͎n͔͚̪̳d̠̰̯͜ͅl̫̳̪͓̺̟̰e͚̮̼̯̯͡ͅr̫͇̭̠͝ͅ: ͖̮̝̮͢n̫͇͍̳̼̙̮,
                                    ͎͇̘g̫͈͇̖͔ưìd̥̺͈: ͕͍̹̰͡ṉ̠̻̹̥͜.͔̤̟̬̠͜g̛͖͚u̜̝͔̲͇i͖̦d,
                                    ̸̹̜̰̫̼ś͙̻el͇̠͕ec̨̥̭̩̼ͅt̘͉͙̖o̴͓r̪̳͈̮͉̱: ̮̯̬ͅi̜͙̞͓,
                                    ͙̩̝̘́n͔ͅe̡͍̫̰̙̬̥̱e̥̜̳̼ͅd̛͙̰̗̪̞̘s̢C҉͖̰̤̻̦oń̮t̝e͈̜̪x͙͖t̹̫̜̮̪̪̝: ̘̘̲̜ͅͅi̠̗͘ & ͔̩̩̺̲ & ̻̩̝̣S̵.e̴͓̯͔̠x̧̱p̸̠͚r͎̲.̘͚͔m͖̮a͉̱͟t͚̠̰̞̝ͅc̼̙̜̖̫͞ḩ͕͈̜̥͓̘.̠̥̟n҉͚̹̞̱͕̩e͇̝͘ȩ̼̻d͉̫s̫̣C̶͇o̝̖̼ͅn̺t͈͢è̠̫x̲̯̮̫̭͙͢t̷͈̳̭̳̮ͅ.t̛͔͇̰̳ͅe̙͔̖̼̥͞s̨̻̟̜͎t̛̙̳̯̤(̼͈͟i̖̣)͇͍,
                                    ̲̺́n͏͓͙̪a̩͕̪͝m̧̹̩̼ȩ͉͍̬̳̻̻̞sp̶̲̟̭̤̙a҉̣̲̮c̺͈͇e: ̥̠͚̥͘h̰̠͉̰͈̺.͓͕̲̥j̱̝̟̖o̖̟į͍n̷̫(̀ "̝̜̠͇̗̘͔.̹͔̙" ͔̹̥͈)̶
                                }
                                        ̩̬̰, ̶͕̲o̙͚͍̪̼͡)͇͍͇̹, (̹̗̘p҉ = ṷ́[̭̘͈̦͞d̯͍̕]̮̯̳͈̻)̞̘̝͈̗̯ | ̰͎̳̜͠ | ̨̖(̻͙̙͚̱̱(̤̲̞p̺̰͙̮̜͠ = ͙̟̗̗̀u̻̤̼̜͘[̴̖͙d̯̫͟]̘̙ = ̟͍͈͚͕̰͚͘[̹])͜.̷̖̥̗̖̘͈d̙̟͇̝e͇l͙̹̰͇̮̳̺e̡ͅg͇̯̩͙͡ͅa͚͈͍̪͔̖̘t͇̣͕̼̲̲̬e͏̘̟͓C̷̳̺͍o̟̣͈̰̝ͅų̹n̶͚̟t̲͙̻̜͡ = ̨̳͉0̱̫, ̥̩͖f.̞̠͔̦̲̮s͈͖͍̲e̸͍̩̟̼t̠͇͎͈͞u̷p̸͚̱̻̜̯ & ̯̦̲͓̹̼̠ & ͙̮̝̺͇͎́!̯̤1͏͕!҉͓ = ̦̜̱͝ = ̣f.͍̯s͕̲͚̲̻e̪̯̞̟ṱ͢u҉̲p͝.̰̠̻͈c̞̟̬̩̲̻ạ̴̮l͕͉l̶̪̝̱(͜t̼̦̭̳̲ͅ, ̨̺̥r͏̤͕͍, ͉̫̳̜̰̠h͖, ̶̰͓a̷̱)͈̀ | ̭̞ | t̫̀.̬̼̥̥a̵͍̮̹̹ͅd̼̙̰d́E̢̙̪̲̠̙v̜͚̺͙͔̫e̗̫̪̞͢ṉ̹͉̣͙t̮̻L̰̣̖͍̬̖̻i̧s̛̰̘̝t̪̥̖̗͇̲̮͘e͕͙͔͓̩̯n̬̺̬é̦̫͎͇̲͙r̡͖̼̪̠ & ͕̣͙̥ & ̬͍͖t͕̹̥.̺̯̰͓͟ą̲̤͈̯d̹d̪̦̖͝ͅE͕̳v͓͖̳̖͉̫̮e̜͕̞͖ntL̢͖͔i͎̰s͎̜̘̱̼͚t͏̭͎̝e̫̜̘ͅn͏̞ͅé̥̜r͖͎͔(̥̼̱d̟̰̟͚͚̗̳, ͚̕a͙̹̥̟͙̰̺)͉̙̝)҉̼͓̥̬̝, ̗͕f̡͙͙.̘̼̼͖a̴̦̲d͙̗̦͘d͚͠ & ͜ & ̘(̶ͅf̝͈͎͓̲.̢̺̲͖ad̶̘̘̰͎͓d͍̩͝.c̞̙̼͕͠a̳̝̲̦l̖̤̘͝l͕̪͞(̵̬̻̙̭t̟̲̮, c̘̣̲̞̤̘̘)̬͉͈̯͉̮̼͘, ̟̞͇̫̪̞c̦͕̠̲.̳̳̯h̼̀a̴͕̰̳̰̣̯͎n̳̯̗̼̤̦d̠̹̭͉̥͞ḽ͝e̬̣r̠͚̤͖͍.̬̲͉̲͙gui̮̰̹̞͟d͔̪̞̖̖ | ̪ | ̬̳̬̲̝̭(̪̹̼͍̤̥̜͡c̣.͚͙̭͕h͈̟̮̹a͕n̙̦̞̲͎͙͠d̙ͅl̀e̩͎̝̣̗̫͡r͉̳͈̗.g̖̫̖u͜ì̬̩d̢͙͓̱̬ = ̰̳̤̞͉ͅņ̠͕͇̰͓ͅ.̬g͉̰͓̦u̜̲̹͈̮͢ḭ̻̫d̸̖)̝̩̭̖̩̦̕)͏͕, ̧͎̣͕̖i̼̝̠̮̖ ? ̲̪̰p͈.̮̱̹̻͍s͔͘p̕l̛̥̘̮i̗̖͓̬̙̫̣c̩̠e͓̯̖͢(̨̲̝̮̱͈̮͈p̵̱̫.͕̜ͅd̠̜͔͘e̸̳͕̗̩͉̩l̵̟͚͔̥̺̱ę̹͇̯̭̘͔g̡̯á̘̜t̢͎͕̣̠̩ȩ̩̠̣̯̬̟̹C̮̖̩o̲̞͇u̥̬͉̹̬̦n͙̜̤̬͚̫͝t̥̰̻̙̲ + ͡ + ̡̬̥͕͙, ̧͇̺̻̥̝͖0̩̱̰̻̻́, c̻̲̣͔͜)̙͘ : ̺͖̪̝̼͇p̧̙̺̭̗̝.̦p͡u̗̭s̹̜̤͖͓ẖ͈̫̀(̨c̜̮̻)̬̫͎̤̕, ̻̰̪̰͖̕S͈̺̦̞̞.̸e̘͕v̥e̟͔͔n͎̯̪̦t͏̫̺̺͕.͉͘g̻̦̥̙͇̳l҉̲͉̙͇̠̳ͅo̳͍b͏̳̱̲̹a̯̩̜̠l͏̗̟̪̖̱̮[͉̫̭̲̰̦d̜͇̖̦͇̪̥͟]̡͕͉̹̯͔ = ̣͖̫̙͖͠!͔̦̗̮0̷̯)̺̬̣̀
                        }
                        ̴͉͚̖͍̲
                    }
                    ̩̘̝̠̯̥͟,
                    ̛̠̳̟r̺̬͟e̦̣̱͔͕̮m̖̥̕ó̜͚͉v̠̰e̸̗̲͚: ̨̣̳̥̲̬̹͓f̟̱̩̭u͟n͕̲̝͠c̺̫̩͓͚̕t̖̱̳i̸̼̱͉̞̣̺̘o̵̤̮̥̺n̥̼̜̪(͕̰e̠͍͖̣̤̞̳, ͖̬̰̝t͇̗͔̱̹͠, ̱n̦͖̭, ͎͙́r̯̗̖̟, į)̢̹͉̟͓͚̲ {
                        ̡v͟a̢ŗ͚̼͓̰ ̟̀o̶̗,
                        ̴̮̮̣͚a͈͓̬̭̺͕,
                        ̹͍s̗͉̻ͅ,
                        ̲̗̝̗ų̱̩̹͖̮̻,
                        ̲͈l,
                        ́c̜͈̩̩̠̝̕,
                        ̪̹̗f͙͚̹̬̀,
                        ̳̠͚̜͜p̝͇,
                        ̪̳͙d͉͕͟ͅ,
                        ̰͓ḥ͎̻͍͍,
                        ͏̠͎͚g͕,
                        ̸͉̪̰̘̬̙v̫̬̳ = ̹͔̙̙͘Y̗.͖͕h҉̜̲̯ͅa̲͚̟s̤Ḏ̼̤͔a̧̰͙̩̟ta̹̺̜̕(̦̙̲̹͓̠͘e̵ͅ)̻̩̬̀ & ̷̦̻̹̥͇̫ͅ & ̮̳͙̻̟̼͈Y̘̥̮̳̣͙̱.̯̺̝ͅg̜͖͍͙̙ͅͅe͏̥t͇͚̻̖͔̮ͅ(̶̻̗e̦͓͖);
                        ̪̗͈̗̠̫̱i̵f̢͖̬(̧̦̠̫͇v̙ & ̨̱̳͔̩͙͕ & ̴͖(̤̟̹ư̹̰̳̦̠ = ̯̯͍v̻͔͓͓̜͖̺͠.̝͖̞̠e̦͓̥͖v̢͙͎ę͕̮n̙̫͔͚͇͙͞t̮̻͎͚s̘ͅ)͖̣̙̱͔̥͓)͈͖̰͇ {
                            ̺͎͘l̯̱̞̫̬͞ = ̸̙̜̺(̜̥̹͇̱t̜͕͕̱ = ̙͚̱̼̭̲͟(̢̺̥ṯ̳̤̥͉̱ | ͓̮̙ͅ | ̵͉̞̥ "͇" ͕̲̠͎͍)̮̠͍.̩̞̬͢m̭̻̟̟͡ͅąt̗c̨͚͙̥̩̰h̝(P̫̮͠)̠͎̼͎̞ | ̤̯ͅ | ͓̥̥͙͉͜[̗͉͇ "҉̝̲͎" ̡̹͈͓͙]̯)̝̯͉͚͜.̩ḷ̢̫e̯ͅņ͚͎g̶͍̥t͟h̵;
                            ̼̤w̛̭̯̥h͈̖̼̠ͅi̱̖̱̕l͖̙̀e(̛l̞̙͍͈̰ - ̛̰̤ - ̤͎̹̘̳͈̙)̶̱į̗͇f̺͎(̶d̠̖̮̹͈ = ̛̙̤̣̬̥̹̹g̷̤̬̠̠̪ = ͉̼̟̯͎͉͜(̯̟̦s̮͈͎͓͎̹ͅ = ͔̦͙̮̮̞̺b̳̣͕̲͍͖͇e̘̤͔.̘̯̗̺̝e̵̙̰̭̘̙͔̰x̖e̵͇̙͍c̥̳͉(̣͢t̺[̭̳l҉̣͙]̢͚͉̟̝)͖̟̪͈ | ̘͈̱̖̫ | ̴̜̠̰̝[͜]̤͓̹͖̱̺)̵͓̪̤͕͔̤̘[͚̞̮͙1̱̠̖͞]̹̰ͅ, ̨̖h̹ = ̥̞͉͎͕̝̕(̗̙̫̩̺s͉̞͔͖̯̣[͟2̟̳̻̜̟]̩̥͚̤̫ | ͓͍̜̦̠ | "̱̪̙̦͔͔")͓͓̩̫́.̮̻̹̥͓s̯̫͈̹̟̗p̩̦l̼̳̜̫͓i̖͔t̺̹̤͘(̪̮̦͚̻͝ "̺͇͓̼̖̗̭.͇͍̮̠̹͢" ̷̮̩͕͓̲ͅ).̦͔̦̬̼̹s͕̼͙̱͟o͍͚̺͚r̥͕t̮̮̠̲̱(̴̹̯͎̬̟)͍̤̱̫ͅ, ̹̙̲̻̰d̸̞̟̲̲)̠̲̞̰ {
                                ̝̭̝̦̹̱͡f͈̣̫͈͔͚̭͝ = ̳̙̼̩̲̝S͎̯͉ͅ.̱̮̝͔̭̖͡ͅe̲̬̝̦̹̩̳͡v͕̻e̴n͍̲t̙͙̻͔̣.̪̥̝̜s̻̠̝͈͔̫p̡̱̥͇͎̩e̼̲̻̘̪͜c̹̦̺̝̯̙̪i̫̪͈͚ạl[̘͔͞d̞͇͓͈̫̰ͅ]̯͔͓͇͖̜͞ͅ | ̮̞ | ̣̠ {
                                    ̢
                                }
                                ͍͠,
                                ̸͙̠̟͎p͡ = ̵u̝̠̳̕[̴d҉ = (̤̗͚r ? ̨̺̜̼͖f̻͔̺͚͔̠̫.̰̦̯̯̤̯̰d̜̹͙e͖̫͜lḛ̤g̲̬͓ą͈̘͉͇t̛̳̟e̺͍̦̥̪̯͝T̜̱͎̬̺̗y̥͝p̷̳̖e̖̞̼̮ : ̸̖̖̺f͔̰̥̤͔̱͞.̱̭̹͔͖̪̫b͙̳i̶̝̝̭̼̭̖ͅn͙̫̣d̶̝͔̩̳̠̞͍T̸̰͖̟y̨̜̹̩̪̮̜̹p̛͍è̲)̩͉ | ̳̩̝̩ | ̵d҉̻̩̞]̨̘ | ̠̼̹̱̠͖͚ | ̝̗̗[͔]͕͝,
                                ̜̠̰̫͢ͅs̨̘̦̮͔ = ̗̝ͅs̬͈̲̥͖̬̦[̴2͍̰̯̜̜͈̦]̶̙̮̖ & ̦̜̯̝͚ & ̧̯͙n̮̘̫̫̬̭e̷͚͍̳̰w̩ ̵͖̪R̳̺̀e̩̪g̸͍͚̜̠E͙̩̠̘͈̺̕x͏̣̪p̪̩̲̗̺̜̦(͎̥̱̙ "(͓̟̫̖̭̥͓^̭̖̦̰̤̩̤|̸̖͇̺̲̰\̶̱\͙͢.͚͉̝)̧̪͙̥" ̵̤̘̼̣̯̜̱ + ̝̠͕̱h͝.̲̭̦̲ͅj̶̟͇̗͍o̧i̝̲̹n̯̗̗̦̫̦(̤ "͎̲͉̞̞\͈͓̣̘̯̰͙\̷̳̞͉̱.̱̭̣(̧̟͚̪̘?̛̟̱̥̖̜̣:.͔̳͚̬͍͇͢*͉̭̮̱͎\͖͎͇̘\̹͙̺̟̞̮.̹̞̱̼̳͜|͇͉͘)̖͔̖̰" ̮͉̱)̮̠͕̦̤̘̲ + ̛̗ "̧̱̘̻(̸͇̗̤͈͔̝ͅ\̬\̺̤̗̙̲͖͠.̜̺̺̟̺̜̩|̗̲͎̗̟̖͠$͙̦̠͈̤͓̝)" ͕̤͟ͅ)̳͓͎̜̭̕,
                                ̺͈̤͚̺͚à͓͕̯ = ͘o͏̗͕̳̗ = ̻̰̙̮͎̬̻p.͜l̨̬e҉̬͓̫n̜͇̘͓̩̰͉ǵ̖̯̼̣̙t̟̣̹h̶̗͕;
                                ̴w̻h͓̻͙͍̙̠i̟ͅle͈͡(͓̯͖o̡͚͔͖̪̟͖̻ - ̛͓̲̟ - ͍͖͙̜͟)̺̳̺c̹͇̭̺̺̳̳ = ̠̗̳̻̳̲p̟͉͍̭̖̠[o̝̻ͅ]̷͖̖̞͔,
                                ̝̹̼!̢i̫̬̣̩ & ̘̲̦̦̭ & ǵ!̯̻̤̻͚ = ̠̱̖̜ = c͕̩̬̳̮.͔o̝̙̺̜͍͟r͚͕̞̹i̪g͍̮͙͎̖̜͢ͅT͎̖̰̳̥̳̬y͚p̵͇͎̖͉e͠ | ̴ | ͇̰͇̝͇͉n͔̥ & ҉͍̗̫̜̯̣͇ & ̘̲͎n͙̣̜ͅ.͙̘̱g͏͚͖͈̩̞̝ui̳d̠̝̰͚̦̻͞!̩͚͚̠ = ҉̥͕̼ = ̷c͍͡.͏͙̹͕͔͉͎̣g̸̗uḭ͖d͎͙̝̳̻̤́ | ̬̙̜̥̞̰ | ̳̣͖̼̪̜̬͟s͍̫͓͉̯̗̜͞ & ̮̭͇͚ & ̤̼̻͈͇͙͇͡!͇͠s̵̲͈͕͈.̵̰̪ͅte̖̞̭̠͕̠̜st̤̹́ͅ(͓̣̗̜̣͕͔c̳̻̩̫̱̞.͉̦͙̗̼n̝͕͍̭̯̱͕a͕m̩̩͉̩͈̬͠e͓̙͕͍ș̦͎̺̬̟͢p̡͔̠̫̣a̵̬̼̤c̹e͔̤͙)̜̥ | ̢̯̩͉̘̠̺̥ | ̲͇͢ͅr̛̰̺͕̩ & ͟ & ̞͚͙͇ͅͅr̜͉̣̜̥͔̲!̥̺̖͚̻̯ = ͏̬̘ = ̸̫c̵ͅ.́s̯̻̬e̛̦̮l̠̖e͍͉̘͖̻͓c̙̗t͙̠̕ơ̝̼̣͚̖̰͕r̝̭͔͙͉ & ̟̙̤̼̺̹̭ & ̭̙(̷̱̖̠͓̯̯̹ "̞̕*̵͚̲̲̭̥̻̪*̝͙̰̬̞͟" ͢!͏̪̺̙̘͎͙ = ̙̗̺̪ = ̭̜̕r͏̥̗͚ | ̸̤̜ͅ | ͍͓͇!̡͎̥c͚̳̩̝ͅ.͓̻̙s̲̝̣̺̱e̛̪̪̝l̨̳̱̪͓̰̭̝e̪̩̰̩͈̰̠c̥͍̜͈t̺̩̠͖o͓̭̼̱r̟)̴̣͖̞ | ͠ | ̛̩̜͇̟(̥̯̺͈p.̴͎͍̟̺͕͍ͅs̗̝̮p̜̭̟̭͓͔̺l͖̙i̫̕ć͎͓̖̱e(̲̻̹o̷̻͇͈͔, 1̜͇̼̼͙̘)̛͚͓, ̨̤̖c̛̻̗.̡͙̤͍s̙̤̦̥͍͎ͅe̼̻͉̰̱̭l͖̲͎̙̟͖͠ec͠t̗͓̳o̲͔̩r && ̷̺͙̞̮̥̺̪p̣̝̪̠̤̝.̶͍̖d̹͙̜͖̺͘e̙̩̖ͅḻ̞̖̗͞e̸͙̗̰̪̰g̳̙a̜̜̜ͅt͍̱͝ͅe̛̘͇ͅÇ̞͎̜̲͙ͅo̮̖̗̬̞͞u̙̱̜͈ṇţ - ̵̯͈̙͔ - ̵̣, ̝̙̰̹͕̟f̢̣̠͍̘.̣̤͔̹͔̰ͅr̙̖͉̘͖̭̜e̮̺͙͚̲̥͓m̺͕ͅo҉̪̻͚̭̳v̤̙̼ͅe̼̳̞̦̟ & ̝̥͢ & ̴̝͈͓f̴̞̝̰ͅ.̹͖̫̖r̀e͕̙m̬̞̗̥̲͉͞ov̛͍͎͇̼ͅe̻̩͇̩.̼̱̗̣͞c̻͚̦̤͎͇͞ͅa̜l̴̳̟͎̱l͈͔(͏̫e͏̰͍͉, ̸͈c̭̱̥͔̩ͅ)̡̦͚͎͚)͕́;
                                ͔̘á͔͔̠ & ̱̯̟̀ͅ & ̵̣̥͉̮͈!̩̺̲̞̰͉p̣̦̯͚̣̖̝͘.̟̲̝͚̗̟̠l͙͕͍̤̹̯͟é̯̲͓͍̫̤ṉ͈̘ͅg͡t͖̭̝̪̼͟h̙͖͕̪̬ & ̛̖ & ̶̳(̟̫͈ͅf̗̖.̦̘̱t̛̳̫e̯͚͇̗͡a͇̟͡r͜d͝ó͕͔͙̟w̫̝̺̳ͅn & ̝̪̭́ & ̨̦̙͇!̞1҉̬̠͚̙̟͇!̛͖̣̦ = ͔̻̬̩̭̹ = ̩̺f̤̩́.̼̪͕̲t̺̖͕̼ea̜̙̭̰̣r̫̣͢d͇͉͓͚̝͙͟ͅo̴w̭̻n͏͓̹ͅ.͕̟̭̳c̷͙̫̞al͎̺l̷̯̟̦͓̺(҉͇͍̖͍͇̳ͅe҉̠͍ͅ, ͍͓͚̝͓̖̗͝h, ̛̻̯̮̭̰̫v̱̰̥͈̣̮͡.̬͖͔̻͔̻ḫ̘̺a̭̜̩̪͡nḑ̻ĺ̤̲͈̟̭e͚̖̬̙͙)̘̘̹̰̖͙ͅ | ̪̙̲ | ̨̙̖̠̺͕S̘͉̱.̪͔͎̬̜r̤̘̰͢e͚̞̺̣m̢o̼͖̹̜v̥͕̲͕ẹ̼̣̜̞̜E̢̯̜̭v̧e͉̱͈͖̹ņ̘̙̤̻̞t̜͟(̢͇̲̣̘̦e̟̫͔̞̖͚, ̸̦d̡, ҉̠̗̹͓̰v̖͈̜͍̳͘ͅͅ.h͙̲̣̪̰̞̜͡a̮̘̦͈̱͝n̜̻̝̩͕̦͜ͅd̬̕l̹e͈̯̟̼̱̪)͚̠͝, ̜͍̜d͕̗͓̠͔̜͟é͎̱̳̠̭͚̱ḻ̟͠e̹̹̲̩͉̳ͅṯe̴ ̮̰͘ṵ̞͎̞̫͙͢[̩͎̹͕͙d͠]͔)̙
                            }
                            ͉̼̲̺̳͎͙é̱̳̲̞͚͎l̫̯̳̬̙ͅs̠̥͉̳͎̳̀e̠ ̫̳̗ͅf̘͎͔̗o͈͉̗̝̩̱r͓̞ͅ(̵̰d̖̼̹̹͎͚ ͏͇i̢̞͓̠̤ͅn̘̰̱ ̣̰͙͚͙̼̞u)̠͖̜̫̦̀S͍.eṿ̸̘̖̟͇ͅe͈͈̣̤̝̱nt͔͠.͉̤̩r̡̩̮̣̯͚̠ȩ̯͙̤̤m̴ͅo̹̣̝̻̖̬ͅv̰̘̰̗̀ę̤͉̪̖̫͓̙(̝͉̻͘e̠, ̪͇̙͉̙̯͠d͔̜͈̜ + t̺̦[̀l̼̰͖͚͢]͕̖̪͝, ̡̤͇̯̬̰̦̱n̗̻͈̫, ṟ̯̼̻̬̗͈͞, ͍!̧͙̳0̳͖̣̘͎̀)̱̦̩͝ͅ;
                            ̣͚̳̣S҉̖̩̯͉̠̬͓.̶͍̮is̤̼̜̺̙̮̺E̥̭̟m̵̦͉͔͖p͏t̮͈̬̹̺͚y̤͖̹͇̠̭O̡b̳̻̗͕͕̻̜͠j̶̹̝͇̞̻̟̳e͔̪̖͈̹͡c̝̼̱̱̭̗͙͘t̻͎̻̟͕͓̀(͏̠͓u̧̹̼͈͖̟)̩̻̻ & ̣͈̹̞͘ & ̯̦̠͔̯͍Y̱.͖̦̺̼̝̥̖r̶͓̹̳ẹ̦͎̩̪m̯̩̟̗̮̙o҉̞̦̣͕v͉̱e̩͝(̠̥e, ̠͕͟ "̛̭̗͉̳̟͓̺ẖ̩̼͈̠̼a͏̼͎̹͎̰̜̩ṋ̩̫̘d͚̮͈l̗͚e̘̠͈̟̹̖ͅ ̬͞e̞̦͚͓̰͕͜v͚̦̯e͈̤͉̪̰͝n̼̲̯t̪͓͠ͅs͎͎̦͜" ͉͉̲̪)̳̯̹̘̮
                        }
                    }
                    ̤͞,
                    ̜̱̯̙͓̟d̞̖͠i̷̲̝̪s̹͔͈̘p͈a͉̱t͎̯͈͓̜c̘͕h̩̘̬͢: ̕f̥ư̜̩n͔̗̱̦̥̺c̛͚̼͇ͅt̡̲i̞̮̭̝̘ͅo̺̭̮̟̠͓ͅn(̤̮̖̹͈ḙ̮͖̲̰̫͘)̢̞͍͎̣͔͎ {
                        ̺͙͞va͏ṟ̲ ̯̻͎̖̞͕t̜̩̪,
                        ̫̼͕̖͉̫n̸͕,
                        ̹͍r̬̰̹̹̻̘,
                        ̱͇͈͕i̷̭,
                        ̠̣̲̱͈̜o̦̳̲͇͙̱͞,
                        a̸͓̝̹̮̼,
                        s̰ = ̬̜n̖̙͟e̢̳͈w͇̪̕ ̲̪̹̜A͖͓͕̺̹̟r̩͓̮̬͙͙̕r̦͉̣͕a̸̖̗y͓̼̞(̧̯̤̻͓͍ar̴̺̲ǵ̳̹u̝͙m͓͔͢e̬͚̟͔̝̪̙n̬͖ͅt́s͈͍͉.̯̦͍̥̘͔͞l̺̼̥̟̫̖̱e̥̰̻̰͝n̶̙͚͓̺̯͚̮g̮͕̣̕t̛̙̥h͖̲̲̳)̪̭͍͖,
                        ̤͖͉̕u̳̗̝ = ͖̙̹͙S̘̫̤͟.e͕̰͍̗̱͇v͏̩̝̠͔̜̲ę̼̲̹̻̙̥̣n̖̮͇t͔͎̻͔̜̱͕.̮̦̦̰͕fi̞͈̞͈͕͚͚͝x͉͈̫(e̶̙͔̦̬̥̭͍)͎̬ͅ,
                        ҉l̸͈̯͍̥ = ̠̗͓(̬͖̰͖̙̮͢Y͈̲͚̫.̧͉̫͉͈g̦̗̪̠e̷̘t̯̦̖ͅ(̼̰͕̣̣t͔͚̠̯̥̻ͅh͕̞͉͕̩i͔̞͖̝s̱͔̼̼͕̼̭, ̴̯͓ "̭e̬v͈e͍̰̭n͈̰̫͉ṯ̴̯̟s̶͍͍͙̬̹̭" ̧͓̟̱ͅ)̢̦̙̺̣̩̳͉ | ̲͍̫̬͡ | ̬̻̘̦̫̖͜O҉͙̳͇b͍̼̜j͓ȩ͎c̬͍̜̤̣t̩͈͚̰͙͓.̮̱͇͟c͖̳͚͚̱r̺̖͕̙̰è̞͍̙a̤͙͞ţ̯̫͙̫e(̯̫̠̯̮ṇ̙͎̝͕̻ṷ͖̪l̞̭͈͖̺̗ĺ̦͍̩͖)̟̗̰̗́)̲͕̝̼̞̞͠[ṵ̬͢.̺̯̺̭̹͉͈͟t͘y̥̻p̢̖e̪̺͔]͔̬̥̺͕̪͘ | ̠̰͎̩̭ | ͚͔͠[̜̝͖͍͘]͓,
                        ̩͈̳̞̦͉̦c̥̭͜ = ̞͇̫̥S̻͈͖̯̲̣̩.̀e͇̣̹̣̥͡ͅv̟̗͎̞͍̻͈e̜̙͇n͇̺̝͉̟̰̹͠t̮̰̯͇.҉͕͍s̱͍̥̝̭̺p̡̬̮e̞͉̬̫͍͉c̠̜̹͇͖ia͖̮̻̫͠l͍̬̰͞ͅ[̵̙̦u̫̭̕.̦̦t͚̯͉̳̦y͙͓̹̹̠͈̟p͓̙͈̼̜̞̩͟e̜͔̫̟̪͈̦]̩̱̤̪̜ | ̯͈̬̪̞ | ͖͟ {
                            ̻
                        }
                        ̶̮͍̭̬̱;
                        ̡̲̩̙͍͙̟̜fo̵̻͕̞̲̯͕r͈̟̭̗͇̝(̶̥͇s̭̠͚͙̙͜[̠̘̳̮̜͎͍0]̞̦̯͍͉ = ̵̖̳̰̙̙̺u͙̩̙͔, ̜̥͜t͕͖̯̜̼̻͘ = ͏͖̮͙̹̪͇1̡̯̞̠̩͈͕ͅ; ̩̦t̸͉ < ̴ar̨̩̦g͇̮̮u̦̜͚̭m̙͓͖̤͖̻͟e͉͔̩͇̫̬͉n͕̲̰̺̤̕ṱ͟s̨.̖̤̟̫l͕̦͕̤͍̜̜e̸̳̲͈͚̳͇̥n̹̬̹͖̩̖g̷̦̘͖ṭ̩̜̱ẖ̟̥; t͓̩̗̦͘ + ҉̫̙̣ + ̫̜̹͙)̜ͅs̘̜[̻͕͇͖̬̞̤͝t]̝̞̬̣͢ = ̟̼̣̗a̱̲͇̭r̺̭̤̻g̼u̦̪̜̟m̞e̶͎͚n̷͓̝t͎s̫̩̲̺̬̖̠[͏̺̖͙͇͎̬t̵]̺̫̪̩̰̲;
                        ̢͓̼͚͇͎í͖̥͉̗̱̞̝f̻̜̦̱͓̞̘(̻̩̣̰̻͝u̠̼͚̪̳͓.͈̤̥̭̬͖͞d҉̤͖͈͖͓̩ḙ͈l̮̺̗͓̰e̫͉̬̪̱ģ̻͖̖̻̹̥͓a̠̱̲t̢͍͍͈͙ę̤̝̩͕T͔͖̱͟a̡͇̼̤͖r̘g̞e͎̰ͅt̳͙̭̻̰͍ = ̠̣t͚̹̘̲h̜̤i̘̱̥͘s͕̥̰̳̤, ͍̲̟!͇̱͍̠͘c̖͍͎̻.̢͙̠̰p҉̙͍̘r̯eD̼̞͇͉͜ị̹̼͉͕̝̦sp̘̯̳̤̩̙ạ̡̰͓ț͓̖̠͓c͏̝̮͕̘̙͎h̵̹ || ̹̜!̬͇̱̼̳̟͍͜1͍̝̖ͅ != ̩͉̠̳͠ = ̡͕̰̰͙c̟.̙͇̳̙p̦͈̝̬̦͔r̶̜̮ͅͅe̛̪̘̳D̟i̞̞̗͇̯̻̗͞ş̱̥̙ͅp̵̼̪̮͎a̱͜ͅt̹̲͖͇c̸͙̙h͔̭͎.҉ͅc̴̪̻a̶̬̤l͉l͓̫͟(̀t̡͕̱̼̹̠h͜i̲ş̖̜̜̲, u)̬̯̲̯)̡̫͎̱̣̺ {
                            ̷a̲̗̖ = ̖̱̗̰͍̫S͈̱̀.̤̻̹͖͓̻̱͞év͝e͏͉͖̼̟n͕̲t͍͇.̥̲̬̦̻͇h̯a̡͚̯͍̼̹n̢̬̣͔d̶̗̳͚̟̻͚̰l̖͎̥͈ͅe̙rş̲.͈͎͙̩̰͜c̜a̧͎̰͖l͔̠̘ͅl̛̪(̧͓̠̮̲thi͉̼̙̭̤s͏̲͉͔͉̫̜, ̞̮̗͓̬̤̝̕u͏̻̩̙̳, ͉̞͍̖l̴̺͎),
                            ̭̟͎̘̕tͅ = ̪̫̙͎0͕̪̠̘͞;
                            w̳̦h̼͜i͙͕͙̞l̲̤̟̱ͅe̠͈͘(͚͖̠̜(̬i͉̪͔̬̰ͅ = ̷̺̳a̩[̮̙͍́t̷̹̙̯̞̞̺ + ̝̗̬ + ̜̺͍̟̹]͖̦̭́)̲͙͕͔̘ & ̡ & ͇͉!̵̻ù̝͔̣̘.҉̼i̩̗s̤P̰̝̺̻̟̠̞͘ŕ̯̣͓̤o̟̲̺͓̳͍p̧̩̩̥̱̰a̞̹g̷̹͎̞̫a̵̝̟̥̺̥̝ṯ͓̖̩͈͔i͏͇̰̯o͕͓̘͉̳͍n͙̟͓͖S̰̠̝͠t̝̬o͙̯͍̫̝̜͞p̝̦͓̥̲̮p͖̲̱̤e͉̠͈͓d̶̺̮̩̤͎͎(̬͓̝̜́)̧̗̩͉͖̥̫)̖̀ {
                                ̟͞ṵ̹͘.͈̼cu̮̲̞͖̼͘r͓͙͎̼̻̝ŗ̣e̡̼͉̝n̝̟̲͚͖ṯT̶͕͈̜̰̠̹a̩͔̙̘͖̫͚r̲̯̻͉͔͎g̮̫̝̞̼͟e̛͚̩t͇̩̼̟̦̖ = ͇̞͔̩ͅi͇̺̭̻͙ͅͅ.̶̥̯̠̟͓e̵͔̺̥̭̥̬l̹͙̀e̲̼͕̩m̶̼̱̝,
                                ̨̫̠̥n̷̦͕̦ = ̸̩0̻;
                                ̷͓̦w̹͟h̬̲̗͔͉̖̣͡i͏l̼e͚̘̮(͢(̴͇o̡̪̲̼͙ = ̘͞i͟.̫͔͈̩̥̠͈̕ha̝̯̖͔nd͚̮͉̪̥le̥̺̩̣̫̦̮r̖̟̞̭̮̞s̪͙̝͓̥[̞͚̯n͢ + ҉ͅ + ̲̤]͓̗̻͙̥͢)̤̥̼͢ & ͕̩̝̙̜͚ & ̧̖̹̘̬̠̯̪!̸̣u̵.̯̲̬̯͔̬͟i̛̜̠͍s̵̩̻̙̼I̸̟̳̞̭m̛͚͕͇̩̭̝̹m̘̺̪̗̪͈͢ͅe̲͕̰d͏̳̤̱̮̤̯̫i̹ͅa̡̲t͖̱̪e̩̬̣̘̤͓P͎̯̙̫̝͔̩r͈̰̜̰͜o̝̬͡p̸̺̣a͔̖̦̹͟ͅg͝a͔̞͝ͅt̢̮͕̜͔̹̭̘i̬ò̙̻͚̠n̗̠S҉̭t҉͉͓͉̺o͈̳̼p̯̪͕͙̩p̖̳͙͈̣̹͔e̘̦d̦͈̟͙̺ͅ())͖͙̙͔u͓̳̗.r̙͚̙̳̺͕̳na̛̞̝͇̟͓͔m̦͎͓̖̗͓ͅes̲̕p͏ą̫͕̮͍c̷̘̤̖̝ͅę̘̭͓͈̙ & ̻̬̟̱͕̟̀ & ̶͚̩͉͉̬!̫͠1̟̟̯̬̲!͍ = ̷ = ̶̝̱͉ͅo̧.̳͘ͅn̯̺̥̝̠̜a̼̤̞͙̦̖͡mę͙s̰̰̩͚͜ͅp̼̟͈a͚͖͟c̳̤̻̜ę͍͙̭ & ̜ & ̫̝̻̱͈!̭̘̖u̼̱̙̲̱͟ͅ.͕̥r̨̭͔̣na̗͎̺̣̜̲m̢̬̞̮͉̝e͚̖͓̩̤̝s̶p̺a͔̠͞c̷͖̤e͎̫̤̖ͅ.̜t̫͚̬͍͕̤e͢ś̥t͎̬̻̲(͖͓o̘̣̱.̶̩̲̣n̛̞̤͙̩͕am̮̦͈e̼̩̬͓̼s҉͉͓̫p͈̣̣̲a͇͍͍̟̤c͏͉̣̰̱͙e̬̠̤͈͎̞)̪̥̹̥̭͢ | ̱͎̟ | ̡̠(̨͔̦̠ͅu͡.̮͎̜͈ͅh̖̟̲͈͉̯͔͞a̙̠̙͙̺̫͉n͈̟̞͍̥d̞́l̥e̲̳̠̜͙̗O̙̱̥bj͚̙ = ͕̝̗̀o͈͈̳̦, ͇u̟͠.̢̰̠̹d͇̗̦̞̕a̢t̝̮̝͎͍̰a = ̺̦͔̻o͕̘͉̗̺̦̻.̰̩̮̙̀ͅd͏̦̹̣̟̟a̴͙͔ͅṯ̡̟̟̦͍̖͕a̴̜̬̫̩̮, v̺oi͕̮̯̖̳d͈̫͓̖̘̕ ̘͉͎̺ͅ0̩̘̕!͈͍̞̯̟ = ̥̼̯̠̣ = ̵̱̰̠̯(̞̱͈͖̲͕͟r̟̣̜̟͈̰͡ = ̤̦̻͘(͎̣̘̻̥̦̪͘(҉S̖͖̦̼̖̩̙͢.̢̮͕̻̻̹̝̬e̡̞̜̘̩v̘̜̟e̙̮̜͉̗n̞̳̻t̡̳͙̺̘̯̬̙.̪̜̬̩̞͔̤͡s̞͢pè̬̣̘̦c̻͓͕̪͕i̺̗ą̣̲l̞̺͝[̬̗͞ó̹͉.̵͚̬͙̲o̪̘̫̠ṛi͖̘̩̳̤̱g̸̩̫͙̜̞̦T̛̟y͖̫͇͇͝p̶̙̺̹̼ͅe̱͘]͇͚̣̝̯̯ | ̛̻ | ͞ {})̞̼ͅ.̙͇̻̣̗͞ͅͅh͚͕̫̰a̵̼͓̱͙͔n͘d͖̝̝l̦̬̞̫e || ̤̯̣̯̹͟ͅo̟͢.̫̦͜h͉͎̜̬ạ̰̞͜n̦̻͇̬͇d̰̪̥͚̩͙ͅl̕e͍̥͕͞ͅr̞̠̘͔)̡͍.̪̩̜̤͡a͕̤̯͓pp̪͖̪̜͙̩̻l̘̙̦̤͚͕y̨̠̯̼͇͈͓̜(̛͚͚̗̘i̲͕.̵̱̼̱̯e͚͈̤̥͍ͅl̝̹̠̮̼͈͉͜e҉̙͚̦̬̻m̳̰̮͝, ̬̼̼̗s҉)̵̜̻)̨̥ & ̘͇̜͉̻̝ͅ & ̪̤͚͎̰͈͓́!̩̰͙͚͚̯1͎̮̝̟͇̳͖ = ̱̥̬͚̥ = ̬̞̪͍͙̤ͅ = ͕̬̺(͚͈u̹̤̳̺̜͕.̴r̦̼̩̰e̟͇̼s̪͎u̶͚l̮̠̠̟t̺̺̟͎̭͖̦ = ̷̗̞̝r̳̪̬̰͙̭̰) & ̤̱̘̮̘͢ & ͔͟(̝ú̝̩͖̺̮͓.͚̯̳̞p̵̝̪̩̰̗͔r̜̭͙̝̖e͍̹̺̱̟v̦͖̮e͡n̜͖t̸̜̠̹͙D̯è̙̝̖͕̦̯f̢̗͙̩̬a͈̱͉͕̗͓̟͞u̲̰̫͔̣̹͙l̷t̷̪(̫̬͎͔̣̰̝̕)͇̻̖̟̮̘, ́u.̭͓̥̫̯͝s͍̯̝̜t͙͕̫͕͝o̱̕p̘͎̭P͔̼͖͓͚̳ro͓̥̯̯̯̺̟p̵ag̳̣̼͝ạ̢̳t̵̥̫͓̱ͅi̭̩o̶͔̰n̰͓͇͓̙(̲̠̦)̻̯̬͝)̭͎̲̳ͅ)
                            }
                            ͈̤̙̩̩͔͎͟r̖̼̰͙͔̬̻eṱ̹͚̱̥̫ṷ̭̪͙͙͍r̺̱̺͇̬̩͟n̸͈̜̮̞̭̝̰ c̞͉̝̤̖͖̱͘.͇̞̗͔̞p̝o̦͉s̻̞̯t̸̮͔͉̟D̮i͔s̟̖̫̞͟p̹̮͍a̖̻̻̘t̛̝c̜͈͈̹͔̗͖h̵̼ & ҉͓ & ̣̤̯͉͙̀c.̗̭̠̭ͅp̫͖̥͎o̡̳s̸̱̟̰̩t͘D͍̗̻̩͈͇̻͝i̛̫̝͔ṣ̬͓̗̻p̬̰͎̟͠ͅa̹̝͉t͈̮͖͇̪͕c̛͉h̝̫͘ͅ.͖̯̪͔̀c̹͇͖͎̤͉al͓͇̱͝ḻ̸̟̲̹̠(̻t͖̖̫̜͓̘̣̕ḩ̲͍is͇̠, ̤u̧̻̝)͇͓,
                            ̢̩̙u̫ͅ.̲̤͡r͍̗̘̭̞̝ͅe̲̬̜͖̰̱s̀ú̱͕͍͔͕̺l̞͢t̙̘͓ͅ
                        }
                        ͏͔̼
                    }
                    ̣̺̣̙̻͖̠,
                    ̱̪̠͔͔͠h̪̳͓an̗d͉̱̙̺̞̖̰l͟e̥͇͈̮ͅr̴̘͍͚̗̱̘̳s͙̰͍͎͖̟: ͉̘̮̫͎͞f̪̞͚u̧͉͈̱̦̩̤̟n̮̪̭̱͎̤̻͜c̗̩̫̬̖͞t͙̬̲͖͈̠i̠̙̰o̧̦͓͙n̤͍̦͔̭̥̖(e̷ͅ, ̠̙͈̬̬͔͈t҉̞͔)̮̬̜͔ {
                        ̖̩̬͕͈v̥a̻͠r̲̖̥ͅ ̳̮̣̩̼̥̹n͖͜,
                        ͖͓͉̺r̼͔͓̣̦̱̬,
                        ͉̥͉̬͞i̙̩͕,
                        ̫͎̦̜̙͚̦͞ọ̣̭,
                        ̻̥̯̦͉̠̞͡a̦̲̝͚͡,
                        ̙ṣ̝̭̞͍͞ͅ = ͔̺͉̲[̷̹͚̙̮͔̼̠]̤̝̥,
                        ̥u͇͎̘͈̗ = ͝t̸̠͇͈̫͎͔ͅ.̣͕̖͎̫̖͠d̺͉͠e̮̮͜l͍̙̰e͏͙̟̝̺̝̱g̛̼͖͕̬a͖̥̳ṭ̛͇͙͓̬e̵C͖o̰̺̫̯ͅu̮̰̪̬n̨̖̟̩͈t̛͓,
                        ̰͈̙͈̱͉ĺ͖̟̤ = ̢e͎̞͘.͖͚͇̮̜̪̭͞t͉̱̘̱a̧̻̬̺̟͚͙r̶̰͚g̡̖e͔̲̭t̤͎̫̦̥ͅ;
                        ̧̼̥i̪̦̣͉͖̜͠f̰͚̰(u͍͍͕͝ & ̗̼͈̟̩͈̦ & ̺̪̯ļ̳̮.̱̻̥̩͉ṇ̦o͚͈͔̭̼͉d͕̫͔̱̫͢ͅę̯̣̱̖͖̘T̟̟̗̺͈͎̼y̳̮̜̜ṕe̻̤ & ̝̳̩ & ̬̦̪́!̴͖(̪̭̹̳̭̩͟ "͔͓c̪l̮i̶͎͔̳̬c̘̱̪̙̤͇̳͠k̘̜̺" ҉̳̻̥͙͈͉ = ͖̝̭͖̦ = ̺͔̱̟͔̘̱ = ̗̘̞̣̲̪͝ȩ̩.͈typ͖͚͚̗̼ę̰͚͈̺̫͔̮ & ̶̲̣̣̻̩̞ & ̬͖1̦͖͝ <= ̦̤̻̠̥͜e̡̘̘͈̫̣ͅ.̪͖̗bu͙̟̟̣̥ͅt̠̝to̳̱̲̝̮͜n͜)͎͈̭̮)̨̰̗͍̤̹̙͎f͔̫̦̭̤̱͔o͏̹r(͈͓͕̫̖̘͚; ̲l͜!̻̖͖̖̤̞̭ = ̳̙̥ = ̞͙̘͇͓̳̘͢t̲̱͙͈h̫̬̬͎̩i҉̻̞̪̯̤͈s̫̰͇̝; ̖́l͉̬̫̙̮̟ = ̜̙ͅl̬̖.̗p͔̘̺͔͍̥̹͟ar̘̭͕̤̲͖e͖n̰͓t͝N̰͙͎̱̫od̺̖͎̲̲̹ͅe͇̳̯ | ͖̬̯͚̮͎͘ | ̻͈̯t̥̮̭̮h̷̝̹̟i̦̝̦̼s̰̳̩͓)͖̳͕̼͇i̥̗f̡̤̗̤̠̥(̙̞1͏͚ = ͙̲͇̱ = ͕̼̠͉̭̗ͅ = ̵̲̼͙̰ͅl̙̮̼̻͙̘͇͡.͚̺͎̖̯͝ͅn̠͈͍͍͔͕͓ọ̶͖͍̞d̩̻̬̤̤͇͟e̪̼̼̪̱T̠̜͇̯̥y̞͖̬̝̰̥͖pe̵̠̻̩̠̺̖̜ & ̢̘̻̬̭ & ̛͚(̤̘͙̮ "̗͈̣̯c͝ĺi̧̯̦͖c̹̞̟̜͕͖͘k̯̹͎̺" ͢!̱̙ = ̘̳͙ = ̗͢e̦̗̲̝̞.͇͖̮̟͝ṱ̢͈̺͓̻͚y̴͍p̤͓e̬̻̥̦̫̱ | ̺͖ | ̵͈!̻̰͍0͍̗̦̯̰̲̜!̥̣̝͓̳ = ̙̳̠̳̬̝̣ = ̳̗l̰̹̩̘.̳̕di͠s̲̜͓̣͎̦͍a̹͈̘̩̮̬̝b̻̠l̙̲̥͘éd͕͍̘̱̟)̪̮)̨͕̺ {
                            ̻f͖̜͙̞̩͉͜o̲̙͍r̖̝͈̫̣̟(͈͓̳͔̪ͅo͉̜̳̯ = ̢̫̱̻̭̫͇̩[]̳, ̧̫̯̖̬a͢ = ̺̮̼͉̮̲̥̕ {
                                    ̨
                                }
                                ̦͉͇̮͖͔̣, ͈͔̭̞̪̳n̙̻͚̭ = 0͍͉̭; ̧̰͓̻̖̠n̖͔̲͉̺͖ < ͓̦͝ư͈͓̖̜̪; ̴̪̳n̷ + ̗̭̣͚̩ + ̘̣̥͙͇͉)̧͔̼̭̜͎v̦o̷i̶̬͇̪d̢͍̻̣ ̩̀0̯̼̺̩̮͇͓ = ̧̖̹̲ = ͏̘ = ̛̟̥̗a̗͙͈̼͚͡[̴̜͍i̳̘̹͍͔̱̙̕ = ͓͚͇(̡̗r̸̳̪̬ͅ = ̭͇̣̺̠͕͖t̸̺̦̝[͏͍̙̺n̘]̶̯̰̰͖̣̮)͓̞̪.s̟̳͙̣̖̫̀ͅe͚͎̳l̬̱̝͎e̪̼̱̬͖͎ͅc͉̝͍t͇͚̜̤̰͉͎o̭͢r + "͓̫́ ̰̥̻̱̲" ̡̪͖]͙̀ & ̸͔ & ̻̮̝̞(̣̙͔̱͇̼͟a̧̯̰̫̹͙̙[̪̞͕͎͚̲i̱̦̺̲ͅ]̷ = ̡̥r͡.̵̳͉̮̘̩̺̯ǹ͚e̼̺̣̪ẹ̢͍̪͖̠̼d̦͚̳̦̼̯͈͡șC̴̤o̤̟̣n҉̳̰̼̺̦͖t̥̻͇͖̫͢e̻͇͎̰̼͓̞͞x̭t̗͈ ? ̛̻̙̖ - ͏1̗̼͉͖̦̤ < ̢̦̣̣͖̻̝S̱̲̖̥͖͠(̵̳̰͉̖i̗͓̮, t͇͈͙̰͎͙̭h͘i͞s̵̯͕̖͍͍͙)̭̟.̷̯̩̲í͙̥͙̫̥͙ǹ̠̣͙̙͚̰d͘e̼x͙͚̰̝̤̱̟(͙͖͍̦̩̫̣l̮̙̞͘)̨͖̗͚̘ : ̸̱S̲̰̫͎.̻f̲̯ͅíṇ̬d(̧i͈͍̹̰̟̤̺͡, ͔̯̪͈͈̗͝ͅt͖̖̦͕̬̀h̛̳̩i̘̝͓̞s͝, ̰̥͙̱̟͕̤n̫̣͕̣͡ͅͅu̶̝̹̘̭̯͇l̯̻̞̫̗͝ͅl̥͕͈̦͙͓̺, ̻̳̭̻͈͉̬́[̰̪l̜̹̩̰̮̦̺]̫͎͙͙̱͝)̟̫͎͔͉̤̲.͔̗̠̼͎l͈͔̥̖ḛ̝̥͝n̟̩̦̳̼͔̪g͔̖͈̖̯̞ͅt̴̻͓͔͈̙h͚͎̺̻)̻̙͕̲̼ͅ,
                            ̘̻̮̪à[̱̣i]̭͈ & ͚̝͙͇̳̬̕ & ̳͍̦͍̘͕o.̧̯̦̩̙̤p̨͍ṳ̩̻̹̗͇̀ş͍̝h͉͇͎̣̩͔̟(̢̰̳̳̹̠͖͙r)͈͖͉͈͕;
                            ̯̼̀ǫ̳̟̩̬̮̘.̱̞̜͉̟̙͝l̡̟͎̬͇͙̺e̴̙̘̭̰ṋ͢g̹̹̹̙̺t̗̜͉͘h & ̯̪̺̫̯ & ̴͖̘̜s̝̱̬̺͍̳̞͞.͖p̵̯̪̻͇̳̪ṷ̵͕̘̮̙̫s͓h̜̝͈͙̠͟(͔ {
                                ͠e̳͎͍͍̖̤͝ͅl̺̲̬̻̩e̷͚̺m̶̱̞̺̹̳͙͓: ͕̮l̤,
                                ̙̳͔͕̭͕͞ͅh̪͚͎̫͚͠a͚n̴̺͓̫d̖͈͍̬͔͔́l̝̲̳̤͈͖̹e̞͓̹r̶͎̫͙̗̺̩s̴̭̯: ̶͕̜̦o͙̩
                            }
                                ̺̼̭̦͍̼̱)̡̲͕̫̮̭͈
                        }
                        ͚̲͔̖̭͖͟r̙̯͜ͅet̰͔̟͍͕̰̩u̷̘̦͔͍rn̰̱̣͙̜ͅ ͓̞̫̭͓̖̣l = ͡tḩ̩̰̼͚̦͉ìs͢,
                        u̡͚͇͕̩͙̰̠͡ \ ̗ș̠͍͈̤̟͟ * ͎͇̙̯̜͡$͎̰͍̪̬̕ͅ / ̮̳͔̮̘ͅg̀;
                        ̰̤f̷̝̰͍u̮̲̜n͏͍̲͔͎̪c͇̮̖̞ti̦͖͉͎̺o̸̘̞͓n̙̟̫̺ ̨͔j̧̜̞̗͓e̡̬̭͙̠̘̲ͅ(̦͞e̖, ͖̺͙t̮̗͈̳)̖̹ {
                            ̛̖r̝͜e̪͙͈̜t̯̟̲ṷ͓̣̙͚̖̩r҉͈̺̜̫̣̭ͅn̩̣͕̗͢ ͏̦̲͓̝̭̯A̞͎(e̫̞͉̭̤̱͟, ̱̮̗̙͇ "̧̥̦̭̰̮ta̵̼b͈̖̲͉̫̗ͅl̢͚̦̜̠͎͇ę̮̬̟̦̙͓" ̰̝͈͍̦)̝͟ͅ & ̡͈͓͕̠͓̻ & ͏A͓̺̱(̬͉̻̝1̟̠1̢̖̩͈̦̟̖!̷ = ̸͉͔̪͙ = ̙͓̻͕͍͚̹͡ṱ̳̣̰̱͈͘.̭̱̮n̢̙̙͓̻ơ̺de̲̲̳̳͜T̳̰y͙̗̪̳͡p̮̹e͓͕͡ ? ̤t̶ : ̥̼̘̠̱t.̢f̱̺̮̭̹̗ị̤̳̺̖̭̞r͓̹s͙̻͜ͅṱ̟̙̟͝C̶͇h̦i̞̹̤͖̦ḽd̹̗̩̭̩, ̤̣̝̫̝ "̨t̴̜͎̱̣r̝͜" ̦͓̹̳)̗̫̳̤̯ & ̨̟ & ̙̘̝̙͔̰S̴ͅ(̳̟̜̫̪e̠͇̠̻̬͉̥)̗͞.̸c̫̞̳̫̞̀h͏i̷l͓̞̬̀ͅͅd͎́r̬̼e̫̣n͕̜̜̞͙(̜̲͈̭ "̩̙t̰̫̹̬̩̞͉b̯̻̀o͔̟d̤̱y̩̣̺͜" ̨̬̣)̼̼͝[̮̱̖͙̬͡0͓̞͢]̙̭ | ̭̘̗ | ҉̹̜̝e̡̠
                        }
                        f̷̺̣̭̫̗ͅṷ̘͕̲̹ǹ̟̪͎̭̘c̵͖̟̲t̯̖̮̺̻i̗̩̦̗o̪̥̭͖̣͝n̨͙̰ ̠͙͙̹̭͘Ḍ̛̥̭e҉̹(҉̻̩̯̱̪̰ȩ̤)̥̘̻̠̼̙̪͟ {
                            ̷̺͔̟r͍̬̗͝e̺̕t̨̜̻̗u̞̭̲͞r̥̥͙n͖̮͢ ̫̩̙e̡̬.̛̹̫͍̩͖̠t̵̖͍̤y̟͘p͏̥̯̱̞e̪̞͔͈̕ = ̴͖̖̣͚͔͙(͍̰̫͍n͔u̴̳͔ļ̣͍l̘!̩͈̖ = ͠ = ͍̠e̪̼͚̳̱̗̮͡.͎͕̜ͅͅg͈̦̣͓̱͚e̶̳̹t͖̼̟͜Ạ̝̜̯͓̟t̳͉̠̮̯̳͢t̖̟̣̦̱̩͜r͈i̫̟̥b̝͙̜̤̤̗̳u̝̤̬̥̱͉t͔̱̖ͅe̟̗͔͟ͅ(͍̭̺̣ "̛̣͈t͖̤͓͉̳̼y̦͇̟̪̙p͖̗̟̠͉͘e̳̦" ̶͎̟̮͍)̗͝)̘ + ̞̺ "̻/̼̜̣͉̙͉̬͢" ͔̭̰̜͍ + ̼e̘̭̞͓͖̺.͚̪̲͝t̤͙̕y̹p̡̘e͈̰̜̟,
                            ̸̤͎̠͔̮͎ͅe͕
                        }
                        ̟͉f̥̘̪̠ṵ̦̖͍ṉ͉̠c̶tͅi̝̖͕͎̰o̱͍͎̣̳n q͏͙͔̠̞̙̲e̮̣̝̫̜̩͡ͅ(̼̀e̢̙)̷̱̳ {
                            ̼̥̦͚̕ŕe͎̗͙̭̙̜͝t͚͞u̮̖̬̭̙͓ͅr̲̗n̷͔̩̼̩̺̣̠ "̯t̼̺͍r̪̟͉̜͠ụ̼̟̦͈̯̫e̡̗̘̻̪ͅ/̙̹͖̖͚̮̙" ̶ = ̲̙̮͟ = ̠̥ = ͙̦(҉̭̣̫͍̞e̪̤.̨̺̲̟̹͈t̹̟̣̝y̸͇̦p̢̖͓e͚ | ͚ | ̢̤̹͎̜̯̭̣ "̨̣" ̬͕͓͚͍̬̕)̢̭̮.̴̝̭̯s̩͙̣̝̱͚l͓͘i͉̣c̺͓e(͜0͈̬, ̟͍͍͇̺5̤̰̞̙)̰̱̲ ? ̧̱̝e͚̲̫͚.̵̩̖̤͉ṭ́y̫͕̹̗pe̗̠͔̣ͅ = ̫̣͔e͇̜.̠̝̖͙̭̖̜t̡̪̙̤̱̯̩̘y̵͖͕̹̩p͎͝e͖̩̝.͓̹s҉̹̳̹̝̪l̸i͚͖̜c͙e̞̮̲̠̜̕ͅ(͓̲̗͇̺5͚͔)̡̳̗͚ͅ : ̜͠e.͉̞̳͍r̴͇͚̩̹̮̗̝e͝m̹̬̮̩ͅo̲͚̝͕v̸̹̠e̠̪A̞̟̖͇̳̝tt̙̺͙r̥̞̕i̛͉b͉̣̺̝̬uṱ͎̗̺͓̫͟e(̧̣̪ "̼̭͔̟t̘̙̰͙͇y̷͕̭̲͇̳̜pe̴̦̱͕̣͇" ͈̖̀)҉,
                            ͓̹̫͍̱̤͠ͅe̶͉̻̟̬
                        }
                        ͍f̗̤̹͇͚͕u͚n̗̫̣ͅcṯ̥̰̱̩̫i̳̥̫͎̭̤o̤̫n̕ ̰͇̝͙͢L̬̥͖̘̫͕̯é(̷̣̭͉̳̰̗ẹ̮, ͇͖͝t̹͍̖̥̥͜)̤ {
                            ͇̭̺͙v̖̣̻͎͘ar̪̻̬̣͎̹͡ ̵̝̲̞͓̞͍̝n̹̭͚͙̦̳̲,
                            ̶r͎̦͈̱̳̦,
                            i̷̝̬̫,
                            ̱͈͎̺͝o̟̱̼̠͞,
                            ͍͜a͕̺̦̹̫,
                            ͔͙̩̖̱s̡̞̜͙͓;
                            ̺̭̭̖̖̠̝͢i̸̥̩̝f̳(̷͉̟͍̱͉̻1͔̬̥̝ = ͚͎͓ = ̫͈̱̣̫͜ = ͝t͉͎͎̞.̙͡n̸͙̤̱̙̪̖o̤̖͕͕͕̭d̮̠̼̞̯́ͅe̝̜͈͙Ṱ̟͈͡ͅy̖̩̯͇̱͚͖p͉̟̤̘̭͖e͙̪͍)̮̱͟ͅͅ {
                                ͓͚̖͙̤͞i̗̫͉͖̹̲͜f̮̭̳̝̱͍͢ͅ(͔͈̹͚Ỵ̰̠̭̟̕.҉̗͚͎h̯͎͘a҉̞͙̜͉̦̹s̢͕̩̼̞̙͉D̝͉̕ͅa̠̪̹̜t̘a͞(̸̰̹̫̳͖̳e͕̫͚̘̯͍̼)̷̦̬̤ & ̲̙̖̪̤ & ̢͓̹͚̦̗̹ͅ(̡̙̫s̷͎ = ̦̬̻͉̣̦͇Ỵ̢͚̘͖̥͕͔.̵̖̺͍̜g̗ͅe̸̜͓̠̠͉t͝(̪͙͓e̵)͕̗̞̰̀.̳͚͓̭e͜ve̡̤̠̠n̢t̝͘ș͖̭͈͈͍ͅ)̞)͉͕̼̀f͎̭̤̱̮ͅo̻̰̱̟͟r̪͝(̵̱͎̦i̖̙ ̢̞͍͇̰̤̦ḭ̯̞͖̺ͅn̗ Y̹͖̺.r̜̱̮̮̺͢ͅèm͍͓͉o͏̞̥̭̝̲ͅv̴̰̰͇͍̝e̖̲̫̫͍͟ͅ(͕̗t̷̤, ̼͙̗͠ "̨̦͓̯̮̼̣h͍͙a̫n͖̘̻̼̜d̦͞l̺͍̤̗ḙ̱̤̣ ̯͘e̮̣̜̣̗̩̺v̵̹̞͖̜̪͎̪e̦͈̣͉n̳͙̙̻̕t́s͇̮" ͏̦̲̭͓)̙̠͓̞͞, ̗͈̰͎̜̠̻s͎͜)̡̝̘̟͉͍͖̖f̗̘̜o̶̗̪̲̺ͅr̩̝(͚͈͈̀n̞͍̩̜̥͖̙ = ͚̖͙0͏͖, ͔̯͕̳̹̭r̼̘̟̳͈̯ = ̨̻̺̳̠ͅs̜͖͍[̸͔̻̗͓i̜͖͔̳͎̮̤]̠̼̘̮͕͔͝.͕̪l̥͈͉̣͈ę͉͉͓͇n̴gth̵͕̳̲̰ͅ; ̗̩̥̗͖̭n͙̬̦͉̲͓ < ̖̫̩̣͉̰r; ͏̥̟̜̰̠̘̙ń̠ + ̞͍̖ + ̦̮͉̕ͅ)̶͔̠̤̻͔͖S̳͇͇.͇̖͉͙͚̞͇e̡͖̩̼v̨̞̯̪̲͉̯ḛ̷̼͉̹̺̠n̥̰͙̲t̴͓̥̪͈ͅ.̜̫͈͓ad͎͎̙̬͍d̶̯͖̫̫̫̮̜(̙̳̫͠ͅt, ̞̭̺͙̰i͕̹̠̹͔͓ͅ, ̼̣̟͙̩̪̮s̛[̖i̴͔]̘͕͕̪[̬̼̱͘n҉̞]̫͚̯̤̦͖)̸͇̲̫͔͇͈;
                                ̜̥͜Q̦͍̞͜ͅ.̧̺͙͚͇h̪̣a͚̗̻ͅs̯̰͈͈̩͞D͖a̮̣̩̘̟t͉̼̘̫̳ͅa̭̗̼̤̤̥̥͢(̫͠e̤̙̦̠͎)̤̣ & ͎̘̯ & ͇͞(͕̮̳̜ó͇̼͕ = ̨͚͕͓̠͇Q.̛̫̲̼̥͖̮a͉̥̱̙͈͠c̳͙͙͙̭c̴͍̗̭e̯s̠̯̯͕͉͢s̷̰̦(̷̙e͓̮̼͔̬͓)̳̭̝͔̺̼̟͠, ̷͈̝á͉̗̱̩ = ͖S̲͉.̻̖̤͓̺̰e̛̻x̱t̵̤̝͙e̝̬̖̻͖ņ̗̲d̳̫̻̱͖̀({
                                        ̸̮̰
                                    }, ̶̙̭̘̬̘̮ͅo̸̳̙͓ͅ)̗͔̭, ̹Q̫͖̤̠̬͎̦.҉̰̪s͖͖̟̗͚͎̞e̛̫̻t̛̖̝̞̲ͅ(̖̘ṭ, ̴̭̗̬͓̝̘a͞)̨̥̘̲̺̺)͚̤̱͎̰
                            }
                            ̱
                        }
                        ̜͈̥̝͝f҉̗̱ͅu̵͖̦̦ͅn͔̱c̙̫̠̳̠t̸̼̝͙̻̟i̢͙ͅo̘̹̫̲n̢̟̟̪̻͉̦ ͏̙Ḩ̺e̤̳͢(̙͇n͖͕̝, ̨̰̞r̲͎ͅ, ̡̥̘̜i̕, ̩͉̪͍̕o̶̩̩̹̞̯͇̬)̳̪̗̬̯̝ͅ {
                            ̣̬͇̳ͅͅr͎͔ͅ = ̱͡g̮̰̭̮(̬͜r̙̤̥̠͖͍͜ͅ)̱̗;
                            ͓̭͓͍v͍̗͖̱̙a̡ṛ͉̹ ̟͔̬̹͍͝ę̩͚̩̲,
                            ̳̣̭̮̼̟̜t̸,
                            ͏̰̺̥a̟̟͕̣̤̺,
                            ҉̞̜͎͉̺̜s̶͎̲̤̳,
                            ̶̞͎̟̩̮u̵͉͈̙̘̠̫͈,
                            ̘͇̟͉ͅḷ͇̯̀,
                            ͉͎͟ç̝̗̳̫̟̯ = ͏͙͕0̖̤͙̮̹͖͙͜,
                            ̨f̫ = ̤͚̠̹n̼̰̼̳ͅ.̟͕͈̤͖l͏̮͎̫̗e҉̜n̬g̣̤͈̬t̘͍̝̼̩̘͢h̥͙͎͎̦̯̫,
                            ̢̻͇͙͇̤̱̬p̸ = ҉͇f҉͈͓͎̯͙̦͖ - ̘1̧͖̬,
                            ͞d͍ = ̥͚̙r̫͝[̭̪̘̻̲͔0̮̘̤͚͚̘͠]̭̜̝͎̘̀,
                            ̡̫̞h͖̜̗̙̺̞ = ͙m̴̖͉͎͍(̟̕d)҉͈͉̬̺̳;
                            ̤͉͇̀i̝͎f͏̪͚̙̥͙(̼̕h̡͙͕̖ͅ | ̛̘͇͉͙͔ | ̛̣̖̩̝̮̤̞1̱͜ < ̱̤̳̤ͅf͙͖̞̲̟̼͈ & ̶̫͕̻̙͇̖ & ̝͙̮̣̳̻ "̱̖̲͘s̥̤̯͍̹͜ț̳̥̝̠ṛ̹̩̥̬i҉̟̳͙n̹̣͕͠g̟͈̫̞̝̟" ͖ = ̟̥̖ = ̗̣̫̭̼̱̤ty̸̜p͓̱͈͍̳̠̻e͚̹͕o̥̩̝͓͓̬ͅf̴͙͔ ̦̟̙ḍ̼̕ & ̱̳̣̤ & ̢!̰̻̖͓ͅy̷.̴̲̦̮̠̰̺̹c̫̺̩̪̟h̷͖̯̮̙e̼̠͉̻̳͝c̢̗̟̥̟̺̜̱k̴̠̼͍͖C̗͙̹̞̟͔̬l̯͍͓͉̰̺o͇͚̣̲̰̻̮̕n̶͎͈̹e̦͕ & ̫̯̩̙̝̠̲ & ̹̗̼̤̞A̻̪̫̪̞̫e.̢̱̻̰͉t̛e̥̬̲͚ͅs͏̝̠͖̙t̮̜͇̲̪͉͝(d͡)̥)̡̦̙r͍e͎̜͉̭t̰u̲̮͖r͔͍̜n͙̙̘̱̺̹̥ ̺͈͓̖͔͕̱n.̸̠̞̥éá͉͔c̭̲ḥ͕͡(̣̣͚̠̭̠͖f͏u̠̫͘n̥͔̪̞͉c̙͎̘t̴̫̦͎͇̯ͅi̞͇̠͔on̗͉̘̠͚͔ͅ(҉̳̪͚̰̘͕͖e̵̙̰̮) {
                                ̭v̯̙͈̱̟͞ą͉̭̤r̜̦̜ ̺̘͟t̞͍̲̱͕ = ̙͈̀ͅn͏̹͇̗.͓͖̝̲e͘q̬(͕̳̦ẹ͘)̖̙̘̻̞ͅ;
                                ̞͟h & ̮̦̣̟͈̗͜ & ̥͕̱̘͓̮͜(r̻̟̝͠[͖̠͈̰̖̤0̢̣̤]҉̞̞̹̫͚ = ̠̘̪̟̞̻d̬͍̥.c̭͇̗̻̱̣̤͡a̤͔̖l͇̀l͖̯̬̕(th̗i̞̻͔͕̘̩s̴, ̤e, ̘͖̭͔̻̰͚́t̤̝̺.ht͉̳̳̲̻̗͉̀m͕̻͙̪ͅl̠̰͕͚͙̦(̲))͖̗͎̺)̵̹̹͈̗̭,
                                ̯̠̭H̢̙̥ḛ͎̲͎͓(̟̜̟̻̝t̫͖̠̘, ̫͙͔͙r̻̭̝͇̕, ̰̮i͈, ̷̪̯o̵̘̪̪̟)̤
                            }
                                ̲̘̮̼̫̤͖)̥̻̭̭̱͉̩͜;
                            ̯̖̦͉̹̣̝i͙̬̗̜͉f̼̖̘͠(͕̙̖̥̳̲ͅf͚̝̟̻̞̯ & ̱̖̬̖̯́ & (҉̥t̫̥̗̥̥̞̰͘ = ̼͙͉͓͙(̡͚͔̣͙̠̥͇e̞̺̠̥͟ = ̤̟͖̣͔x͔ͅe̳͡ͅ(̩̻̦̥̗̳͖r̯̞̲̱͝, ̢͚̮̞̻n̠̤̻̭̺̥͘[̺̱̬0͓̺͚̣]̙̩̘̥͉̙̯.̤̯̘o̵̮w̳̜̯͉̝̪̰n̼̯̬̬̳è̻̫̜͇r͠D̹o͍͓̤̙c̷̖͍̦͇͍u͙̯͇̤̪̲m͚̖̥ͅe̢͓͚̪n̦͟t͙͔͔̥, ̬̟!̧͇1̧̖̣̪, ̱̳̲̳̣̩n̮, ̶͇̤͚͈̥͓o̱͓̮̭̞̦͍)̝̜̤͚̣̟)̙̺̖.̢̲͔̟̰̲͖fͅi̠̬͖͇̝͇̲r̥̕s͙̀ṯ̡̹̙̼͚C̻̭̩̺͟h͖͓i̼̜̦̠̬͘l̘d̨̻̠̘̹̬, ̬͖̥̗1̩̺̲̮ = ̭̠̠͖͎̰ = ͙̹̼̳̝̥̻͜ = ̦͡e̟̹̫͚̠͈.̪̘͕̘̯c̥̳̦͔̰h͏̝i͢ḻ̬͜d̼̕N̞̝͇̲̭̬͡ͅo̥d̢̰ȩ̼̰͔̞̼̟͍s̨.̮̟̳l̶̼̲͍͇̟͍̙e͡n̠̲͖g̹t̶̟̮ḫ͔̘̩̹ & ͎̀ & ͢(̠̬͕͟e͏̭̺͉͔ = ̤͉̱̫̝ͅt̤͜)̡̮͎̝̝̰̹ͅ, ̠̤͉̮̟̱͟t̥̖͕͕͈͡ | ͞ | ͕̣͜o͓͘)̬̺̺͇̩̟͠)̝ {
                                ͓̙̱̳͕͕͎f̷̹̣̯̠o͝r̗̠(͖̣͝s̟͉̜̝͝ = ̟̫(̠̤͇̥̩̝a̛̝̪͖ = ̢S̙͔͍͙̳͍.҉͔̤̟ͅmá̺̖p҉̘̥̱͕̙̣͕(̰v̨͍̞e̛̦(̷̜e̷͉̤, ̨̱̘̪̖̳̭̙ "̗̠̼̞s̱̗͔̗͍c̰ͅr̡̤̦̝̮͍̬̬i̠͍̤͓̝̯p̵͕t̷̥̼̯͓" ̞͇̟͓͞), D̶̝͇̥̯̬e̱̪̯)̩̼́ͅ)͔̦̟̩̼̩͞.͔̮̤̭́ͅl̯͉͎̼͓̜ͅeń͎͍͓͎͈̜̼g̼̤͖t̨͖̳̹̠͉̠h̢̪̬̲̲̖; ̩͎ͅc̥̰͖̫̬͟ͅ < ̵̞f̭̗̗̼̀; ҉͇̙̻̟͚̹ͅc̡ + ͚͠ + ̜͉͖͘)͉̲͚u̧̙ = ̧e̺,
                                ̡̺̗c̭̝̠̀!̷ = ̥̻̥̝͓̭͝ = ̯͓͈̺̻̼p̘͚̩̼͙̹ & ̺̰̫ & ̱̣(̧u = ̞͔̩̳̲̤͠S͎̼̕.̶̫̠̭̥c̣̫̫̞̳͍̲l̰̯̤̹o̘̝̯̥̭̩̦ǹ͈e(̶͙u͈̰̱͎̝̮, ̬͔̼̙̠̮ͅ!̴͔͉͈0̙͓̜̻, ̠̦̦͉̫!҉̱̱̗0̤̮͓̻̳̳̪)̻̟̜̫, ҉̙s͓̺̤̹̹͠ & ̡ & ̷̙͚̺̟͓̪̮S̙̼̩.̪̖͍͚̯m͍e̢̦ͅr̪̩̫̲̺g̣̲e(̗͕̮͔̭̞a̟͚, ̤̣̝͖͚͍͚v̷̩̘͎̼̪͎e̝̬̻(̮̠̯͔̖̹͜ų, ̫͉̙ "̴̰s̱̼̘̥͉̼̥͜c͍̯̗͉͖͢r̯͙i̢p͝t͔͙̠̤̣̜" ̹)̛̯̫)҉͙̮̻̖͍̩̘)̺̮̀,
                                ̭i̠̼͙̱̣͔.̖ç̤̹̗a̬ĺ̟͇͖͓̼͎̗l͚̬(n̮͍̲[̖͎̬̩͚͔ͅc̴]͕̻̭̰, ҉u̗͇, ̖͚̟̰͙͙͡ͅc̹̣̗̪̫)̟͙̠͉̺̳̗;
                                ̲̙͓i͏̩͓̻f̮̳̳̪(̯̣̜̘s̤̥̠̼ͅ)͎͚͔͍͟f͏̗̘̖̝͔̬͙o̞̭͍̜̬̹̤͞r̖̩̘͖̦͠(͏̱͚̯͉l = ͙͢a̫̫͕͔̜̜̱[̼̳͈̩ͅa̴̺.̺͇̙̠l͚̹̳͓e̩̜̱̭n̘̰̭g̫̀t̵h͕̞̭͓̝̗͎͜ - ̩͉͜1̢͓̠̹̞͙̼].̦̮̙͇̩͠ơ̹̦͕̘͔͉w̜̲͕n̡̫͙̤͚̣̼̣e̠̺r̶̥͔̝̻D̷̳̺͖̩͔̖̪o̴c̛̪̤u̬m҉̘͇e̷̟̳n̤̖͖͙͈̙ͅt̖͈̭̖͎͟, ͚̹͜ͅS͔.͓m̯̠̘a̘̻p̱͚͉̻̺͇(̷̝a̬͍, ̪̥̯q̥̳͜e̤̠̟̲̠)͎̗̘͙̻, ̪͉͔̪c̙̙̘͡ = ̰̥̀0; ̘͎̲̝̹̣c̫͚͔͇̩̲̯ < ̗̹̯͙s̰̟; ͡c͙͓̞̼̯͢ + ̮̹͕̻͕ + ̥͞)̫̟͔̰͙̰͜u = ̯͎͟a̖̠͕͜[̵c͕͉̙̜͉͖͟]͚͉͜,
                                ͇͢h҉̭̻̩͉ͅe̯̝̯̬̥̮͜.̲͕͍̭͙̖͔́t͔͕e̞̱̥̝s̟̭̼t͎̫͕͖͇̀ͅ(͙͔̫̪͉u̢.̝̳̮͔̣ͅty̶̦͙p̬͘e҉ | ̮̣ | ̥̖̲̬̭͕͕͢ "̬̖̦͎̤͠ͅ" ͕)̗̞͖̘̞͇̭ & ̛͚̫̱ & ̼!̵Ỳ̰.̺̮̦̭͎ḁc̥͖̘̞̞̫̗c͇̥̪e̯ss̯(͓̕ų, ͏ "̯̩͍͝g̼̜̪̗͜l̡̜͕͙̪͙͈̦ob̪͓̙̻͙̝a̢̱͍͕͓ͅl͙̤̣̙E͏͕̜̯̱̙v̗̟̠͟a̪̳͔͙̩̺l̨͚̻̜͔̟̠" ̜̙̻̥͝)̧͚̳̯̩ & ̫̱̪͡ & S̰̞̜͚̼̟͍.͈̠c̸̜̰̞o͎͉n̤̟̞̝͖̯̣t̺͖̦̬͔͢a͡i͍̗n̟̙͚͚̳s̲̣͕͢ͅ(l̢, ̫̲̠̘͉̫̬u͇̱̻̙͟)̛͚̟ & ͏̮̞͈̺̰ & ̳͜(u̙.̸̲̩̭̺͖ͅs͏͓r̗͙̟̞͟c̠̤̥̼̥͈͡ & ͖͜ & ͜ "͍̗̪ͅm͉̝̲͈͘o̡̺̩̖̩̲d̸u̫ḽ̩̱͉̦è̙̱̟̮̗̟̼" ͇͙̫̥̕!͙̲̟ = ̣͇̱ = ̡͖(̖u̬̰̝̣͞.̨̦̹̤̦t̶̥̺͔y͝p͎̹̗̹̳e̬͙̟̬̩̞ | ̼̤̘ | ̘͖̥̭̼͍ "͚̙̥" ͕)̩̹̟͡.̛̼̘̲̤͓͙t̮̙̝̞o̩͙͙L̵o͔̻͚͜w̶̦̰̣͍e̵̱̭̲ṛ̣͚͚̘̺C͉̜̰̬̳̻a͖̳̜͔̥̰̠se̘̖͎ͅ(̞̺̼) ? S̵̱͕̰͉͓͕̬.͓̙̳͢_̛͍̣͔̤̖e̟͇v̧̪͚͔̻̠̠͈al̩̩̭͍͍̦̝U̳̝͎̗͓ŕ̝̳̜̲̜͍l̮̦̳̝̞͍̟ & ̞̦͚̲ & ̫̦͖!̲̥͉̲͍͙͙͡u̪̭̳̺̯͓.̶͙̣n̝̬òM͏̬̞ͅo̷̺̦̟ḓ̵̮͇̱̟̯̫u̪͔͍̕ḽ͙͉̦̥̮ͅe͍̰̜̥ & ͖̳͍̰̳̳ & ̹͚͉S͔̻̤.͖̼͈͖̤͚̼_̦͚̦̯͜ḙ̶̺̰̘val̪ͅU̮̮͇̯͕ṟ̪͔̠͚͓͇͜l̳͈̦̪ͅ(̨͖͓̺̠̝u̯̱̥̹͜.̴̻͎̜̰s̠̟̜̭̘͇͈͢r̸c̢͎̖̠͍̥͈̥, ̛̮ {
                                        ̡̙̱̯̫̲n̰̘o̱̤͕̱̱̮͝n̠͍̥c̺͎ȩ̗̦: ̳̣͈̗u͍͙̯̟͟.̰̫n̻̟̖͓o̹͍͚̥͉n̴c̢͇̰͖̗e͏̞͖̰̹̳̞ | ̶͔̠̖̬͖̯ | ̖̹ͅu͓̙̗͞.̪̥̭ͅg͎̘̮͢e̦̲̘̰̖̖tA͢t͇̯̗̭̬̣t̛̻r͖̝̫̪͓̀i͓̘̼b̩̲͔ͅu̩̦t̴͕͔̥̳̦̬e͖(̤̪̀ "n̙͍o͚͈̮͡n̨̦͈̞̣͍ce̥͞" ͍͙̣̥̫͉)͖͎̣ͅ
                                    }
                                            ̷̜, ̰̥̦̣̦l͔͖̲̙͈͟)̸̺̠̖̤̳ : ̙̟̞̗̦͓̺b̺̥̻(͓̝̳͎̟͙͍͜u͍̞̲̯͙͘.̱͘ṱ̛̯͚̝̼͖e͕̮͔̯̱͎x̯͈͖̤̖t͚̹͉̭̱̲̞̕C̻̥̻̪ǫ̥̝̭n͙̹̦̲͜t̞̫̝̻͔̩͜e̦͈̪̱̩͈̝͘n̼̦̻t̷̳͚̪͕̘̮.̹̗̹̩̫͜r̙̳̰̹͝e͏̰͖̠͍͍͇̼p̡̜̹͈̜͍̮l͙͎͔͚̠͖̗͠ạ͈̰́ce̸̜̙͚̹̳(͉N͖͚̩̯̙e͖͈, "̛̞" ̤̲)̥̰̤͍͉, ̳̞̼̘͕̺̝u̠̬̯̩̻̩̭, ̝͉̳̣̫l))̬͓̹̝̗ͅ
                            }
                            r̼̀e̡͚̫t̀u̢r͖͢n̜͜ ̠̮ͅn̦̥̹̘
                        }
                        ̝̰̹͉̺͡f̖͕̲̺̯̱u͙̼̗n̤̞̥̯̙̗c͉̖̱̗̥̹͜t̵̰̗̭͎͍̰i̧͈̟ͅọ̸̤n ̠͉̻̝͚͖̮Oe̝̜̖͚̖(̞̝ẹ̷̗̳̯̰̘͈, ̝t̘͓̲͖̥, ̵ǹ̪͕̱͉̗̺)҉͔̖ {
                            ̹̭̠̤̠f͘o̟̫̦r̗̦̼̹(͓͙̬v͇̘̣a̖̲̮̟̝r̼͕̤̮̟̦̦ ͇̻̹̬̬r͕͉͙̼ͅ, ͙͇̻͙̰͚i̧̖̞̘͍̭͔ = ̸͓̫̙t̹̗͇͙ ? ̶̜̜̭͙S̱̬.̭̹̬̗̖̥̯̀f̸̙̰̬̫̥i̢̤͓̗̳̦̲̘l̟͈͘t͇̪̦͖̥er(t, ̮̹̜͞e̴̥̻̣̯͇̺̪)͉͕̩ : ̖e̞̼͉͍ͅ, ̷̜̲̩ò̜ = ͜0̥̳̱̣̠̬; ͇̱́n҉̝̹̠u̢͙̤̻͇̦̖͖l̳̘̗̭̺l̦!̸ͅ = ҉̦͕͓̼̖(̳̞̮̞͎̬̬r҉̙ = ͡ì̮͚̳͔[̷͈̩͉ọ̼̩͍̹̟]̝̹̺͢)̘̪̮̘̬̬; ̦o̗̹̪̬͎̝̜ + ̞̳̠̖̙ + ̠̩̗)̵͎̳͔̬̣͕n͖͜ | ̟͠ | ̧̺̰̭ͅ1̙͎̠!̢̞̪̬̥̺ = ͇̀ͅ = ̡͇̭͍̘r͉͈̮͙͙̫̜͠.̵̟͇n̳̠̱̣̩̬o͍͉̬̝͕d̻͓̜͠e͏̜̪̖̟͓͖T̩̭͇̭̙̩͖y̜p͍ȩ̣̩̤̦̲͙ | ̦̬ | ̝S͔̞̖̗̼̗.͎̳̰͈̹̤̘͘c̘l͏éaͅn͍̪̰̼D̩͕̠̝̳̯͍a͉̜̦͙̱͖͎͟t̺͎͔̥a̶̺̫͖(͘v̴͎̻e͚͓ͅ(̵͈̣̼̭̘̙̜r̸̺)̶̦̤̜̦)̷̼͈,
                            ͇̜̱͇ͅr̩͖̘͈̖̥̩͠.͏̠̻͖̪̤p̼̟a̮r͕̫̤e̛̳̭̼̱͓n͔̰̠̹t̶̩̟̭̤̦Ń͔̞o̸͍͈̪d̵͙̗̣̪ę͍̣̖͔ & ̴͙̣̪̟̖ & ̤͖̬̝̗(͘n̴̖̣͍ & ̩̘̠̜̼̥ & ̩ie̝̗͔͉̣̗͇(͎̦͕͡r͓̞͞)̫̤͙̞ & ͍͖̲̪͓͢ & ̰̻̼̣̥̞y͓̯e̻̜͖̹̩(͖̟̯͇̞̞v̖͚̹̦e͏͚͇̠̗̠ͅͅ(̷͚̞ŕ̮̭̥̹ͅ, ͚̹͖̤̹͙͎͢ "̨̯̱͚̱͕ͅs̩̗̮c̗̰̝r̷i̛̜͚̹p̠͕̥͍̤̳t̖" ͈͈͈̤͈̱̯)͇̟̯̝̼̰)̦̙̫̟̙̪̹, ̴r̥̯͍̮̞̳̯͜.͍̝̜̞͔̲͝p̠̦ͅa̤͔͖̪̟͖͍r̢̫̠͙̙e̷̩͈̹̪n̩̪͈̥͚͢t̠̰̞N̢̻̫͚̥̼̲̦o̙͕̠͎̥̗̝d̤͇͙e̵.̳̕r̝͉̪ͅe̺̫̟͎̠m̩̼̥̮͇̣̕ͅo̼̦̥̮̭v͙̜̫̭̩e̡̺͕C̖̲̫h̢̻̞̤̥i̵l̷̰͎͎͇̻̖̞ḑ͚̬̘̪̱(̤̣̤̘r̼̪)͎)̰̭͉͉̰;
                            ҉͚̝̩̺ͅr҉͎̥̯̥̠̲͇e͕̲͙t̪̜̭͕̬̤̘͘ưr̲̬̟̝n̵̖̳̝͕ͅ ̀e̝͕̞
                        }
                        ̶̣̖͙̣̟S̜͉̥̻͝.̮͜ȩ͙̱͇͎͈x̳̥̥̥̕t̪en̘̳̼̣̜͠d̻͜ͅ(̼͔̪͙̦ {
                            ̮̼h̺̖̦̯̰̯̕t͈̰̠m̝̬̹͍̀lPr̴̻͍͓͉̙e͇͉̫͚̥f̶͖ͅi̪͇̹̤̻ͅl̩̤͓͖͈t̬e̫̗͓̣͉̺̦r̨̯̟̣͚: ̠̹͕͖͎f̖̮̥͍ṳ͍͓̖͎͔̺n̫̲̝͇͞c͍̜̼t͏͓̙̟̭i̹̩̺͡o̸̞̫̭̻nͅ(͖̰͟ẹ̢̭)̨̳͔̙̖̣ͅ {
                                ҉̻͎̟̞̘̤r̢͓͙͕e̯̖̠͖ͅt̝̤u̡̦̠̪͔̭r͏͈̹͓̘̰ͅn̟ e̢̱̠̠̰̘̯ͅ
                            },
                            ̣̜͚c̶͉̲l̙o̞̙̰̣̳͎̤n͚̖͚̟̺̘è͍̝: ̖͖͘f̷͚̮̹̖̼͖u̡̘̝̗̖͔̟̞ǹ͔̦̬̙̼̤c͎̖̝͙̘͖͓͞t͔̹͚͔io͚n̼̠̰͇̮(̧̗͔e̶̪̣̼̰͎, ͍̖̻̜t̛, ̣̘̘n̴̠̭̮)̶̪̳̜̫̖ {
                                ̴͉v̯̺̣̼̟͎̥̀ą͍̪̲r̖͚̹̩͎ ̷͚͔͎r̸͇͎͍̤,
                                ̝̰̲͇͝i̗̳,
                                ̰̱͍o̖͕̩̱̗͟,
                                ͇a̰͝,
                                ͍̙s̴̝̳͓̯͉̘,
                                ̮̹̣̭u͍̭,
                                ̻̗̰̜͜l͓̦͎̠,
                                ̶̮̟̤̼c̫̥͕̜̺̼̜ = ̨̝͍̜e҉̖̤.̨͚̺̗͈̗̯͍c̤̪̩l̨͚̗͍̪o͈͎n̸̟̥̼̥ę̱̬̥̦͙N̢̼̜̠̹̰o̰̼͙d̴̥̼͓̣e̡̺̖̹̟̯̦̟(͇̥̳͖̕!̳̝0̳̭)̫͚,
                                ̥̱̰̲͝ͅf͕ = ̴̞i̼̫e̘̻̫(͈͠e͇̩͇)̛̲͇̝͎̗̯̲;
                                ̯̱̠i̖̖̫̝̠̞ͅf(̷̰!͜(̣̞͍y͈̝͙̹͓̱͇͞.̖͝n҉̤̠͖̞o̝͖̮͍̫̳͙Ç̝̳̩l̸̖͈̻̤o͕n̲̤͠e̠͍̠Ch̯̤̝̼͔͟ę̥͕͉̣ͅc̸̤͍͎̩̮̱k̯̠̖̰͖̲e̩̥͓d͉̝́ | ͏̺̞ | ̹̗̀1̖͔!̟̮̪̪ = ̖̜͔ͅ = ͈̮̞͍̦é.̹͉͎͉̲̬͞n̘̱̞͍od̻e͔̣T̨͎̝̙̻̬͚̹y̢͚̱̜̖pe̫̩̠̥͇͕̣ & ̭̜͚̦̣ & ̯͍̩1̨͎̝̻̳̗1͇̹ͅ!͠ = ̵̳͚̹ͅ = ̙̲̻̼̰͔͠ḛ̭̳̩͓̝̜.͕͔̯̥̤͓n͘o̝͉͟d̞̖̻̲͉̤͠e͓T̫̖̪̲͙̪yp̟͙̜͍̞̥ͅḙ̫̫͍̫͠ͅ | ̳͍̫̻͉̩̘͢ | ̣̮S͏͕̻̮.i̱̻̥͓̬̹̮s̴̜͔̩͈X҉̦̟̫̼̩ͅM̥L̰̞̣̝̬̮D̴oc̘͕̰̖͕͚͚͢(̨̺e̹͚̺̭))̖̪̤)̷̤̟̻̠f̸o̶͇̪̜r͏̲̹̻͖̲̟̪(͜a̧ = ͚͙͉̖͎̤v̝̺͔̞͔e̗(̬̗c̨)͚̠͘, ̱͔̙̠̞͟ŗ͓̜̞ = ̲͚̮̱̙̻͝ͅ0̱̘̝̱̤͔͖, ͇̣̱̪̜̫i̫̘̦̭̪͓͞ = ͟(̫̜̘̣o̬̰̯̮ = ͙͡v̱̰͇̠͡ͅe̷(͖̘̤̠ę͕̺̝̯̙̭ͅ)͙͍̫͉͘)͚.̘̝͍̯͙͟ḻ̙͉͖̯̹ͅen̘̼͍g̣͎t̮̮h͈̱͎̳͓̞͟ͅ; ͕̜̱͝r < ͉̣i̭͓̹; ̀r͏͕̪͖̮̼̰ + ̡̮̩͔ + ̬̫̼̲̗̻͇)̨̥̻͈̤̻̖͈s̴̪̙̩̝ = ̲̻̙̬̗͈̭o͈͈̕[̡͇̫̘r]̭̫̫̗͙̪͞,
                                ̧̖̰̦̯͉u͓̣ = ̟̭̗a̸̺̱͚͓[͕͚̺̥̞̰͈r̪̝̺]̡̯̪,
                                v̹̥̺o̥id ̼̩͈̺̟0̢̭̙͓̤̺̥,
                                ̩͇̭̘͝ "͎̯i͓̩̞n̼͓̰̤͓̖ṕ͙͍͓̦̦̫u̪͠t̴̥̩̲̝" ̸͍̟͍͇͈͇͖ = ̺̠̣͙͈̟ = ҉͎͖̥ = ҉̳(̝̰l = ҉̥̺͉ù̠͈.̝̯̥̙͎̲͘n̶oͅd͇̬̜̜̰̭̠e͖N̷a̷͍͕̯̖͈m̵̠̺e̫̦͍͓.̵t̪͎̻̺̦̜̤͢ơ̰͎̠̮L̯̻̳̤̤͇̳͜ơw͏̥̰͇e̕r̜̣̭̰̗C̮͈̘̼͉̺͜a͖̣̼̜s̳̮̹̖̪̜e̶͉̞̘̮(͎͙̝̱͓̳͢))͇̪̙͖͜ && ͎ͅṕ͔͇̗̜̮̖͉ę͎͖̱̻̺̞ͅ.̩̠̝̫̀t̯ḙ̻͝ͅs̞̼̫̞̱t͏̫(̵͖̻̦͎s̡̝̰.̫͔̪̗t͖̟̰͜y̶p̭̣͡e̥̲̠͈̣ͅ)̲͎̭̖̦ ? ͍̲͉͜u̱̭̼.̵̩̜͚͚c̵͍̱͍̘h̗̠e͖̯͔̗̹̘͔c̪͇͕̘k̘͉̖͙̙e͍̥̣̝̘̬͜d̷̙ = ̩̬s̞̞͚͈͕͞.̳̩̱̙c̙̼̯h̻̜̙̠̳ͅe̦͈̖̯c̭̤͙̦͚͕ͅk̳̙̲͕̳̬ed̰̰̱̝͙ : ͈̮̮ "̙i̫̹̮͜n̴p̭̖̥͈͈ų̮̰t̖͖͍̳̜͓͝" ͚̟̱̻͢!̨ = ̢̱̺̞̦ = ̞̬̘̦̺̖̝͠l̷̩̭͇͙̭ & ̵͔̪ & ̸̠ "̺͓̥t̺̠̹e̹x̤͞t̷̤̳͙̼̹͍a͓̘̖r̭̗̫ḙ̣̯̬a̬͕̻̱̟͉ͅ" ̘̺̠̦ͅ!̷̝̳̖̬̗͙̹ == ̺͟l̘̮ | ̲̱̩ | ̀(̪͢u̗͕̙.d͔̳̜͓ę̱̰̘f̛̺̩̳͇̣̖̝a͖̼͍͍͟u̴͖̩̯lt҉͎̱̟̥̙V̴͚̰̦̬̻͓ͅa̱͕̥̭͟ͅͅļ̬͍̙̬͓̙̖ue̶͕ = ͎͔̣̲̠s̯̗͇̪̲͔̞.d͏͈̖̫̗̯͚e҉̪̲͓f͍a̝̖͕̘̣ṳ̷l͕͢ţ̖̮̥V͏̭̝͍̦̹̟a͚͍̲̠l̻͞u͉̝͠e̼̮̗͚̲͓͉)̹̤͇̮̞;
                                ͢i̬͔͈̞͕ͅͅf̢͚(̦͇̥̕t̹̞̠̪̦̼̫)̛͚íf̝͇̼̤͕̬͇̕(̘̼͖̭̩̩̲n)̺̭̬͡f̖̰̣̠͈͞o̷r̳͇̻̟(o̶̮̦͚ = ̛̭o̲̟̲ | ͢ | ̷̼̩͍̙͖v̱̯̫͕̣ͅe̤̯̠͉͘(̶̳̭͍e͖)͍̞̗̬̣, ̺͎̬ạ͖ = ̟̣̗̹à͖̗̰ | ̛͍̭̺̼̞̠ | ͈͎̠̩͇̭̪v̻̹̪͓͇͢e̗(҉̝̮͈͔̪ć̩͔)͉̱̩́, ̹̯͎ͅr̞̠̮͇͖ = ̡̫̭̬̱0̤ͅ, ̟̦̥̫̼̪̺i̠̞̪ = o̩̗͝.͖͔̩͔̜̯͝l̴͈͈e҉̥͇͇̲̝n̜̘̥͎ͅg͍̖̪͟t̬̰͔̕h͔̻͉; ͉̪̩̺̝͔̺r̜͈̯̼͔ < ̣͕̜͟ͅi̘͡; ̻͖͕̳r̢̲͚̬̫͔͓ + ̘̳ + ̦͓̳̰͖̮͖)̙̬͎͟ͅḼ̯e̯(̡̫͇͔̱̲͔ͅo̡[ͅr̙̺]̶, ̲̱͔a̵[҉̗̣̯r̼̰̱͈̰͓]);
                                ͏͓ͅé̞̘̹̦͙ͅl̨̩̰͙̲͇̦̬s̠̙͇̠̺̞̻e̪̝͔͇̪͎̻̕ ͎̜͓L̬̼̝̪̣ȩ(͎̦͎̮͙̰̼e̻͇̲̖͎͖̞͞, ̪̣̬̰̗̖c̪͚͚̩)͉̤̮̝͘;
                                ̘̺͉̬̯̝͞r̤e͚͙ţ̺͓̬͚u̝͔͓̫͙̫͞ͅr̩n͙̞̫̺̯̻̭͘ ̨̜͙̮͖͙0̴͍̗̘͙ < ͙͍̻̫͖͞(̻̫͎̫͕̝͔a = ͔͟v҉͉e̢͍(̖͚͝c̬̹, ̼̥̪ "̭̪̭̮͕̻s̥̠͡c͖̭̟̟̘̱̫r̸̗̩̠̺͍i͏̻p̧̩͙t͚͈" ̤̹)̡͎̙̩͈̝̘)̦͇̩͟.̙l̯͇̗̮̙̻en͎̜̟͔g͏͎̤̦̦̝̩̠t̲͉̠̻̞h͕͚̻ & ͏̰ & ̙͖͕̥̦̗ye̪̫͎̰̺͜(͝a̡̹̦̻̗, ͙͍͕̥̫͟!̠̤̠̼f̴̯̙̘̫̤̦̠ & ̳̜͟ & ͉͉v͈̖e̪͉͇̖(̡͕̫͓̣̠̫ẹ̼͖̬̬̰̮́, ̦̳͕͖̘ "s̻͙͓͚c̤̼̳̫̀ŕ̝̦̮͎ì̻̻p͚̲̲̯̺t̤̮̻" ̸̯))̳͖͔̞͙͕͜,
                                ̨̠͍͖̜̟͇̳c̬
                            }
                            ̯͓̗̩̰̠͜,
                            ̙̯̝̺͘c͕l̵͚͖̩̪̩̫ͅȩ̩̱ḁ̡n͎̥D̷͓̬̼̙a̴͍̦t̡̹̟̻̭̫͙a͓̳̦̭̤͉: f̹̬̝u͏̘̠̪̙͕n̗̩̯̱͜c̹͈̜̥̦͔͞ͅt̡͇͇̠͙̹̞̠i͏͔̱̩͚o҉̥nͅ(̧̺͎̲ę̟͍̣̪̤̰)̮̜̘ {
                                ̫̹̳͓͈͉̲͡f̺͙͔̪̫o̻̯̣̰̤͘rͅ(͙̖͓̰̲v̥̣̝͍͖͘a̷̩͉r̸̝ t̬̟̣̗, ̰̠̜̟n̠̼, ͚̲͓͎̭͔͙͞r̸̫̪̱͔͇͖, ̟̹̠̭̟i̴ = ̨͓̖̠S̺̺̗.e̦̤͇̹̟̳v̘͓̻͙e͔̭̖ṇ͞t̹͎̺͎.̙̲̩͓͇s̼̟̮̪p҉͓̳̻̳̼͙ͅe̯c̥͍̼̤̗̟͜i̸̫̱͕̹̗̼ạl͙̩, ̧͎̝̮̬̱̘o̘̖̳̲̗̳͝ͅ = ̷͇͈̮̼0͓̀; ̰̲̝̻v̷̥̫̳̦̱o̥i̡̥̪̼̤̘ḑ̰ ̷̞0͚̦͡!̘̦̼̪͈̫ = ̬̼͜ = ͕͔͕̩(̪̤͔̲̰̗̙͟n͏̭̳̤̯̘͈ = ͙̣͇e̜̭͙[̭̰̮o͍͠]̤͈)̟͍̼͇̣̥ͅ; ̡̟͉̺̩̻o̸̺͍̰ + ̫̫ + ̪̯̤͇̜̭̲)͇̤̳̯i̛͚̳̜f̶̟̞̲̝̱(͇̹V̡̞̙̥̺̬̺̹(̮̘̹͉͡n̦)̫̀)̳̟̭͈͕ {
                                    i̴f̧͓̝̤̪(̣̠̻t̷͙̤̣͚ = ̬͖̟̳̥n̝͔̭[̡͖̘̜͇Y̲̲̫͍̼ͅ.̷͍͚͚e̵̠̗x̥̘̱p͖͖͚̬̯̀a̦̻̗̫͞n͎̱͕d̯̱̙͇̙ͅo͢]̧̣̦̰̹)͏͖͉̬̤ {
                                        ̶i̼̖̩̼f̻͔̹̞̳̻(̙̟̼̝͉̘t̹̗̝̙̦̣͟.͚̻̼̘̫̥̮̕e̩͕̰̣̼̼v͔͈̗e̡̠̘͓̙͙͕̹n̺ṯ̖̬̟͉͈̻s̛̺̥̭͇ͅͅ)̡̱f̙̘̼̦͢o͚͔̬͚r̨(̗͈̩̥ͅr ͓̦̪͚̭͝i̪n̶̗͉ ̪̺̻̬t̲͓͈̭͚̬̪.̛̺e̱̻͓͙͇͓v͙̦̞͎͍̲͎e͉̦͚̹̲̗n̷͙̹͉͈̞̱͉ț̘̯̭s̘̯̟̟͍)͇̘i͉̫͙[͏̙̤̱͙r̗̰]̬́ ? ̪̗̥̱͚͕͍͠S̮̭̞͢.͍͎̫̻e͙̰͓̫͈̫͜v̮̠̞̭̦̰͕͢e̢̬̱̳n̛̙͕̱͎̩ͅt̪͇̳̻̼͝.̣̞͚̦ṛ̘͍͉e̱̩̖̼̟̭̤m̝̖ov̦̬̫̪͟e̹̭̼(͕̗̼̞̞̫͠ṉ͍̺͖̝͞ͅ, ̵̗r̭̺̺͖͖̭̙͘)̷̱ : ̡̞͎̠͉͚S̼͈̺͝.̨͉r̨̝̖͔ͅe̻͖͖̹̮̳m̪̙͜o͞v̶̼̰̬e̶̲E̫̞̲̱̻̩͚v̹̼̠͎̗e̜̫n̡͕t̙̠̟͕(̨̹̺̟̜̭̠n̵̻͕̦̬̥̭͇, ͏̝͎̻̲̰̭ͅr̪̠̝͔̩, ͙̹̗͜ͅţ̥͙.̮̥͓͕̠̲͙h̲̰̞̺̺á̘͔̜n̺̖̠̼̮͢d̟͚̝̪̗̹̝l̛̗͚͇̬͖̜͍e)̝̻;
                                        ̖͕n̶͖̱͔̩̮̰ͅ[̵͉̰̰̜Ỵ̡͈̲͕.̖ẹ̵̯̝̙̣x̼̬̞̘̺͖͜p̻̰̺̥a͔͝n͢d͍̫̮̜̩͖ͅo͔]̻̥ = ̡̞̱̱v̜̬̝̱͎̕o̧͕̣̣i͡d̙ ͎͙̠͈̫͝0͏̲̮̹̭̣͙
                                    }
                                    ̹̬͉̳̺͠ͅn̤̰͔̦̪[̬͎̳̘͎͈Q.̷̦͎̮e̸̝̬̬͖̦ͅxp͉̩͜a͇n̺͓̣͉d̙̪̱̻̖o̥͔͓͍̩̩̜] & ̬ & ̦͉͔̼͢(͏̩͇̤̞͍n̶̪̦[͖̤͍ͅQ̷̳̪͔̖̻̥̟.͙̞̲̲͓̲e̫̜̦̫x̟̳͎̯p̴̲͕͍͖͉̪̲a̶͕̞n̝̫d̪̙o̦͚̘̱]̬̝̥́ = ͈̹̟̫̟v҉̰̭̹̻̬̮o̳̖̻̖͔̪ͅi̱̮͚̘d̤̦̼̬͔͓ ̻̘̬̮0̷̮̯͉̰̻̱)̣̖̥̟̣̝͝
                                }
                            }
                            ̠͘ͅ
                        }
                            ̰̕)̸̟̼̼̻,
                        Ș̭͕̟͔.̦̣̻̦̗̤̖f̡̩̹͍͕̬̮n̟̘.̹̱͎̫͢e̙̥̭̟̤̠͜x͚̥̰͎̠ṯ̺͖ẹ̝͞n͓͔̱̯̳͠d̝(̳̣̞̼͖̤ {
                            d̷̤̻̲͓e̯̟̞̠̱t̡̞̭̤͔̥̘a̱͉͖̞͍͈̗c̩̜h: ̤͉̟̦̹f̺̯̼̱͙̯u̦͎͙̞͙͘ͅṇ̡͇c̹̳̠̻͕͟t̨̞̝̣͈̮̩ioṇ̰(̶̩͎͚̻e̜̻̤͔)̥̞͚͙͚̲̪͠ {
                                ̻͎͖̳̪̮̦r̤̀e͉̫t̩͉u̬͕͓̙r̴̗̩̥̜̙͚̣n̞̖͓̬̣͈̥ ͍̫̼̗O̶̪̘̺̗̪e̹̭̦̹̳̮̫(̲̭͡t͙̼̳̥͇̖h̢͍̙̟͍̫̻i͓͕̼ͅs͡, ̷͈̙̬ḛ̮̤͎̲͉͓, ̰̱͔͓͔!͠0̡͔̭̻̟̬͇)̡̮͙
                            }
                            ͔̥͘,
                            ̞̙r͚̲̮͠e̶͔̻͕ͅm̠͉͍̥̪̪͉o̟̗̜v̻̘͖̭̻ȩ͚̯: ̛̰f̱u̶̺̭͈̮̬ṇ̠͚ͅc͓̦̟̜̖̠͠ţ̱̟͙̟̯̖̻i̬̤͎͓̘͡o̘n͍̤͖(̭͎̥̹̬͉ͅe̬̳͕̠͖̠)͕͚͖̱̙̯ {
                                ͅr̲̺͙e̢͉̩tụ̲r̺̬̯͢n͍͍̼ ̴O̖͔̪͙͞e҉͙̤̭(t͎͈̹̦͢h̞͎̭͈̜i̥̪̯̺͎͟s, ͚̫e̯)̵̟̼̲͓̬͍̤
                            },
                            ̰͕͎͝t̯͚̫̻͡è̜̬͖͕̙̣̱x̗̲̱͙͚̭̳t̸̟̼͖̘̞: ̡̹͎̪̖̻̮͖f̭͓uǹ̼̪̻͚̞̠c̷̳̦̯͕̬̫͈t̘̘̬i͇̦̬͞o̗͓̦̲̟ͅn̴̩͓̦̞(ḙ̺͉̠́)̖̗͇͟ {
                                ͓̩̫͠ŕ͖̭͙̹e̷̥̥̠t̠͇u͇̙͇̬̙̜͎r̗̱̺̼͓̼̲n̜͈͉̼̣͇ͅ ͔͍̹͞$̢̥(̘̗̻̬t̢̻̗̠h̩̤͈̱̪ͅí̪̥͚͕̝̗s̺̹̱, ̢̺̖͚̹̞̪f͓͍̪́u̯͙ͅṇ̬c͈͚̱̟t̛̯̮̩̮͔ͅi̸̬̦̤̯̼͍͚o҉̳͖̩͎ͅn̸̘͓̘̫̠͔̮(̞̲̫e͇̫̟͓̪͔̱)͏͍͖̣̟ͅ {
                                    ̬̹re̖tu̶̞̭̺rn̠͙̺ ̜̠̭̼͇̫͡ṿ͎̬́o҉̹̻̺͔̼i̻͍̤̠͢d̯ ̥̲͓͖̕0͖̺͈͍ = ͔̜̱͔͙͇͙ = ̠̱͉̝̠͎ = ̱̱̱̫͚̕ẹ̠͉̲̝͝ ? ̱̰S͉̞͙͡.̻̼͇̹̕t̢̘̯̞e̩͙̣xt̹̞̭̩̞͠ͅ(̩̼̗͈͉̝͡t̮͙̫̠̞̪͉h̖̪̜̻̫͖̲i̥̜̙͠s̞̯̕)̡̭ : ͍̱̯̖͕̘̜t͟ḩ̰i̴s.̭͙͖̪̣̲͈ḙ̢m͓͖̺pt͈͍̹͎̖͕̘y̱(̡̘͖̘̼͖)̗͉̲.̖̬̲̫̰͝e͍a͉̬c̪̻͓̹̝̣̥͘ḩ̙̬͕(̷͔͕f̞̺̟̙̘̺̣͝u̹̺͞nc̙̳͉͢t͜i̺͝o̼n̰̞̜̗̲ͅ(͙̟̟̘͓̝̺)̖ {
                                        ̥͉̘̹͘1҉!̻͈̜̱ == ͕͈͕ṱh͕̦̥i̮͈s̢͖͇̩.̘n͍͎o͎̗̖̺̹d̥͓̞̀e̺͎̘Ț͍̰y̹̞p̭̘e & ̷ & ͔̻̺̰͘11!҉̬̬̺̯̼̼̖ = ̙͉̳̩͡ = ̖̱̱͇t͎̳͉̰͓̀h̶̩̝͖͕̳̲is̤̠͈̬̼̕.̥̙̥̮͓n̳͇o̶̰̥̻d̞͖̬̟͚é̝̲͕̲̝̳͉T̩͎y̤͍͜p͇e͇̹̙ & ͉̬̜͉̣̼̩͟ & ̛͉9̳͍̟̖!̬͔̭̼͕̺̖ = ̶̭̻̻̰͓̹͕ = ̪͕͕̫͔̞t̯h̩̻̤̜͢i̪̝̤͉͓s.̖̱̲͔͡n͕̝͎͖͕ͅó͔d̺͎̟̀ͅe͈̠͎͞T̞͚y̷͚͚̲̫̺̞̝p̡͕̻̘͓̫̱e | ̨̰̭ | ͎̼͇̟̫(̥̹͙̝̜ͅt͈h͔̱̼͟i̱̹͡s͎̙̺̦̻̩.͓͇̞̣̟t͙̠e̛̥̳x͍͈͚̦͍̬̺t͚̕C̛̰̱͇̟̯o̷͉̪̞̝͇͙̮n̠̹tͅe̯͈̭̖n̗̩̥t̥̬̙̰̘ = ̱̟͚̦̥̞̳͠e̥̲̙̗̦͙̯)̪͎̖͈̟͈
                                    }
                                            ̯̣̝̥͕̀)͙͓͢
                                }
                                    ̧̰̝̳͖̤̥̙, ͟nul̢͖̭̬̬̙̹l̶͍̲, ̥̟͖̰̖͔ȩ, ̮͈̙̣͇̣̼a͇r̡̠̳̺̻ͅͅg̘u̠̖͙̝̪m̗ͅe͙n̞t͔͚s͍͖̳͚.̙̘ļ̭̦̹̖̯̩e͙̜̭͚n̫̜̝͇̕g̪̪̹t͕̫̗͇͓h́)̥̲̮̪
                            },
                            ̥a͔͉p̭̙̜̫͎͡p̜e͖̲̙̤͇̭n̼͞d̸͕͍͚: ̻̣̟̤̬f̰͉̖̗ͅu̺̘͉͈͈̲n̛̞̗͎̮̳͖͈c͉t͈̣͜i̫̠͚͈͈͟ͅo̺͉̝̗ͅn̻͇͇͍̘(͢)͞ {
                                ̶̮̯̦͖̲̥r̯͙͟e͚͉t̳̩̹̦̙ưͅr̠̞͉̺ͅn̨̤͉̦̺͚̮ͅ ̲̘̖H̛̖̜͚̟̯̥͔e̡(͖̜t̫̭̦͓h̯̬͍i̛̝̤͇͙͉̥̻s̻̹̙͕, ̩̟̗͔͇͖a̬̰͈͖̺̻͢ͅr̢̮̱g̦̥̯͈̻ͅu̥̗̦͖̣̰̣me͕͉̩͟n̯̪̩̟̱̱͎t̠̘͙̮͚̪s̻͚̭̪̗, ̷͔̻̠͍f̟̺̺u͔̯̞n̫̘c̟̰͚̼t͏i̛̲͇̞o̮̙̱͉͕̼͚ǹ̲̠̥̻̭͓͕(̯͎̰͢e̤̬͖̞)̷̹̪̥̯͚ {
                                    ̝͔̀1̞̝̞̯!̦̞͍̀ͅ = ̶̻̯̪͈̦ = ̟̫͎͎̠̠t̯͉͇h̵̭i̝s.͚̺̠̠̣̀no̠͙͉̟d̘e̶̹T̮̯̬͔͇͈̣͟y̤p̱͔͎̻̝e̻̙ & ͜ & ̤͓͉͖̘͕͕1̖̼1͍͢ != ̺ = ̴̹͇̲͚̬t͍̰̫h̘͇̟̮i͇̰͔̘͞s͔̹̪͡.̞͞n̻̟̝̩͓̞͝o̤̟̥̜͕̺͚de̛͙̥T͕̥̘̱͍͢ͅy҉̝͇̖p̘͓͎̼͓ę͉̝̖ & ̛̪̱̮ & ̡9̸̯!̙̺̣̭̝ = ̛ = ͓th̘i̹̹͉s̻͉̯̮̭̭͍͝.̲͈̗̼̀n͉̟̹̞̟͡óde̪̭̰T̯y̷͙̥͍̦p̸̼̪͇e͇͓̻̯ͅͅ | ̰͍͜ | ͏͙̩̼̟j͍̱̝͉̯e͕̮̠(͎͓̻̖͎t̛̞̰h̲̠̗̤i̫͔̦̪s̞͢, ̞̟̞͎͓̼̘e҉̫̜͖̣)̥̲̲̘̲́.̖̝̭̤̜ḁ̞͖̭p̮͖p͎͙̤̖͖̳̕e͈̫̰͚nd҉͎̫̜̱̹C̯̬͔h̗i̞̰̱l̝̘͚̭d͜(͇̩͇̬̣̩̭e̡̺͉)̡̗̞͍̱͉̺̭
                                }
                                    ̜͚̺̥̭̣͇)͎̟̰̟
                            }
                            ̥͇̼̙͇,
                            ͓̫̜̥̱̲͕p̡̦̭̮r̝̱̜͜e̻̟͈̯̞̟̟͢p̞̼̗é̦̠̟̟̯̮nd̸͖͖͎̤̘: ̧̝̖͍̦ͅf̤͍̲̬̞̠͞u̴̥̘̣̥͍̝n̤̺͎͎͓̺̙͞c͖̪̫̞̟̤̩t̮̥̥̟̺̞͠i̛͓͙͎͓͈͙o͏̭̠̠̙̤n̯͉(̲̯̰̺̱͍̟)̺̬͍̖̗̲̤ {
                                ͖̥r̼͕͉̬̗̹̞ḙ̱̯͔͙̥̲͝ṱ̬u̘̗̻͇̣r̶̻̖͚̝̞͓n̮̹͟ H̯͈̬̜̪e͖̟̦̲̭̟̥(ṯ͙͔͎̱͇hi̢̹͍s͖̰̯͕͍͓, ͓͎̩̲̜͈̝a͈r͘g͚͔̗͍u̸̗̗͈̗̹͈̙m͈̦̳̥̹̝͇e͓̙̦̯͞n͍̠̦̺̟̰͟t̝̗̗s͉̫͍̦̜̞, ̩̜̪͙̭̩͡f̮̜̮͎͝u̴͕͎̜ņ̳̪̰̰̯c̸̹͍̳t̻̰̬i̙͠o͞n̯̯(̤̬̖͜ę̮̭̖̞)̵͔ {
                                    i̲͡f͈̮̼̰͓̱(͈͡1̨̼̮̫̤͈ = ̧̖̪͖̣̘ͅ = ̛ = ҉̠̗̳͕̯̖t͏̟̟h̫̠̗͍̝ͅi̶̗̩̖̩̗̮̤s̞̬̖̯͓ͅ.̥n̲̪͓o̤̭̦̟̞deT̮̘y͖͉̙͉͓͚̳p͖̫̟e | ̤͕ | ̦1͚̬̲͜1͉ = ̫̖͍̙ = ̼͔͍͓̜͢ = ̵͎̯̬̦t̴̼̮̠̺͕̖̼h͖̫̪̼͈̘í͇̱s̼̙͉͍̦.̷̪̼̜n̖̠̭o̺̰͖̱̟̮d̷̦̻̹̯̮̠ͅe̮̣͝T̹̘͎͎̹͖̯yp͏e̖̭͡ | ̺̹͙ͅ | ̶̠̖̦̭̠̭9͙̞͍͜ͅ = ͇͚̳͍̤͟ = ̮̳̱̲̪̦̬ = ̲̲̫̭̗ͅṯ̀h̦̻͓̖̤is̳͎̞̥.̳͓̻͕͍́n̵̬͈̥͈o̡̠͔̲̪̹d͔̭̖̥͚͕̜́e̬̠͉̟͓͔͞T̥y̤̫̮p̱͔e)̨̳͖̹͎͙̬ {
                                        ͓̩̹̥̥v̵̪̻̮̤aͅr̨̪̺͇ t̟̯̻̹̹̖̤ = ͈j̗͙̫̝̣͈̳e͏̬̘̦̙͇̦(͙̩̳̞t̝̫̖̬͚͓h̠̘̯̳i̠̝̣̰͓͠s̞͕̭͍̰̱ͅ, ̹̠̲͉͕͚e͕̲̪)̺̳̳̤;
                                        t̩͚̱̭͕͓͡.҉̳̱͇̣͇̜i̴̩̰͇̞͍n̷̘͔̥̲̲̩͉s̠͙͚̜̥e̟̩͉̲r̶t̛B̨̺̜̩e̶̝͔͚̰̣̻̘f̸͕̭͓͕ͅo͎͕͎͈͞r̳͔̳͞e(̹̭ḙ͍̗͉͇̤, ͔̪̠̭̖t͔̗̺̘͝.̸͇͕̼͔f̵̘̣ir̮̻̹̭st͎̜͓̱̳C̤̜̱͓h̷̭̪ͅi̥͕̥ḽ̥͎̳̮d̗͞)̶̠̠̩̳͎̘
                                    }
                                    ͚͟
                                }
                                    ̷)͉̭͉̕
                            }
                            ̘͠,
                            ̯͉̩̮̣̕ͅbe͙̭̲͓̖ͅf̦͓̼̤̜̻o͉̥͞r̻̝̗̤̭̻͙͘ḙ̭͚̩̟̖͖͡: ̨f̭̰̗͉̩͘u̱͈̖̺̩̲̹n̯c̘t̼̥̖̱̰̳̜͜i̸̙̙̤̪̖̟̥o̥̫̦̭n̟͔̥̬̪̞ͅ(̵)͢ {
                                r̷̙͇e̫̗t̲͈͖͓̜̻̖ṷ̪̥̥̪r̘n̝ ̘͉͞H̘̩͎͙͢e̬(̨͉̳ț͈͡h̲̬͎͓͙̻͠ͅis̖͚̙̞̩̻̹͟, ̺̹a̗̳͔͓͈̭ͅr̖g̢̦̝̰̦̝͙̻um̦͕̳͚̩͕e̶̙̤̪n̟̫͇̩̮͓t͕̪̠̹̝s̼̯͈, ̷͖̮͈͉͍f͘u̩̭̣̳͖̙͡n̲͡ç̭̗t̜̭͇͞i̲̺̠̥͚ͅo̵͉̭n̗̭̦(̢͙͓e͚͘)̬͖̬̳ {
                                    ̴̫̭͔̜͍͍t͔̦̳͚̠̳̱h̶̖i͉̻̙̻̗̙̣s͓̼͇̙͖̹ͅ.̶̪͈̣p̟̱̞̟̖̣̕a҉̝͖r͈̫e̤͚̺͔͍ͅn̪̘̠͔t͈̘Ṇ̯̯̣o͎̩̮͘d̴̖̤̦͚͓̟e̖͔͉͞ & ̪̩͕̲̭ & ̲̳̹̺th͏̪̭̭i͏͙̬̼s̘͎̤̥.̢p̼̗̥͖̤͞a̢͖̬̮̹r̮̣e͖͙̭n̞̱̠t͉̼͖̗͇̱͓N̟͕̤͈̟o̟͔̥d̹̲͔͢e̷̜̙.̳̬̝̜͚i͚͠n͕̲ͅs̜̫̞͓̼͘e̱͎̹r͡t̡͙̘̺̭͉͈B͇e̸̼͈͈̬̫̹f͕͍̩o̘͎͕͈͎ͅre̦͎̯̙͔̼͞(̗̟̹̦e̸̤̤, ̱̺̹̪t̠̘hi̹̘̕s̤̩͎̼͉̮)̟̮͕̯
                                }
                                    ̣̹̦͚)͞
                            },
                            ̧̻̫̫̲̖̣̞a̧͚̥̰f̥̜̹͠te̵͓͚̥r̤: ̝̪̦̥̠f̷̝̖͈̳̥un̞c̪͚̻̫̥̠t̬̤͕̳̠̻i̞o̰̩̫̗̟͓n̺̞̟(̩͕̦)͍̞̬̭͕ͅ {
                                ͈̩̥̭r̗̗͎̞̟̗ͅe͉̺͠tu̼͚̯̲̹r̡̹͔̗͔̝̗͉n̳͚̬̲ ̸͕͙̙̞̤H͕̤̯̞̭e̵͔̖͕̜̞(̦t͍̝͇̬͉͠ͅͅh̳̱̺̙̲̘͞i̢s̫͎̙͕̲, ̣̺͓̟̬̤a͕̬͈͉r̙͇̩̲͖̯̳g̠̱̰̭̦̹u̧͍̦̰̠̣̝m̧̼e̳̭͎̕n̸̹̳̣t̛̪̭̪̯͙͎ͅs, ̀f̸̟̺͍͕͈̤̞u̦̲̜n͎͉͉̮̟̤͙c͘t͡i̺͟o̴͙͕̟͉n̴(͖̯̯̮̖̖͡e̟̖̞̮̕)̟̹͚̙̩̞͝ {
                                    ͏͉̟̰͖ͅt̟̲͎h̹̺̹̕i͔̭̯͙͚̺s̥.͓͙̼̫̮p̴͍̟̪͕̳̜͈ḁ̺͔̀r͎e͏ṇ͍̺͔t͈̰N̬̜̞̯͓ͅơ̳͓͉d҉̖̹̫e̴̥̗̬ && ҉̠͙͓̗̗t̯̩̻̩̳hi̠̳͢s̘̘.̪̪̖͞ͅp͈̲͠a̺̗r̬̜e̮̦͍̮̩̤̫n̘̻̭̯̪̫̬t̼͇̠͇̯͎͟N̻̣̙̫̝̙͉͡o͖̞̼͚͖͎d̺̫̰̻e.̻̺͙̠iń̼͖s̞̻͉̥̱̳̮e̸͚̜͈͇r̦tB̨̠͚̣͕e̪̦͓fo̜̯̤r͞e̛(̜̺e͔, ̢̪̠t̶̠͔̱̺h̤̰͎̝̫i̗̭͕s̼̝̗̕.͓̰͙n̥̲̘͕̦̙e̩͍̜̦x̱̩̼͘t̶̖͓̝̮ͅS̼̝i͏̭͍̭͍̭̖b̛̞̱̞̻̫͙̭l̡̗̗͙͇͈͕ͅi̬̤̻ń͇̩̜̻̙g̛)͍̺̣
                                }
                                    ̯̝̘̠)̻ͅ
                            }
                            ̸̖̳͎͕,
                            ̝̱͎e̹̙̫͍̳͖͝m̱̹̙p̼͍̩̪t̹̬͡y͕: ͙̩̩̹͚f͎̳̼͓u̵͍̯ͅn̛̲̣c̢̪t̛͇͔͍͍̤̰ͅi͓o͕̘n(̨̺̟̤̦͓̜̣)͚̜̥ {
                                ͖f̮͍͙o͖̬̻̟̼̣r͕̥͕͇̺̥̰(̱v͉̫̜a̰͕̺̜r̗ ̛̝̫̯̩̫e͙̬̞̲͝ͅ, ̸̗̦͓̩̖̭t̠ = ̟͓̹̠̼̝͕͢0͖̥̬̩; ͍̺̫̣n҉̯u̟͎̣̥̞̳̮llͅ != ͓(̵͇̥̦e͔̰ = ̸̻̻t̟̪̰h̛͍i̘͉̜ͅs̘͢[̯̗́ṱ]̵͍̹̱̯̳̭̗)̟̙̯̣̹; ̪̦̯̱̕t̤̬ + ̙̜̰ + )̪͙̥͇̥̪̕1͚͎̥̻̭ = ̬̀ == ͍e̗͍̰̺͍.̤́ṉ͚͉̙͔͕̕o̡̘̳̠̩d̙͇̟̖̜̤͈e̯Ty̦̻p̵̜̖̘̘̣e͉̳ & ̛̹͉̪̩ & ̣̖(̰͉͓̥͍̗S̮͓̻͔͙̻.̡̘̘̫c̴͇̯l͎̲͚ea͎̝̺̖͍̖nD̬̥͓̺͚a̝̹t̝̼͇̻̩̥a̢(̸̹̥̲̦͉̞v̫̳̦̘͔̖ͅe̺̘͠(̛̤̠͇e̗̮̤̱͘, ̢̲͓͙̳̟̹̲!̧̬̥͓̣1̬̱̩̙͖̹̻)̱͓́)͙̩́, ̬̯̖̣̲́ͅe̵͖͍̟̝͕.͉̯͍̝̥̠͈t͓̝͙̥̬͎ͅé̲̯̰̼̥̭̱x͝t̞̝̳͝C͎͕̦o̢̰͕͖̟͖nt̶e͔͟n̗t̸̗͚̗͇̫ = ̟̮͕͈ "̲̯̭̗̦" ̧̦)̡͎̙̰̱̗̟;
                                ͇͕̦r̝͕͍̞e̢t̙͡ư̝̭̮̼̘̹rn̙̟̜̩̮͞ͅ ̝͉̯͠t̛͎̠͕h͇͍̞͕i̡͓̗͙s̤̳͓̗͚͕
                            }
                            ҉̺̰,
                            ̟͕͖̪c͎̹͉͖l̤͇͇̼̺̟̳ọ͉̩͍̬͠n͏̤̪͕e̹͉͓̞͘: ͕͙̜͉̥͡fu̫̘̹̜͖̠̻n̼̺͙̹ͅͅc̯̞t͖̖̪̭͔͔͠i̟̹͖̬o̡̯̩ṉ(̮̙̗͍̪̕e̜͎͔̰̤͘, ̫̩͔͇̞̘͎͟t͞)͈̰̟͓̬̩ {
                                ̼̬ṛ̸̣e̠̝͝ṯ̴̟̤̩͖͎̞u̥̮͎͓͇̕r̨̯̪̟̪̻n̝ ͕̳e͔̮̻͉̣͝ = ̩n̤̱ų̯̠̻l͉l͉͙͙̼̟͜!̵̩̥͍̘̦ = ͍̖͎͝e͍̥̬̯̩̼͘ & ̴̮̖ & ̛̖̹ͅe̱̤̯͚̝͔,
                                ̣͔̫t͇̗͇̲̣̙̞ = ̭̣̙͎̦̳̘nu͔̟̝l͉͕̪͓l̗͠ = ̤̮͓͕̭ͅ = ̙̥͔t̠͍̥͝ ? e͓͇̫̻̥̜ : t͉̘͉̜,
                                ̰̫͇t̨̗̬̝͖̝h̶̞i̙̟̻ͅs̱̦̀.̖̭̳͎̭m̀a̞͚̮̼̦p̙̯͉̤̼̦̗(̧̯͇͇̜f̲͜un̝̦͙c͙͓͉̠t̨i̤̖̙̙o̭̥̺̱̲̤n(̜̮̰͖)͖̹̘͖ {
                                    ̯͚̥͓̣̠̩͡r҉͕̞̳̟͚̰e̱̭̩̮̞͜t̲̲ư̟̗̥̯r̼͟ǹ̬̜̦ ̼S̤̦͕̣̠͜.͈̬̫͉̺͎ͅc̛̲ĺóṋ̤̞͎̺̼e̖̺̲̟͚̙͇(̜̗̝̲́t̷̗̥̰̼̯̰h̩͖̻͡i̦͈̳̥̹s̬̱̯, ̸͕e, ̠̬͔̥͓ţ̜͚̟ͅ)̠͔̟̲̗͘
                                }
                                    ̤̞͕̜̤͈̟́)͈͔
                            }
                            ̢̬̬,
                            ͖͉̖h̷̬̗̻̟̯̰̯t̹m̶̘̰͍͉l̘̪: ̗̤͚̤f̡̻̤̩̰̟̹̪ụ͙͚̣̙͓n̴̦̻ct̕i̪͔͎̪̰̬o̞͞n̠͠(̲͉͔̭̘̩͟é̜̣̣̥)̫̭̦̱͢ {
                                ̥͎̯̟̙̱r̹̦ͅe͇ṯ̴͖u̮͔͕̘̟̼ͅr̰͉̠͓̻̥͍͢n ̝͓͈̜$̨(̲̘t̺̞ẖ͙͙̯͕̭ͅi҉̦̝̱̲ś̩̻̞̠̪, ̸̬̩͖̫fu̘̬͉͙̪ṋ͈̣c͚̗̥̮͔͙t̫̬̲̫̲i̯͕͇o̲̺̻̪̪͙̗n̷̮(̼̺̟͈̮̮e)͔̟̣̤ {
                                    ̟̲̗̰v̸̺̩͇̮̗͖͓a͓͍̕ŗ ̱̦̺̟̰͖͉̕t̷͎ͅ = ̯͖̩̮̖̣̲t͚̜͇̻̘͙́h͓̀i̗̗̲̣͔̬s̤̹͖̼͕ͅ[̬͉͍͙̮̪̲̀0̩͚̺]̙̠̞̙̫̤͖ | ̡̗͇̤̲͙̹ | ͈͇̹̯͚̖͜ͅ {
                                        ̰̭
                                    }
                                    ̨̫̮͉̲̩͕,
                                    ̲͝n̗̟̣̫͕͖̫ = ̣̱̮0̷̖͚̬͎ͅ,
                                    ͓̝r̮ = ̠̦̩̠̳̭t͏̤̪̼͈͓̫h̶͎͕̲͍i͍͡ş͓͓̪͕̗.̥̬̘̭̺̺̕le̲̭̺͍͖̤̦n͏͎̩g̱t̙̜̮̮̟̻͇͞h͖̻;
                                    ̻i̘̭̰̖̞̗̦f͔͜(͝v͈̞̮̤͕̱̼͠ọ̝̠̖̟͉͓i͇̯d̳ ̘́0͖̱̳͉̘̫ = ̨̙͔̦̠͕̩̝ = ͏͙ͅ = ̸̲͖͚e̛̳̘̰̲ & ̶̗̭̼̮ & 1̩̪̙͈̠̫̀ = ̥̳̺̀ͅ = ̟̬̞͙͕͍͡ = ̝̫̖͠t̶͉͎ͅ.͚̬n̮ͅo͎͓de͍̦̙Ţ̺̦y͍̗̜͜p͎͚̣̬̪̦̗͞e̘̮)͚̖͉̹r̵̩e̝͉͘t̗u̘͓̞͓̰r̲͚͎̝̬̩̻n̠ ̫̤̳̹͈̟̠̀t̴̳͍̱̦.̻̼i̠͔̯͈͙͖n̪͠n̘̣e̦̜͞rH̗̘̦̝̣̣͘TM̢̱̪̪L̢̹̱͈̥;
                                    ̗͔̳̲̺͜i̝̟͉̰̮ͅͅf̴(͏̠̘͎̞̯̹ "̥s̬t͏̲̝͍r̙͕̤̝̤̻ͅi̷͙͓̟͍̳n̲̜̳̘̩̬͍g̤̯" ̻̀ͅ = ͙̙̫͢ͅ = ͕̦t̩͚̣̖̰̟̫y̕p̘ͅe͚̠o̩̖̥̜͙̩̟f͎̟̤͎͡ ̰̜͞e͢ & ͈̥ & ̢͈̭̠̬̪͉!͡k͉̬̝̩e͚̝̗̙̹̹͉.̠̬̼̩̼ͅt͖̭̯͇̟̯̖e͖̰̫̩̠̦s̙̳t̴̝̗ͅ(͢e̳͍̻̼̤)͎̕ & ̟͉̭ & ̨͖͍̫̪̩̺!͙͜g͢e[̸͚̗(͜d̼̯̠͎e̩̹̗̪͝.̫̙̖̰e͙̘̙͕̠͕̻xͅe̗̻̯̱̘̭c͉͙͞(̜̘͞e̝͕͇)͇̱͇̟̤̯ | ̥̺̣̭̯ | ̭͎͕̣̤̟̮͢["" ̗̫, ̬̞̟͈̮ "̟̭͇͉̘̩" ̶̹͙͓̮]̪̼͇͚̺)̮̙̼͚[̗̻1̣͇̜̝]̝̠͖͔.̪̲͔̹̫̭t̡̗̫̭͍ͅo̧̘̼̫̳̱L̗̭͜o͕͎̹w̷̗e̙̹͝r̮̬̹͖̩̲͚Ca̵̫̘̯̝̳̠̪s̖̮͓̯e̞̱͕̮̠͢(͔͕̙͖̫ͅ)]͔͇̲͎̺̰̳̕)̩̰ͅ {
                                        ̞͈̳̘ȩ̹͉̭̪ = ̳̦̀S.͚̺̳̗͓̖͙́h͏̥̤̼tm͕̘͈͓l̜͚̭͍̲̞͠P̳̀r͓̬̣͙͠e̼͎̣̳͉̹̙f̬̫̯͓͍͙̩i͍͎̟̮̖̤͡l̷̤̠̳t̨͓e̟̬͙̝r͕̳͡(e̹̱͎͞)̷̹;
                                        t̡r̢̜̠͍y {
                                            f͚̥͕̹̖̻͓͜o̵͇̯̲͈r̯̞̀(͖͇͉͔̳̻; ͓̺͓͉͕̺̺͟n͎̞͘ < ̦̙̠̭r̼̘̠; ̺̗n̹̗̼͉̺͢ + ̵͎ + ̶)̨͔1̼͍ = ̠ = ̷ = ͕͝ͅ(̗͉͈̗t̫̼͍̰̱̘̀ = ̭͖̰͖̥́t̟͕h̪̗̠͕̠͓i̡̳͚̜̦̘͍͖s͉[̞̮̗̣͓̦ṉ̠̹̣]̳̬̝̥͚̙ͅ | ̛̭̭̟͙ | ͍͔̲̼̘ {
                                                        ̫̦͓͕
                                                    })̵̣.̀n̩͎͓͈̲̯̼͢o̱̖̪̺̦͕͟d̀eT̟̞͡y̹̭pe̬̣̤̭̘͈̘͜ & ͕̫̖̙̰͕͈͝ & ̡̫͉(͡Ṣ̘͇͇̯.̴̯͍̖ͅc̻̩͠ͅl҉̳̗e͘a̺͟n̟̟̥̜Ḓ̵͇̣̳͇a̜̭̬͉͝ͅta(͓̪͎̻͔͟v̵̼e̮͉̗̙̩͠(̷̦̼̤̭͍͕t̴̥̦, ̯̺̲!̢͕̯̰̞1̢͙)̥̬̞)̛̯͉̱̝, ͢t̝̪͎.͙̱͍̤i͕̻̳̭̻nn͎̝e̙̼r̞ͅH̖̜T͏͎̱̺̬̜̠̱M͚̪̯L̠͖̮̦̦̤͔ = ̯̬̤͖e̷̜̤̭̗̙͙̳)̞͇;
                                            ̰̝̠̰̣͖ͅt̟̹̳͚̞́ = ̨͍̘̪͕̺̮0̹̺̗
                                        }
                                        ̢̬͖c͎̙͇͙̬͍a̵͙̟̥͈̹͔t̵̳͇̟c̛̤̝h̴͙(e̻͍) {
                                            ͔̟
                                        }
                                    }
                                    ̶̮̭͇̟͚t̻͈͈ && ̲̮͟t͔̯̱̟̰͕h̷̺̪i̮̠͎̹͙͕̻s͢.̬̻͞ͅȩ̘͚̘̯m͔̀p̶̬̭t҉̼̘̥̪̼͕̬y͓̪̬͓̘̠̜͟(͓̦͈̪ͅ).̳͎̞̼̥̬̤a̞̹pp̺̳̦̭én̦̪͙̝͓̳̼d̪̙̙͇͇̯̀(͕̫͉̜̘̼͝è͎͕̻)̗̺̮̦̖̼͠
                                }
                                    ̼͚͇, ̢̞n͔̟͍̝u̜̥͇̱̬̟͉l̙̬̦͎͜l̬, ͏̩e̲̦͍͢, ҉a͕̟̻̥̻̗̪r̡̥g̦̲̬̙u̳̣̱̲͠m̗̮̖e҉͈͉̘͔̻n͈̰̱̻̩̗͉͜ṯͅs̭̥͜ͅ.͖̦ḷ̗en͈͔g͉̝̲̰͇͜ț͈̮h̭̪)́
                            }
                            ̳̺̖̠͔̱̲,
                            ̷̱͔r͚͚͔̫e͍pḻá͓̤̱c̜̻̠̮̯̣e͎̹̗̼͎̜̞͝Wi̘̰̺͎̫ͅt̟h̘͍̰͇̼̙͢: ̠̰̩͚͚̞͖f̱͟ṵ̢͉n̼̣̕c̥̤͉̟͟t̯̠͈̻̥i̘̻̳̠̗o̡̟͖̦̤̟ǹ̮̲̦̺(̦͖̖̲̕ͅ)̭̝ {
                                ͍͜v̤͓͓̳a̬̝͍͖̺r̖ ̷̙͍̦̹n̥ = ̫͚͍͚̙͖[̟̲̖̯̬̕]͈͍͕;
                                ̛̹͈̙re̤t͖̳̪̬̯̹͙͠u͕ͅr͙̺n͙̭̫ ̡̲͎̰͕͈H̢̗̬e(̱̯̙t͙͕̬͉̣̗̱͘h̪̝i̴͉͓s̵̞̯̲̦̞, ͇͓̖͎a̡̪̼̳ͅr͚̤̣̜̪͜g͏͕͍͇̙um̮͖̘̣̜e̶̻͇͚̩̜̩n̝̥̯̹͉̲̞t͓͔̰̭s̶̠, ̘͚͈f̝̱͜unc̸̥͕t͖i̕ơ͉̳̘̟̼̫̺ņ̠̣̦̹ͅ(͓̫̲̖̝̜͡ͅe͕̰̦̕)̖̥͝ {
                                    ̲̮͓̮̰͓͎v̖̩̜͓̝̙a̗̖͇̘͜r̡̦͚̼̯͈͔̰ ̖̪̹̜t̯͇̖͚͈ = ̡̯̩̬t͉͉͓h̙̘̙̩̤̺̦i҉̭̟̲̺̥s͔͔͔̜ͅ.̜̰͝ͅp̫̭̻̖̞̕ar̞̬̩̯̤̠̫ẹ͇n̴͇̬̻̪̤̫ṯ̶N̤̝͎͖͜o̗̞̬͓̖d̲̬̟͎è̝͙̝̳͔̦͖;
                                    ̪̳Ş̣̦̣͍.̗̫͜i̖̤̼̤̦̯͈n̮̫ͅA̴̭̫͚̼͉r̯̲͕͈͢ͅr͖͇̀ay̞(̤̪͙͖t̸̩̗̤̻̜h̰͙̮͖̰i͈͓ș͔̩̥̪, n̷͇̲̳̼̗͓)́ < ̞0͍̹̖̼̬ & ̛͚̖͇͔̳̰ & ͞(̵̠͚̠̘͈S͇̖͖̞̯̝͔.͖́c̺̻l̤̪̭̙̘͟e̶a̰͚͟n̳D̰̠̞͎ͅa̖̣̦̦͎͈͡t̲͞a̗͇̗͕(̡͎̫̼v͢e̦̻͓̣̜͇̗(̠̲͙t̮̭͕h̖͕̱͔i̼͈̕s̶)̮͇̞)̦, ̡̮t̛̤͉̼ & ҉̥̟̘͈ & ̷t̜ͅ.͇͇̀r͈͚̪̤͘e̢̜p̬̦͙̪̣̰͠ͅl͎͇a̢c̶͕͖̼͕̜e̫C̛̪͉h͔̯̗̩i͙͙̩̲l̛̫͔͙̬̻d̪(̖̝̞e͇, ͈͎͠ṭ̵̙͚̠h̘̪̹̖i̡̖̠̜̯̟͍͖s̱̠͡)͍͈̥)̜͎͜
                                }
                                    ̪̣̼, ̤͔̝̩̲̟͠n͔̞)̰̻
                            }
                            ̞̺̝̀
                        }
                            ̶̥̜̱͓̳ͅ)̦̺,
                        ͅS̘̦̯̦̥̕.̴̯e҉̺͉̖̖̲̯a̸̫̼c̡͚̟h͖̭̝̼̼̞̥́(̞͕̪͎̱͖̱͢ {
                            ̞̜͍̲̭̗̻ap̨̞͖p̤̗̝̳̺̳͞ͅe̼̦̘̦͜ͅn͏̬̗̘̘̳͙̫d̜͈̩T̢̤͚͓̦o̰̟̙̗̼͔̳: ͎̥̼̠̻̳ "̧̣a͢p͟p̩̮̘̱͜e̝̗͚̝ͅͅn͝d͙̯͖̰͕̞́" ̡,
                            ̢̩̦̻ͅͅͅp͍̫̟r͈̟̘̬e̻̼͙̦p̛͍̼e̪̥͍͔̱̯n̡̲͎̫͇̗̼ͅd̶̺̭̙̳̻T̷̠̺̩̱̘̦̠o̝̝̺: ̖̹̰ "͈̕p͉͔r̪ḙ̴͖̲p̩e҉̩̩̤̙̼͔n̻̣̱d͏̲̭̼̥̪" ̴̫̰͓̫͙̗,
                            ͎͔̤̭̺̯͕iṋ̹͈̬͈s̢̺̻̬̖̟̠̮e̷͓̭̪̘͉ͅr̴͇͎̘̙̝̮̟t͖̩B͍̥͉̺e̛̤͎̱͇͇̱f͇͍̙̜̤̘o̭͘r͇͇̞͓̫͇ͅę̪: ̟̗̟̣͙̗ͅ "͉͔̭̙̰͜b̭̳̖͡e͍̝̮̹͖̥̘f͇̳̳̰̀o͕̱͚r̼̗̰̳̮e͎͍̳͕͠",
                            ̛i͞n̯͙ś̺͉e̝͡r͉̠̖̗̜͍̫ṭ̷̜̼̙͓͙A̧̩̫͔̘̟f̸̤͉ṱ̫͈̲e͔̤̳͈̼r͕̪̳̀: ̧̪͖̫̲ "ḁ̤f̛͈̰t̫͉̙͖͚̞e̶r̫͖",
                            ̥̲̟̣r͚͈e̳̯p̷̼̜̼ḷ͖͉͡a̻͉͞c̩̣̗͟eA̸̲l̲̤l͕̯͟: ̨̤̝̻ "̩ŗ̳̺̦͖͈e̞͙͈̮̜͈͕p̜̀l̼̹a̛̭̻c̢̗̦̤̯̺͕͈e̲̱̦̭͇̖͡W̞̰̫͚͝i̡t͏͓̱̲̟h͏ͅ" ͇̺̳̹͕͜
                        }
                            ͞, f̲̳̻̝̪̦̞u͇̪̦̳̤͔͞ṋ͓͙̫c͚͓͔̮͢t̲̭̱̰i̦̱̼̘̩̲͖o̷̘̪n̹͢ͅ(͎͍̜̫͠e, ̳a̳͕̯)̳̫́ͅͅ {
                            S̷̝̜.̘̙̕f̵̪̼̖̝n͇[̟̬̘͉ͅe͎̤̺]̱͙̘̠̘̼ = ̭̖̯͕̲̞̙f͉u͚͕͓̥͙nc̳̖̦̪̜͘t̗͉̺̙͢i̙͉̯̞̝o̩̪̖͜n̘̲(̨̯͙̮͕̭̰͙e͕͘)̖͙ {
                                ̵͖̻̘͈̩f̱̞͉̖o̪̻̩͠r̛̞͈͔̳͉͙̳(̺̳̮̫̖̹v̧͚̜̼̞a͕̠r̜̱͍̘̼ ̳́t͉̲͍̩, ͏̠̺̦ͅn̠̳̰̯̣̬̳ = ̱͔͉͎[̥̼̞͎̟̘]̢̤̣ͅ, ͕͎̮r̳͎ = ̦S͎̜̼̦͈(͜e̪̘)͉̖̯͖̝̯͎͞, ̥̦̳̪͈͇i͖͍̺ = ́r͏̭̼̙̻͉̹̥.҉͓̩̣̗̠ļḛ̯̲̮n̶͕̥͇̼g̣̪̗͈͓ͅt͏̬̭̦h͙̫ - ̩̰̗1͔͝, ̖̫̯̖̯̀ͅo̪̩̗̬̖ = 0͍̠̙̻͍ͅ; ͏͍͕̞ò̩̼͍͓̥͓ <= ͙͇i̸̤͉̜͇; ͏o҉̦ + ̪̲͚̗ͅ + ̲̲͚ͅ)̘̺̫̤̱̹ṯ̞́ = ͖̪͢o̝͚̭̥̠̝ͅ == ̡̘͖ = ̷̝̪̝̭ͅi͔̕ ? ̶̖͖t͉̪̞̪͈h̦̼͙͍͓̳͘i͎̺͓̪͓͘s̹͉͓̘͔͇͝ : ̗͓͓t̩͙h҉̞̜̣̣͙̳i̪̬͍̳̬s̭͙̰̬̰.̧͉̭͓̟̬clǫ̮̪̗̬̤͉͔n̷̯̗̱͇e͖̯̬̬̖̰ͅ(͓͖̞̙̙̭!̗̥̰̺̜͕ͅ0̯͈͙͓͍̖͙)̻̫̭̱̯͈,
                                ̘̹͈̟̩̦͙S͍͉̲̟(̝̦͕̺͝r̤̜͢[̱͉̮͖o͔͚̦̩͈]̖̯̤̫̻)͢[̷̗͔͈͔̞͕̼a̱̤̣̕]̛͈͚̗(͉͉͇̬̗̖͇t͏͎͚͖͎̥̗)̱̹̗̬̬̲,
                                ͚͈̦̝̣u̟͙̞̯͙̠ͅ.҉̞a͈͍̫̰̦͢p͎̝̟̟͝p̳̗̳̬̱͓̳͝ly̤̫(̷̖̫̠̠ṇ͕͟, ͎̭͈̻̘͜t̴̯̻.͏͔ge̶̟̼͖͖t̥̖͇̭̯̙̬͡(͈̮̱͇̝̟)͙̦̜ͅ)̧;
                                r͍̳̖ͅe͏̩͎t̮ur̰͚̟͎̻n͔͓ ҉͙͓ͅt̥̘̟͖̰̦̻h̬̠̲̥i̡s̛̳͎̩͎.̜̰͔p͝u̫͚̪͠s͘hS͙t͙͈͍̰͈͢a̺̙̱̮c̳͇̫̪̝̭ḳ̴(̳͖n̼̯ͅ)̯̘͉̪̲̮
                            }
                            ̻͡
                        }
                            ̩͈̞̟͖͍̣͡)͍̼̺̼͚͙͢;
                        ͜v̞̤̰̘͝aŗ̹̪ ̘͔̺P̪e̜͓̦̫ = ń̖̜͖͇̰̞̞e̥̖͚̬̳w͚ ͙͚̱̰̳͖R͓̙̠̤̮̠͎e͕̬͟g̗̱ͅE̜̜͖̭̹͎͚x͉̙̗̺p͍̹̙̜̖͚(͟ "̺͙̥̘^̘̞͙(" ͇͈̲͘ + ̡̮͉e͇̝̯̯̯̯͞ͅe̝̪̩̟̯̩͝ + ̲͙͓͍̺̖̳ "͉)̜̰̠͇(̣̰́?͉̫!͟p͏x̲̮͉̱̟͓)̵̯͇̙̥[a͎̠̹͍̼͡-̟z̷̻̦̰͙%]̬+̺̰͔$͓̻̣̣͈̱̀ͅ" ̀, ̺̜͎̯ "͎̣̳̪̫́ͅi̢̠̪̮̝" ̷̮͙̬̯̲̬͖)͉̺̱̰͍̖̤́,
                        ̲̤̙̘R̫e̖̱̖̼̩͠ = ͉̱̦̝͇̲͡f͈͍ͅu̥̫̥n͙̹̙̭̤c҉t̀i̗̗͕̘̘̟o̴̩̫̜̜̜n̠̝̙͜(e̛̩)͎͚̜ͅ {
                            v̵̤̳̭̙̘a͈̣r̠̭ ̲̯t͖̳̭ = ͖̯̳̣̱e̡̲̹.̣̳̬͍̪͠o͇̭̥̥͓̩͞w͍͞n͞e͍̞͍̱r͔̞͓̯̹̻D̖͖̟̘̞̭o̸̠͉̳̠̲͎c̺̗̙̟̺͎͔u͍̠̙̮m̪͘e̢n̯̦̙͎t͈̰̮ͅ.͈͔͎d̙͖͍̦ȩ̰̫͕̜͔͓fa̯̟̟͝ul̶ṱ̢͎͔̫͍̟̩V͙͢ͅi̡ew̟͓̫͙̱̻;
                            ̳͢ṟ̮̱e̜̠tur̺͖͈̭̲̤̲n̵̘ ̵̘̟t͏ & ̪̜̫̯͞ & ̨̻̤̭̜̮̰͉t̢͍̦̼͖ͅ.̘̳̦̕o̫̜p̺͓e͏̟̳̗̝̰̲ͅṋ̮e̷͖̪͈r͙̺͎ | ̙̝̰͉͔ | ͚̮̠̠̞̱(̛̟̰͍̦t҉̼̪̦͖̬̻ͅ = ͇̹C̠͔)̙͖̪̣ͅ,
                            ͕͝t҉̫͙͕͎.͎̦͎̭̙̻́g̼̘̹͎̯̤͈͝e͖̙̙̟̯t̩̼̠C̼̺͎̰ͅo̟̪̼m͙͓̭̗͞ͅp̫̲̼̝̼̟͟u̬̯̳te̖d̗S̬̦̫̙͔ͅṭ̝y̸̳̲̗̟l̙͔̜̘̘̗e̢̥(̶̗͈̳e̫̺͔ͅͅ)̖͝
                        }
                        ̠͍̠̥͇͕͟ͅ,
                        ͎̰M̯͉̹̘ͅe̻̩̖̪̣̳ = ̷͈͎̮͖̩̮fu̬̣̳̟͙̲͞n̛̞c̀t̛̩̠͙̦͓̳ͅi̱͙͙͈͕͍on̺̱̞͍̩(̼̭̦͉e̸̯̖̣͉̣, ̸̟͓̘t҉̠͓͇͖, ̹̲́n̰͉)̘͚̺͕̮̮̖͟ {
                            ̳v̯̣̲a҉̞̹͎̺r̴͎̩̜̹͚̭͍ ̟̭r̝͕̦,
                            ̸̭͕i͕̼̗͚ͅ,
                            ̭̰̠̬o͙̝̖ = ̵͓͙̻̼ {
                                ̘̰̰̯͇̬̬͜
                            }
                            ̨͈̞;
                            ͕̳̺̙͕͞f̸̤̙͍̲̟o͖r(͇́i̻̖̦̣ ҉̩i̞̲̗̞̟n̟̲̬̗͓̳͎ ̹͔̯͍͖̮t͔̘͙̹̦)̮͎͉̯͟ͅo[̙͈̹̤i͍͎̣̻̜̫̱]̷̝͕̳̦̗ = ͙̬̼̬̳̱̙e̺͈̤.̰̯s̨t̯̬̼̪y͠l̲͉̣̦̞͓e͇̺̼͕[̺̖͓̯̰͟i]̶̻̞͈̼,
                            ̷̠̖e͍.͔s͈̭̗ͅt̖̘̟͜ͅy̦̤̮͎͔̟ļ̪̫͇̥̬̫e̻̰̥͍̯̟ͅ[̰̬i͍͖]̭͓̩͚̟͖͡ = ̢̘t͏[̳̝̩̞̞͙͔i]̣̫̟͔̜̥̖͜;
                            ͖͕̲̜̫f͖̞͍͚̣͓o̰̘r̯̱͈̠͚̫(̷į̖͓̝ ͏̻̲i̖͞n͚͖̭͚̲̕ͅ ͙̜͇̼r̠̱̘͉̪̹̕ = ̲̥̰͍͖̻̳n̤͝.̥̻̰͚͎ca͈̘l̺͇͎̥̫̜̥l̢̦͖(̶e̞͙)̰̪, ͕̫͔t̰̦͙̹)̥̤͙̰e.̯͠s̼̳ͅt̞̠̦̹͓y̥̞͟l̲̙e̴̘[̞̜̳̜̦͚̤i̫̜̖͡]̸̼ = ̛̠̙̩̬͓ͅo̘̹̦͓̘[͍̝̥͚̩͜í̭̞͔̤̩]̯͖̖̘̰́;
                            ̻̳̰̮̖̞r͎e͔͜t̠̝͖͇u͙̮̱͔̤͔͝ͅr͎̭̲n͍̫͓̩̣̝ ̫͙̲̰̭̖͍̀r͇̀
                        }
                        ̥̟͖ͅ,
                        ̤͕̤̯͉͕I͠e̷͈̫̝͕ = ̤̪n̢e͎w ̙̦͎͉ͅR̫̥̥̤͚̪e̷̦g͔̬̮̫̤̞E̫̪xp̫̻̫̬̫͟ͅ(̼͈̫n̖e.̘͕̪̼̩̳j̻̳̺̞̜o̦i͎̗͍͍n͍͓͖̮͉͠(͉ "̪̝̬̠̙̫̲|̛̘̖̰͓ͅ" ̮̣)͕͝, ̯ "̮̩̖̺̠ͅͅi͎͎͞" ͠)̶͚͔͎͎;
                        ̭̯̪f̤u̩̺n͏̩̱ç̘t̢̗̼̥͕͙i̭̩̫͖̗̩̪o̴̲̭̰̲̜͇̣ǹ̹ ͓͇̰͚͔̫͈W̟̜͔͖͚͔͕͡e(̲͖̠̼ȩ, ̫̠̮̻̬́ͅt̲͟, ̣̼͇̮n̳͕͇̼̩̼)͉̪̩ͅ {
                            ҉̙̼͚̟͔̹̱v̡̠a̯̫͍̺̤r̰̻̩̞ ͚̥̹̘̯̜r̞̻̮͕̪̲̠̀,
                            ̖̬̣̭̪ị͞,
                            ͚͇͚̪͈̭̥o̘̙,
                            ̥aͅ,
                            ͉̞̟͢s̲̯͇͎͖̭̺͠ = ͈͎̺̥͠e̛̲̖.st̜̖̠̫͚y̺͔̪̣̞l̢͔̟͔̗͙͍̳e̪̝͇͈̤͔̦;
                            ̀r̺̼̱̬̰̻̝̀e̦̥͍ͅt̘̭̥̕ù̩̱ͅr̯͟n͔̙͕͖͝ͅͅ(̴n͜ = ̠n̞̪̞̥͕̭̕ | ͖͖͓͢ | ͍̰̘͕͚R̡͈̥͕͖e̻͙̗̖ͅ(͚͇̩͇e̵̥̻̟̟)͉̰̺̟̖)̱͕͕̠̭̰͜ͅ & ́ & ̷̻̣̰̞(̣͕̳͠ "̸͓͎" ̪̫̭̗͓̙!̗͖̫̘ = ͈ = ͟(̬͇͝a҉͉͈ = ̮̦̗͓͢n.̨̭̳̳̟͔g̘̪̬̣͍̲e̢̳̱͚̙͓͎̹ṱ̛P̜̙̺͍̜r̙̹̜̝̞o̡p͚͓̘ḛ͈̹͞r̛͓̪̩̤t̷̲̥̗͔̰̣ͅy͍͚̠̭̬̬̺V̪̫̗̣a̧̲̟̻l̘̲̯ͅu̫͍̟̗̥̙͈ẹ̸̭͇͇(̘̥͙̬̳͎̬t)̧͕͎͎͙̘̪ | ̣̯̭̣͉̯ | ̯̹̪̭n̢̻̻[̭̼͍̭ͅt́]̤̹͉͎̜͍)̯͍ | ̞̠̗ | ͍̣͚̲̳͕i̫͈͝e͎̹̗̤ͅ(̭̰̭e̻̠͟)̙ | ̷̟̫͚̟̣ | (̱̹̦͈̻̳a҉̩̫̘ = ̙̜S͏.̭̪̜̮͓̬ͅs̛͇̺̝͎͚t̡̯y͇̼̮̥͉͇̤̕l͈̙̘̩̞̤͕e(̩̗̹̕e͚̼ͅ, ̶t͕̜̦̜́)̡̘̠̩͈)̬͍̪̝̞̬, ̺̜!̼̲̮̺̘y͓ͅ.̸͓̭̟p͖̗͇̤̝̱̹i͢x̀e̷̙͓ḷ͈̗̪̺͇̟B̴̫͍̖̺ox̷͙̻̗S̼͈̞̲̻̲ț̻͙̤͉̤̠͡y͉͍̮̺̟͝ͅl͕̹̤̱̘̺͔es̥͚̪͎̜̪(̵̙̳͉̲)̟̠͉ & ͏̮̻ & ̠̜P͎̺̩̘̥e̪͓͚͔͖͖͇.̨̺̖̖̻͚̪̖t̥̺͚̻e͖̱͍͝s̼̪̜͎t(a̜͍̺̬)̡̞̺̼̙͚͙ & ͚̖̰ & ́I͎͍͖͍e͈̰̰͞.̟̫͕̙͚̰͙t͖̜͓̭̱͓̳͠e̵̦͈st̥(̸̮͉̠͎̝t̰̞̫͚)̬̝͉̥ & ̯́ & ̻̬(̡̦̖̬̥r͡ = ̬̲̝s̲̭.̡w̻̦͚̫͈̯͎i͎̱̣̮̲̳̝dth̹̺̱͙̲̳͟ͅ, ̤̘̝̲̘̭̣i̼̘̰͓͜ = ̫̼͙͕̦͞ş̞̦͕̬.̵̳̯m̝̲͓̖̥̜i҉̙͔̯̯̲͓ń͚͈̤̘W͙̭i̶d͙̭t͕h̥, ̦͈̥o͏̜ = ͕̰̭̲̬s̨͔̱͓̦͎̱.̡͙ḿ̖̲a͍̞̘x͏̖̼̬̜͓̞̬W͏̫̟i̤̭̱̯̳̳d͚̙̹̳̝t̮̤͕͎ẖ, s̰̻͙̫͔̤.̹̥͇͈̺͘mi̘͇̦ͅnW̰̼͍̮̲͍͞i͙͕͈͓ḑ͎̤̩̳̳͕̳t̢̳̯͕͙h̺͎͈̘̭́ = ̠̪̝̣͕̜ș̥̹.̸mͅa̢͉͎̫̩x̡̫̠̜̥̘̺W͇̱̩̭͎ͅi̸͓d̻͚t̛ḥ̙͞ = ̺̠̱͚s̹̼.͓͈̖w͇̖̕i̷̬̭d͕̕t̞̙̩͎̭͘ͅh̷ = ̘͙̥̠͙̜a̪̳̹, ̧̞̫͙ͅa = ̲̼̱̗n̫͍͉͎͠ͅ.̰̲̼̺͟w͈̪̺i̢̠̞d̯̦͈̺͎̜̮̕t͖h̴̝̬͙̯̮̫, ͖̪s͖.͖̜͖̖͕̻w͈̲̪̞̪͜i̞̬̤͙̝̱̼d̴̩̺̻̜t҉̩̭̘̞̫ͅh = ̡̳͚͎̩͓̟͉r̸̪̯̲̱̱, ̛̙s̟͎̗̮.҉̟͉͎̹͙m̶͙̩̟iǹ͉̰͖̜̟W͞i̯̙ḍ̹t͇h͈͘ = ̢̰̼̝̼̪i͓͕͎̳͖̞ͅ, ͙̭̳̩̣̗ͅs̤̻͇͖͇̪̯.̠͖m͘ͅa͔͉̖͈̥͎x̴̤͉͓͉̹̩̖W̦̤͖̙̙i̧̪͇̱̺͈̟d͘th͔̥̹͠ = ͚̤̳̺͈͉̱͢o̯ͅ)̳̕)̤,
                            ̘̦͓̮͈̩v̲͉o̧̹̹͚͈̜͕id̟ ̰͢0̯̤͈̘ͅ != ̲ = ͚͓̹͍ͅa̖͓ ? ̞̺a͕̩̘̲̝͎̹ + ̛͖̹̤̻̝ "̲̜͞" ͙̟̳̯͇͘ : ̼͈̰a̷̰̭̩̫̠̭̦
                        }
                        ̹̙̜f̢̝̜͍u̴̥͎n̤c̯̖ṯ̺̯͖i̸ón͍͎̙̳̥ ̤͕F̣̱͡e̝̮̬͖(e, ̟̭̫͙̮̗͇t̼̣̠)̷̖͎ {
                            ̫̭̠̘̟̮r̳̬̰̗͖̺̀ȩ̻͚̻̮̪t͖̬̯̞̗u̪͖̦̮̮̪͜r̳̠͔̭̜ͅn͇̳̟͇͈͟ {
                                ̣̰g͈̬e͈̳̖͔̞͜t̬͚̀: ̘f̟̞̗̩͠ụ̶̬̱̫̟̭n̻̫̺̰̰c̶͕̺͉̲̥t̟̣͖͠i̡̦o̧̤̮̹̪̖n̞̩̭(̸)̵̥̪͎̟̼ {
                                    ̺̝̞̳i̟̩̘̠͇f̷͉͉̰̳͖(͏̹͉ͅ!̙̩͍̜͍͎̼ḙ̜(͙̜̥͎̳̼̦)̛̝)̟̖͎͕͟ͅr҉̼̟̤̗̬̖ͅe͙̻̩t͍̮̠̹u҉͎̺͇̣̦͎r̳̺̝̤̹͡ͅͅn̶(̩̦̀t͕̘̙̭̦̠h̜̼̹͠į̲̦̖s͉̻͡.̥̪͎̤ge̲̲̭̮̠̪t̩͉̻̦ = ̵̣t̙̦͍͖̗)̣̩̰͙͓̼.̮̫̮͓a̧͇̤͇͙p̡͖͖̻̲̦͓p̹̮̯͖̦̘l͎̼͙̜̥͇y̦͎̼̪͘(͔̫̝̹͔͠ͅt̯h̵̝̲̟͎̻͈i҉̥̖s̪͕͓̭̘̪̕, ̻̫͚a̱͎̯r̡͙͈̖̬̳̯g̫͎͕̮u̶̹̺̞m̵̫̱͈̫̜e͓̬͓ͅn͙̱̙̘t̴̪̲s̘̪)̵;
                                    ҉̠d̢͇e̛͙̪l̸̦͓̰̳̦͓e̖t̡͍̪̻͕e̝̭̱̺ ̗t͈͓͖̞̖h̤̱͙̱i͉̲̗s͇͍̘̩̤̤ͅ.͕̳̱͝g̛͖̥e̶͇t̘
                                }
                                ͏̭͇̞̳̙̤̥
                            }
                            ͕͓͟
                        }
                        ̦!͏͍͈͓̼ͅf̷͓̘̮̜u̶̹̗̣͍̩n̬c̻̠̰̱̠̦̯t͚i̖̙o̟n̨̻(̻̖̼̲̗̹͞)̛̰̪͍̞̣ {
                            ̮̙̻̩̯̼ͅf̵̱͕̙̳̝̜u҉̟̜̮̮̹ͅṉ̫̞̙͙́c͏̤̠̹t͙̺̞̬̟̳͞i̳͔͔̹͚͡o̡̩̞̪̳̙̗n̡̩̫͔̰̫ ̘̯̗͘e(̴)̬͚̞̩̘͉͠ͅ {
                                ͕i̸̥͇̯͉̱̤f͔̙̩(̢̫̦͍͔͔͎̘l͍͚̲̥ͅ)̳̥̺͈ {
                                    ́u͍̳͇̰̖̜.̶̞͚͇̺̮s̞̰̰͙̜͉͢t͕̬͇̼y҉̜̪l̖͕e̯̙̜̰̭͔.̪͕̝̥̜̟͟cs̷̬͎̩͈̩s̳͉T̳̱̪̲̖͕ͅe̠̦͙̙̗͖x͈t͍̝͕̩̥̼ = ͈̳͎͈̭͙ "̧̼̻̜̳͖̩p̘͇̮͈̼͈̤o̝̬̞s̛͕̗͇̹įt͟i̡͚̳̱̻̰on̘͕͈̼̤̱:̩̝̣̦͢a̖̜b̤̣̘s̳̣̖̮͇͞o̸̬̯̙̖l̤͕̮̩̫͎ut͏e̢;̣̳l͡e̻͈f҉t̼͔̹̱:̴̯-̹̻͜1̖͎̖̹̰͍ͅ1̻̝1̴͈̣̲͔̳1̠̭1̵̦̭̣p̧͍̟x̘͙̪̝̻ͅ;͓̤͎̦̪̭w̦̮̟͔͕i͎̲̺͚ͅd̨̼t̷h̯͕̤:̪̲͓̯60͔̘p̠̻̮̙͍͓x̢̪͈̯̯̣ͅ;̢m͈͓̝a̢͔̲̭̳͎̩͈r̤̜̗̘͖͢g̙͕ͅi̖n͕͈̺̜̣-͕̙t͕̰̤̪͘o҉͚͉̲̺̟̖p̭͈̥͡:͕̗̙̠̯ͅ1͔͙̹̺p̸̯͕̯͈̻̬̯x̛͚;̫̙̩p͜a͚̬̻̤̼̤d͈͇̥̹̰͉̕ͅd̫̘ḭ̷n̬̠͖̪̻͝g̵͔͕̙:̛̗̰̱ͅ0;̸͈̻̦ḇor̥̣͉̳d̟̦͙e̪̲r̳̙̻:̝̪̫̻̺̭̥͜0" ͚͉̟̬̗,
                                    ͓̻̫̪̰̘l̟͉ͅ.̭̪̬̝s̜͖̟͙t̛̞̱̥ỵ̸̘ĺ̮e͘.̵͓̲͈̗̝̞̼cs̵̬͈̰̪͎s̪̗̘̳̜͇T͟é̱̻̦̜x̵̞̥̼̳̗t͕͔͕͓̀ = ̻̣ "̥̘p̷̺͍̳os͉̩̭̯͡i̙̪̝̩t̻̮͢ị̤̱̻͖̀o̺̙n:͔̳̥̘̫͇̻ŗe̹l̙̩͓a̞̮̘̻̬͇t̶̘̬̟͎̤ͅi̹͚̣̥̫̗v̪̟̠̼̫͔̀ͅe͖;͚̰͍͎͕͖̤d̠i҉͎̠̖̤s͓̦͔͔͚p͉͇̯̬ḷ̫̗̺a̞̠͜ỵ̝͍̜̪̯͢:̥ͅb̳͕̰ͅl͇͍̼̳̤̟̣o̼̹͍c̴̰̳͔k͖͈;͈̫̦̼̹͈͎b͚͕̠̦̖o̻͚̝̰͔ͅx͘-̬͈͓͉̫̪ś̹͖̝̦̠i̬źi̩̯͕̥̘̱ͅn̳͕͞g̶͙̦͖:͙̝͍͚͕̩̦b̼̙o̭̝͘ͅŕ̻̺d̷̗͇͔̹̟e̷͇̜̦͕̯̤r̵̦͈̲̘͖-̷͚̗͎̟̯ͅb̘̞͙̮̫o͔x̠̰͎̭́ͅ;̤͈̰̞ov҉̠̗̗̜e̠͖̟͓ͅr̼̥̟͓̝͎̞f̬̩ḻ̡ó̯͙͙̦̫̞w̫̻̪͕:̟̞̮̖̠̥͘s͏͓͚͙̱̭̙c̨͖̗r҉̫̩̦̹o͉̰̳͎̯͚̮͟l̙͖̝l͓͔̮̤̬̬̰;̲̼͉̲̤̩̩̕m̩̗͖͔͠a̢̙̠̬͉̞r͔̱̹̮͔g̰̼̙͍͔̯i͍̜̜͚͔͉ṉ̛̞͍̦͍ͅ:͏̟̦̝̱̻a͔̟̯͓͈ͅu̼̝͝ͅͅt͎̖̯̠̼o̶͔̩̼̗͎̘;̺͈͉͙̬̤b̛̫̹̰ͅo̪̰͇̭̯͡ṛ̪̀d̮e͔̦͉̦͘r҉͈̮̣͈̜͈:̤̺̤͓1̬p̭͚̙̥̜̦x̜̩͈̺̼̰;̧̺̟p͎̹̰̘̝͜a̴̞̲̳̭̗d̩͎͉̞d͙̱̼̱̕i̥ņ̻̤̭̯̗g:̖̳̙̞̰̪̜1̗̰̪͓̩p̢͇͇̟͚̙x̩̞͢;̴͉̻̯͖w̜͓̤͇̦̼id̹̬̣̬̠͠t̖̫̥͕̯̩̤h̴:̷͉̩̼͙̻6͍͚̬̠͈̣͘0̶̗̭͉͓%̸;͘top̴̩̠̟̥:̫̣1͏%̵̝̭" ̵,
                                    ̰̗̭͍̭r̝̘͎̹̙͘e̡.̗͎̮a͡p̸̥̺p͔̮͉̘̖̘͓͠e͕n̸͈͖͚̝d̰̣̙̼̬͝ͅC̼͎ẖ̞̲͕̱i̞̘͈͔͙̻̺l͎d̝̦̲̜̟̫(̦̪̝ͅu̧̠̮̠̪̦)͕̰͔.͓̝͈͇͞a̬͎̜̹p͞p̙̱̝e̼̟̙̱̦͟n͎͕̙̤͇ḓ͇̲̩͡Ć̞h͖̳͓͕̪̲̕ͅi͕̺̪͔͍̻l̟̥̹͔̯d̴̤̻̻̟(̺̩̝̖͖̭̯l̩̬̞)̡͖̦͓̖̦;
                                    v҉ar̲ ̫͍̘͕e̤͓ = ͓̮̤͍̝̖C͎̯͈͕͙͞ͅ.̱̪͕̣̩g̰e̫̤̻̯̜̹t̶̰̼̮͕͉̼C̝͔̮̟om̭͇͚͟p̜͚̲̰u͍̪̯t҉͖͈̙͙̲e̗̬d̩͍̮̞̩ͅS̵̖̺̭t̛̟͓y̷̪̺l̯̜e̠͓̗̕(̧l)̶̩̭̤̰͔;
                                    ̟͖̖̗̠̹̪n̟̱̞͕ = ̡̟̩̥ "̻̫̭̗͎1͙%̙̤̼̻͍̫" ͍͔ != ̜̠͚̝ͅ = ̡̘e̱.̣̹͓̟̝͈̬t̩͖̺͎̺́ͅͅó̙̦̦͙p̣̲̣̳,
                                    ̲̹̥ͅs͍͔̩̖̹̞͜ = ̶̩̝̠̰͔1̣̣2 = ̗̦̰ = ̬͙ = ̵̣̭̱̤͙͚̻t̖̻͖̮(̬̥͇e҉̻̣͔̫.̧͓̠̗̰̗m̨a̙̗̼͈̭̟͉͞r̷̦̜g̭͎̫i҉̜̝͍̠̳̯ͅn̝̳͇̟͖L̦̱͉e̱͔͈f͇̮̟̝̲̻ț̟͈̥͉̙͖͜)̠̺̺̬͢ͅ,
                                    ͕̕l͚̳͞.̛̮̠s͚͝t͇͖̲y̨l̸̥͇̥e҉͖.́r̮̗͈͝ì͇͇̯̜g̪̘̩̣͓̟h̠̱̙̙̣̱͡t͉̱̥ = ̠̦̺̣͖ͅ "̛6̥̖̟̥͔ͅ0̨̺̜̠̗̳͔͉%̺̜͈̭̕" ̭,
                                    ̸̘̟̟o͙͙͞ͅ = ̭͕͈̗͕̠̀3̩̘̱̤̝͖͚͘6 = ͓̯̺̖̕ = ͚̬̩̝͓͕ = ̶͓̝̭͍̹t̰͖(҉̯̟̙ḛ̴.̜̮͘r͚͜i̹̻̼g͏̜h͍̮̼͖͞ţ̹̦)̹̹̣̝͕,
                                    ̠̰̮̣͇̗̘̀r̶̗ = ̶͎̰͙̘̘̳̮3͡6̵̯͚̙͉ = ͍̯͍̫ = ̺̙͍̰̘ = ̮̤̖t̹͕̣̫͝(̜̜e̸̯̗̫͚̹.̧̲w͏͙̜̩i͢d̗͔̮̞̠͢t͈̗́h̞)͙̼̟̝̮̹̀,
                                    ͇̥̜l͙̬͙̳̹̗̘.͏̩̩̜̖͍s̨t҉̖͙͖y̸͈̳l̗̙̫ͅe͏̙̖̥̯̭̭.̷̘͉̱̩̱̳p̻̲͢o̵̝̗̱̰͖̹̙s̪̣i̤͍͔̼t͓̝̙̺̻̦̞̀i̭͓̘̗o̪̻͓͓n̵̜͕ = ̮̳̬̜̭ "̼͕̩̕ͅa̲̳̺̱̭̲͘bs̯͇ọlư̜̠̤̮̗͍t̶̤̥̘͍ͅe͍̳̳̹̘" ̻̗,
                                    ͓̻̲͉̲͝i͏̼͍̥͔ = ̷1҉͎2̡͇̹͙̠ͅ = ̻̼̻̥̘ͅ = ̼͚̘̪̪̜̤ = ̤̮̥̬̦̗t̛̳̙̗̺(̧̫͍̣̙ḽ͙̮̭̩̬͔.̤o̡̬͇̙̳ff͕̺̗͙͟s̖̞̥͙͙e̜̣͇̥ț̞́W̟̜͉͇i̡d͈̜̙̬̮̝t̨h̨̯̬̰͍͇ / ͙̫̰̀3̙̱̫͉̟)̞̤̮̳̤̬̠,
                                    ͓r̴̼̣̬̣ͅe͚.̥̫͔r̤e҉̫͙̹̞̭̰mo̰͠v͈̯̖e̡͕C̀ͅh͏̱͔̫̮̲i̜̖̙̻͈l͏̙̰̜̬ͅd̳̼͘(̼͓̱̤͙ụ͠)̫̬̥̮͓̤͍͟,
                                    ̳̖͜ͅl͇ = ̘̟̳̫̦͠n̩̬͙̪͖̰͉͡ų̲̙̟ͅl͔̟͎̲̥̯̲͜l̴͕̙̺͉
                                }
                                ̵̘͖͖̯̥̬
                            }
                            ͙f̘̫̲͚̹̝ṷ̶͕̩̦͈̹n̩͖͎ç̝̪̻̹̜̩t̢̠̭͕͓i̙̹̼̩ͅͅo̲̘n͎̥̫̺ ̙͇̟̘̳͕̭t̨̞̗(͈̟̣͙͕͕̥e͔͕̪̬̱̖)̘̻̤͈͖͕̜͘ {
                                ̸̠̥ŗ̤͓͙̫ẹ̟̞͓t͎̳̮̼͚u̻̻̬̙͙̤ͅṟ͓̱̼͟n̻̥̭̘̮ ͇̣͚̹͜M͔̦͖ͅa̝̬̠t͎͎h̪̟͡.̤̳͉̹ro̦͇̳̺̙͘u̫n̵͇̥̟͚̯̼̮d̸̘̤̺̺̟(̪̩̱̭̕p̯̪̘͖̲̪̰a͈̠͈͚͚r͚ṣ̴e̻̺̮̙̼̟͘F̨̠̱̳̳̹̻̫l̛o̝͍̪͍a̧t̯̩(͏̮̖̣e̫̙̖̱͚̥͠))͇͓͔̞
                            }
                            ̨̖ͅv҉̫͖͔̱a͕̹r̸ ̝̟̮͔̞͎ṉ͔͍̮͇,
                            ̪̼͝r̖̰̣͓̟̺̼,
                            ̞̞͔̗̭̲i̴̩̫̲͖̲ͅ,
                            ͚̠͞o̸̙,
                            ͈͔a̠̱͍,
                            ̞̞s͈͙̺,
                            ̹͇ṷ͡ = ̲̼̖͍͍͙ͅE̷͖̤̥.̖͈̺̻̫̗͘c̴̞̲̥̲̼r̸̙̱̝̞e̤̣͕̣̘̖̫a̵̰̘̗ͅt̛̫̲̯̝͙̟e̱͎͇̗̙̲E͏̹l̡̥͔͔̩e̮̗̤̹̮̠m̗͇̝̮̥ȩ͉ṋ̵̟ṭ̹̣̥̠̞(̨̝͖̼͈̖͍ "͖̫̳͖̼di̲̩̭͕̳̠͢v͉̦̪̦̠͟" ̡̭͔̱)͎̯,
                            ͍̻̻̪̦ḷ̮͈͎̠̳̞ = ͚̱̻̤̳͖̩E͈͍̜̲̺͝.̻̮̤c͈͎ŗ̺e̢a̖̯͉̞t̞͘è̘̙͇̟E͓̩̼̞l͍̰͎̪e̵̯m̡̟̭̠̩̮̮ͅḙ̡n̛t(̼̖̦͖ͅͅ "̳̗̖̬̻di̴͖̻̯̮̖͉ͅv̱͈͉͕̤̙̩" ̞);
                            ͚̝l̟̼͚̟̗̦.̜̞̖͠s̼̞t̺̠̞̼y̝̱͈͉͙̭ͅl͕͍͘ͅe̫̬̗̼̼ & ͈ & ̗͉̖̩(̯͇͔̤l̼̝.͎s̫͉͍̪̯t̯̹̮͕ͅy̷̟l̬͙̘̺̬e͍̘̹̺̝.̼̙̬b̩̭̲̗̬̰͍ac̘̱͓̙̩͙͈k̛͈͓̩g̭̬̩̹r̥̲̥̘͝o̠͎̱͓͇ͅṵ̬̣̥͠n̫̝͇͔̮̖̜ḍ̟̱͈̲́ͅC̼̮l̗̭̱͔̞̀i̲p̟ = ̠͈͉̹̱ "͖̝͔̠̞̘c͎̤̝͡o̘͓̻̺͜ņ͎t͈̟̮̟͚e̸̞̦͈̝̦̳̖n͖̬͍͎̣t̠-͓̬͔͎͉̺̥b̟̰͚̯̗͍͡o̮͇͈̭x͇̝͇̜̹̠" ̣́, ͖͙̙͈̱l͎.̯̺cl̺̝o̴͙̫̱̼͚̦͖ne͏͔̳̱N̞̯̹̮̱͚o͖͠dę(̨̹̭͈̺̟̹̝!̮̝̠̤͇̕0̩͘)̣͇̼.̟̠͙̞s̷̫̰͉̫͚̮ṯ͇̮̫y͇͖͎l̟e̫.̷̘̭̞͎͔̣b͏͔̣͉̜͙a͇̲̤͎ç̯̫̹̝͕k̻̼͔͚͈̘͞g̲͙͔r̖͡o̬̞u̺̫̟̰͟n̬̰̬̲̪͘d̸͖C͖̞̤͝l͏̤͈͓i̶͔͉̗p͕͡ = ̱͟ "̱̹" ͟, ̼̭̲̝y͎̞̣͉͜.̩cl͇é͉͖͈a̪̼̖̻͇̗̙̕r̢̦̥̤̭C̹͔̯̫̝̞͢l͉̳̞͎̝͇o̶̯̦n͔̺̖͘ͅḛS͚t̘̜̖y̝̟̘̝l̵̳̻͙̖ḙ̝̝̪̫̪̰ = ̴͕̯̻̗͓͈ "̟͇͡c̘̱̠o͏̦̮̖͕̠̮n͏t̥̭e̦̳̞͓̣͓̝n̫̳̣t͚̱͍͔͈͚͈-̨̗̼̣b̟̝̺̺͖ox̲̱̜̲͕͕" ҉̰̞ = ̶ = ͡ = ͇̗͙̩l͏̖͕͔.̨͎̦̫͓͉s̩̳̗͢t̮͖͉ỵ̬̳͚l̴͉e̯̰̪͎̭͔.̛̱̖̼ͅb̸̮̼̗a͓̹͔̞c̸͍̩k̯̝̤g̼͙̙̰̱̲ŗ͈̗̼̪̺͕̻o̹̣͓͜u̳̟̹̳n̪͓̘̼͞dC̬̫̱l̗̭ͅi̼̼p͇̙̘, ̩͇̻̞̦͝S̳̥.̠̬̺ẹ̵̯x͙̠̳̦̤̯̞͟t̴̮͇̙͓̝͇e̡̤̮̱̻̟̟ņ̥̳̪̳d̸̯͓(̬̩̟͔̰̜͚y̨͎̠̘̫̺̠, ͓̺̪̹͔͔͞ {
                                    ̧̺͖b̦͢o̼͇͈̳̬͓̟x̴̺͉̲S̹̺̠ͅi̵͈z̜̯͍͜in̲̟g͔̣R͇͕̰̮̗e͇͔͇̙͎̭̕l̴͕̰͙i̶̪a̧̬̼̳̞̗̝b̮̝l̡̳͈̦͚͓e͉: f͏͉u̷̖̥n̮̲͙͙ct̗͟i̷̤̲͎̘o̶̖̙̖̞̫̮n͔̪͇̰̰͉̲(̡̲̫͚) {
                                        ̘͉̰r҉̞e̶̬̠̘̘ͅt̝͘u̟͎͔͡ŗ͕̲̲͉n̳͝ ͙̮͉ͅe(̧̯͖̲̯̠̗͓)͠,
                                        ͕̙̘̥̻̱̲͞r͢
                                    }
                                    ̵̣̜̼̹͖̤̫,
                                    ̘̟͈͉̹̠͢p͖͙̙͡i̞̫̗̮̖͓x͞e̵̗̩̼l̵̝B̺͈̗̲͚̬o̴̫x͖̟Ș̷̜̠̟͚̬̘t͚ͅy̭̳͠l̷͕̲̱͈e̞̖s͇͙̝̻̖̣̜: ͙̜̲͕͚̫͚͢f̭͈̻u̝̞̜͎̩̙n̗̤c̦̺̻t͖i͍͔o͔͖n̬͖͈͢ͅ(͇̦̳̼̖͜ͅ)̖̳͢ {
                                        ̖̻͈͇̮r͚̬̙͍̣͎ͅe̛̲t̘̣̮̝͎̻u̩͕r̛͙͙̫͙ͅn̺͇ ͙́e̥̤͕͖̦̳̬(̤̘͉)̮̱̘͕͈,
                                        ͕̤̠̝ͅo͈̝͍͉̱͙̪
                                    }
                                    ͏̥̣͎̺̲͓,
                                    ̧̮̤̮̰̜̳p̸͕i͙̯̗͈̫͔x̼̥̝ͅe͏l̵̪̱̗P҉̯͕̞̘o͚͎̺̪͎s̛̞͇̜͖̥͉it͖͙̹ͅi͈̱̫͓͓͘on͚̻͖͉̬͞ͅͅ: ̝̤̲̳̜̤̙f̯̗̜͎̜̥͈u͉̱͎̜n̙̻̠͇͙̞c̛͍̯̯̬̤͉t̘͓̝̟̦ì͙̹̺͈̘o͍̹͖̝̭̘͞n͈̖̘̪̟͜ͅ(̵̪̭̮͍)҉͙̻̖̝͖̖̖ {
                                        ͔̲̙͖̥r̪͍͔͖͝ͅe͏̱t͙̼͚̝͔u̟r̼̳͔n͠ ̸e(͓̣͉͝)͖,
                                        ͞n̨̮͇
                                    }
                                    ͙͍͕̲̬͞,
                                    ͍͇̞͇͚͔͡ṟe̶̥͎͓̞ḽ̢̬̪͚̱̜i̭͍̜̲̰͍a͎̺̪̰̬̼̼b͕̱̬̦̼͝l̙̟̫̞̹̝͈e̻̼M҉͚͈ͅaṛ͢g̹̣̦̭̻̹̟͞i̡̲n̪L̮̣̘̫̯e̘̟̬f͚̞̭̬̯͞t͞: ̨̜͉f̳̲̟͖̞̞ͅuṇ̶c̞̯̬̬̜̬ti̧̗̤̭̲͚͉̣o͎̺̫n͉͟(̝͔̙̜)̷̪̙̩̰ {
                                        ̘̝r̷̯̣̹̜ȩt̖͠u̧̦̬̼r͕̹̯͙̱̠ͅn̰̘̩ ͍̠̩͘e̡̮̞̮͓̫̘(͖̬̖̙̻ͅ)͇̪͕̪̣̫ͅ,
                                        ̷s̹̪͔͓̻̘͟ͅ
                                    }
                                    ̵,
                                    ̮͔̲͕͕̼̻s̮̼̬c͏̤̤͎̼r̫͓̼̫̤͚̠͡ol̠l̩b͉̣͈̖̞͜o̯̗͞x͎͖̯S̮̙̲̜̫i̳͢z̴͇̼͔e̸͚̹͇: ̶f͝ṵn̷̺͎̺̳̟ͅç̼̼͔͎̤t͔̞̬͓̤̣i̞͔͉o͍͓̣͜n̗͍̩(̴̤̰) {
                                        ̺̲r̩̖̻͖e̱̮͔̝t͉̱̤̠̦ṳ̘͕r̮n͏̞ ̨̣̙͍̦̜e̵͔̖̝̜̻͇(̯̞̪͠)͎̦̖͜ͅ,
                                        ̹i̫͘
                                    }
                                    ͜,
                                    ҉̖͔r̫e̖̞l̖̳̟̙͙ḭ͜a̞͎̳͚͍b̦͙̠̘l̜͕̣̗̀e҉̙͖͈̯̦͕T̬̦̗̠̺̞̜́r̡D̮͎̘̳͖̀i̘̪͙m͘ẹ̖̜̭̗n̴̹̭̗ṣ͙͘i̬o̢͙̲̪n̘̣s: ̷̘̰͓̬̦̥f҉̪̤̻͙̺̲͎u̞̠͍̪͔ṉ͎̖c̰̳͙ti̡o̺͖͖̳͖̻͎n͕̫͖̬̫(̛̲͍̝͓̣͉̺)̢̝͙͙ͅ {
                                        ̟̦̗͓̥̩͍v̪̣̞̠̜̟͠a̰̱͓̗̺ͅͅr̟̼̞̣̩̘̜ ̵͚̻͕͈e̗̯͉͡,
                                        ̜͈̤t̤̀,
                                        ̶n̸̮̖̭̻̪̪,
                                        ̳͖̜̪̟ͅr̲͉̦̭;
                                        ̰͖͈̝̪͡ͅr̯̝é̥̻͎͚̙̬̭t͏̯͇̯̰̹u̪̭̳͍͕͝r̹̞̮̹͖ͅn̖͚̪͙̞̣ ̺̫̙̥̟̗n̦u̲̤̗̬͇͙̯l̫̖̻̟̘͇͔̕l̡̫̦̟̜̞͉ͅ = ̸͖͈̮̥ = ͏̤͓a͙̫̪̱͚͇ && ͍͓̮̞̠ͅ(̻͍͔̠̼͙͜e̟͎͎̲̗ͅ = ̭̘E̡̠̰͈͉.̡̱̳͇̺͚c̤̤r͏̙̰̬̭͇̭e̛͕̟a̞̪̭̹̻ͅt̞͕̳̗̝̝̝e͎̣͔E̛̮͕͚̘̯l̡̥̝̩͔͉͔̝e͏m̴e̮͙͍̹̗͈͢n͎̫͇̜̣͓̹t͍̮̟̬̦̩̼(̛̞̖̠̭̩̫̠ "͓̰͎̖̭t͓a͕̥͙͈̙b̲̫̘̥͖l̬̝̩ͅe͚̥" ̞̦̣̪̗)̱̪̮͔͇̱, ̗t̠̺̮̯̻ = ͎̠͡E҉̪.̳͔̞c̖̘̝̱̝̺r͙͠ea̺͕͇͔̳te̠E̝̯̟̟͓̳l̯̳̘e͏̞ṃ̯̘̟̟e͇̯̠̫ṉ̭̱͕͈̱͟t͍͈̖̙̫͓(̭̺͔͉̱̭ͅ "͚͕̫̜̺͎̥t͓r̷͚̲͓̗" ͍͠)̜̹͙̘͓̥, ̰͞n̺͚͓ = ͔͇͎̣̮̱ͅE̮̱̯͔.̯cre̤̯̯̤̠̙̙͘ḁt͚͇̳͈̖͚e̪̠͔̝̰E̥̯͔͕ḻ͚̣e̱̯m̶ḙ̺n̵̙̞̟t͕̘͙̞̞̥͉(̸̟͍͓ "̙̜̰̟͟d̙̦͔í͎̦̬̹̜̜͇v̧̺̮" ̷̫̻̲̤͔)͚̜̻̬̪̹͡, ͖̙e̶͚̱̥͓̘̙.̛͓̹̼͚̭s̪̼̻̞t͍̫̗y̵̙͍͍̳̠l͚̜̜̩e҉͈̜.̶̬̣͕cs̟s̱̜̬͙̱̲͙T͚͚̼̱͉ͅe̬̮̫̳̥̦̤x̰̩̭͕̲̰t̤̺ = ̰̲̹͉̀ "̡̼̰͎̦̥̖p̶o̢͉͔͍͎̼s͈̝i̶̥̗͚͓t̻̺̲̰̣̤i̵̱̭̗̲̰̞o͚̼͙̻ṇ̲:̡̲̤͈̞̻͉ab̼̹̞̺̞͍s͢o̝͉͘l͇͘ų̣͈̞̝̩̺̗t̮̻e̲̙̲̝̖͠;͓̤ͅl̼̥̱̞ȩ̳̯̮̹̲f҉̣̤̫͙͎t͚͈͓:̨̺̼̙̮-̥͟1͏̭̩̲1̭͈͇̬̳͈̳̀11̠1̗̱͍p͍̥̪̪̼͠x̙̠̳͈̀;̸̳b҉̳̩o̝r̳̮̟̜̹d͜e̡̖̘̲̩r͚͙̗̥͠-̛̰̝̻̦̘c̟͕͞o̱̩͍̦͎̲ll͇͓̘̠͚a̞̭̰̭̬̗ͅp̘̜̜̜̮s̬e:̪͔s̲͕̼̯̬̗͞ͅe̙̼̹͙pa͇̹͔̬͙̯͠r̞̖͕͚͈̗̲̀a͖͔t͕̮̼̳͓̙͔͡e̴" ̨̪, ̫̬͕t҉.̥̟͚̤̰͟ͅś̻̬t͖̠͙̲̝͝ͅy̙l̝̙̱͎̤̬ͅę̞̻̤.̝͚̗̕c̴̗̠̹s̜̭̺̞̝͔s͓͉̹͕̲̜T͏͈̥̮̖̞͖e̯x͚̩͎̣t̯̗͢ = ͍̪̦̰̟̮̼ "̫̺̤̠̞̞͇́bo̳̠͎̦͞r̢͓̬̭̰̳d̻͇̣͉̪͕͡e̵͖͈͇̳ͅͅr̬:1̯̹͕̥͠p̮̼̤̲̬̰̘x̩͖̱̱̙͍̕ ̢̗̤s͍̫͝ol҉͎̯̼i̧d̖̺̭̯̜" ̩̖͕̤̩͈̥, ͍͚͎̥͎̯͘t͉͈͟.̷͓s̢͈̤t̖̖y̫le̘̠͎̙̜̤̼.̱͙̬͈h̳͉͉̝̪e̩̘̘͎̝͖͖i̟̝̣̬͢g̶̫̝̪̹̹h̯͈̕t̻̗̲͉̲ = ̗ "̲̻̠̠̺͇̟1͢p̡̼͕̻͈͉͕̣x̛̳͔̦͈̮̺͈" ͏̩̲, ̻n̳̙.̸̹̬͍̻̯̦sṱ̵yl̶̘e.̬h̤̦̙̗͞e̩̦̙ìg̪͔̺͖̼h̴̞̟̼ͅt̟ = ̪͔̰ͅ "̭̩9҉̣̱̤͈p̜̠̬̟̠̀x͍̪̬̞͇̤͔" ̘̕, ̵̼̻̞n͏̝̺̯̯̰.҉̠̣s̶ţy͝l̘̺̦͙͢e.̖̰̪̙͕͚d̛i͎̣s͉̰͈̟̯̺͓p̤̣̦͉l̀a̦̺̙̬̙͎̻y̙̣ = ̴̲̠͎̘̖ "̩͔̪̺̠̞ḅ̢͚̖͚͇̻lo̤̥͉̯ͅc̬͙͇̼ḱ͍̺" ̴̞, ̣͉̻̼̳͙̹ŗ̙̼ͅe͕͖̖̮̳͔̩.̵̗̼a͏̘p͈̠̣̲͜ͅp͖̬̀e̦n͚̟̥d̙͎̹͖͙͔C̨͎̟͇̮̼h̢͍̰͕̼̦͇̮i̝̥̹̦͎ĺ͚̠͙͉̲d̟̟̖͇(͡e)̢̝̤̹̝.̹͇̪ą̪̲̖p̻̱͇̘p̥ę̫n̮d҉̰̦̥̖C̤̖̥ͅh̞̲̯̭̼̜i̛͈͙̺̦̭l̫̼d̲(҉̗̥̰̤̪t̺̖̠)͎͉͖͎̀.̡̟̜̻̤͍a̘̬̠̲̬̱p̛̱̳p̨̘̼͙̗̬͉͖e̘̳̻͎̰̪n̴̙̣d͇̗̀C̗h̴̙͎͚̬il̵d̮͎͈͘(͉̫̭̪̤͔̟͘n͖͓̕)͓̥̲̗̱͟ͅ, r̼͕̫̭̝ = ͙͢C̼̭̤͖̭̠.̠g̛̘ḙ̣͙̺͚̻̘͝t͖̩̮C̭̱͖o͍̟͕̣̫͍͉m̵̮̜͔ͅp͈̀u͡t̙e͏̠̗̳̖̩͈̱d̤̘̣̰͡Ṣ̘͇͉̞̦̟t̢̰͉̻̟y̨̟͍̦l̸͙̠̗̺e҉̤(͈̘t͚̲̟͞)̴, ҉̹͙̣̰̲a̡̼̼̱ = ̣̘͢p͘a̢r̬̘s̖͕͕e̞̣̻̤̹̲I̼̟͇̹̠͍͘n̞͎̤t̖(҉͇r̴.̷̮hḛ̞͉̩̞̯i͎͓g̺̲̖̤͖h̩͇̰͔ţ, ͎̜̻͍1͏͎0̬̘)̠̼͈̠̻̜̹̕ + ̹͈́p̬͚̤̣͍͖͞a͘r̞̣̟s̙̹͉͎̠ḛ̗͠Iṋ̱͜t͈(̢̺ͅr̵̪̪͓͕̥.͎̯̺̖̭̫̣b̖̟̣͕̙͢o̼͉̩̦r͕̱̺͓̰͙d͍̗͈̮̙̙̼͠e͕̳̩̠͟r͏̩Ṯ̮o͍̫̭̦̮͟p͓̥̰̝̫̫Ẉ̮̳̝̖͙̜͘i͙d̨̖͉̙̺t̛̖̙̺͇͔̣ͅh̪̠̳͙̩, ͕͉͚̗̀1̨̦̦̥0̬)̫̮ + ̨͖͇p̝̪̟a̛̝̪̺̖̫ͅr͏͔̻͕͇̝͙s̨̯̫̖̮̲͚͍e̴͕̗͇̺I͞n̗̰̫̟͘t̛̺(͍̜͕͜r͖͎̭̘̀.͍̟b̫̰̫͙̟̗o͏͓͉͚̺̹̝͎r͉̣͉͢ͅd̳̟̩̩͖ͅͅe̦͖̫r̡͎B̸̠̪̗̥o̟t͏̞̼̘̗͉͈t͎o͜m̰̰̩͔͉͔W̫̩̳͇ͅi̪d͏̞̹̥͔t͏͓͈̹̙h̡̩̬, ͈̳̫̳1̩0̡)̢̩̮̣̹̩̰ == ̘̜ = ҉̤̟̥͚͇ͅt̠.͡o͢f̘͓͉̜̩̮f̡͍͍̤͙s͔̦̩͈̜è͍̖͚t̷͈̭̗͎̺̯͎H̜̱̥̻ͅe̗͡ig̵̮͚̣h̻͔̪̦̱ṭ͡, ̝̤̜̦re̫̳̜͉͍̠̞.̫̟͎̭͉͍ŕ̝̠e͖͓͔͓͖̲͘m͖̼͜o̱̯̘̱̥͜v̷̦̖̬͕̫͈e̠̬͕͓͘C͎͙͖͚̠̣h̞͎͓̬̞̮il̵̫̠͓d͇̙̠̙̼̞͘ͅ(͡e͎͕̱͓̮̳)͓̞̝̘̤̯)̣͚,
                                        ̟̩̖͕̭͎a
                                    }
                                    ̬͙̯̤̳̪̘
                                }
                                    ̶̮͇)̢̮̥̖̞̻̤)͏͇̘̣͖͙̹
                        }
                        ͕̖̠̝͙(͇̮͎̬͇̘)̲̦ͅ;
                        v̺a̫͇r ͏͇B͎̞̞͓͕͙̩̀e͕̼͝ = ̼̮͙̤͘ͅ[̳̣ "̪̺͠W̺͇͓̰̖̠̗e̼̝̝͖̝̦b̴̭̫͉̗͇͕k̮̹̺̫͍̫̣͘í̻͕̣͎̹̮͙t̠͔̤͕͉͙̕" ̜͇, ̹ "̜̞̟̘̣ͅM̮̭̭ò̯̺̜̙̬͓z̸̹" ̹̗͉͍̲, ͏̣͚ "̯̪̥̪̼m̬̰̦s̠̭̞" ̬̮̟̩͝]̙̗͔̱,
                        ̡$͜ę͉͚̻̦ = ̥̝E҉͖̣.̙cr̙̦̜̲e̖͉̮a͖͖̬̕ͅt̪̭̞̝͈͘e҉͇̜̺̪Ȩ̲̖͖̺̼̥ͅl̡̠̼e͚̭͍̤͍ͅm̷e͙ǹ̹̠͔t̠̟̠̣ͅ("͓̻̭̱͔̙d̗̻įv̞̳̼͎͠" ̮̬̙̲̯)̜̺̣̭̻̣.̮̺̙̻̀s͍͖̬ty̯̹ͅl̸̟̮̞͎̬͖e͙̗̟̙̤̲̰,
                        ̬̯̹͙_̜͘e̼ = {
                            ̷͈
                        }
                        ̹̬̙;
                        ̭͞f͓̗̣̥͓̭u͇͉͕̼̯͜ͅn̯̹͓͕͖c̻̞͇̱̰̩t̙i͓̼̤̬͚͝o̶͈̦̙̥͎͕n̻̭̞͇ ҉͙̳̺̳z͍̥͚͉͞e̗͉̘̠̭(e̙̯͖̫)̩̲̹̳̭͉̬͟ {
                            ̮̭͞v̗͎͖̦͓̟̝a͔͉̰̦̪̺r̢̳ͅ ́t̹̻̻ͅ = ̧S̳͖.̫c̼͈̠s̜͙͙̠̘̲s̟̥̱̤̺P̴̼͓̺̖̮̣r͔̪͇͜ͅo̞̖ͅp͍̟̟͇͍͙̜ș͈̜͇̙͓ͅ[̥͖̤̠͍ͅe̳]̢͙̥̘̯̱̞ || ̖̺̻͖͝_̬͟e͍͇̹̜̯[͏̪̩̦e̡͎̜̺]̝̼̪͠;
                            ̬̞̝̼̰̪͕͠r̬̤̙͟ͅè̖̭̺͇̣̺͖t̛̙̲̠͕̤u͕̜̲r̻̠̜̣̫̕n͈̼͉͖͓̺̳ ̠̺͉ͅṯ̥̖͕̗̬ | ̧̗̬ | ͏̼͚(e ̙̞i̛̟͕͇͚͇̭͕n̠̝̟͞ͅ ͈̥͓̮$̱̺̝̼̖̞̥e̡̖͖ ? ̜̳̙̩̹e͏͖͇̬ : ͎̝͢_̢e͍̥̻[̙̗e]͇̱̼̗͓̮͜ = ̗͚̖̯̮f̼unc͙̱͚t̶͎͓̜͙̲̼ḭ̺̯̱o̡͚̥̪͇n(̟͍̭e͉͖̮̪̫)̵̜̱ {
                                    ͔̥̖͙̳̮͖v̭̤̫̥͍͞a̵r ̗̱̣t͇̺̗ = ̟͇e̶̤̮͔[͖̮͇̻͖0͉̟̼̞̯͕̹]̖͚.͚͓̹̲͢t͍̥͙͔̻̮͞o̠̮̫͓͙͇̫U̧̦pp͙̻̜͇̖̗̤͟e̵̮̜̟͕͉r̶͖̗̦C̯̠̖̣̞̣̲a̷͉̝̳ṣ̹̫̰͓e͇͖̙͓͘(̼͉̹)̸͖ + ̵̞̝͎̣̺̖͙ȩ̦͔͉̘̩.̞̪̺͚͚̀s̙̦̲̝̻̪͘ͅḻ̷i͉̞̲̻͞ć̻̩̳͉ȩ͓͉̻(͇̻1̢͍͇)̶͖,
                                    ͏̥̘̺̪̲̣ͅn̴͍̫̰̬̙̩ = ͈B͉ḙ̸̤.̞l̟̦̜e͉n̯͔̖̠̮̺ͅg͎̘͠th͖̭;
                                    ̗̞͎͎̞͓͇w҉͔̰̩̼̟h̲̟͈͙͉͍i͙̭̺͙̜l̸e̱͖̟̪͕͘(̶̰̹̦͙͓̗̺n̳̟͚̳̝͚̖͠ - ̲̗ - ͎̺̼̦͉̩̀)͖͕͎̘̘̠ͅif̫̙͈͔͓̻((͞e̳͞ = ̮͔͈̦B̟͈̠e͖̟̭̝̫[̹̜͞n̼]̮ + ̧̩̪͉͙̗̜͙t̟̳)̤̣̯̖́i̜̜̳̼̳n͞ ̛̱$e͕̖͕̩)̢̯̦̬̻̠r̜̰̘͍e̙͝t̛̬̜͕̟͙̩u̷̞̲̺̣r̷͈͚̦͈͇n̺ ̢̝̙̻e̗̣͠
                                }
                                (e̷̖͇͓)̠̟̩͙̱ | ̧̬̩̗̯ | e̸̠͎͙̜̘)̶͕̻
                        }
                        v͖͙a͔̥r͘ ̪̠̯͢U͎̪͖̯͘e̠͔̙͇͟ = ̗̬̦͖̱͇̞ / ̼̟̟ ^ ͉̜̹͕͉̱(n̥̟͓̪̰͉o͕̦n̺e̗̮͉̖̹̟͙ | t͍ab̨͚l̵̻e̤͙̳̯͈͞(̪̮̱̣̥ ? ̵̫!̶̥̼͉ - ̪͔̲̘͍͈c̥̼͜[e̩̞͇͈̺̖͇ḁ̶̺̻]͙̳̠͝)̬̺̰̠.̛̫̘̘̱̫ + ̢)͎͙͔̬ / ̛̯͇͓̫̘̺,
                        ̮̹̞̹X̖̭e͉̩̻ = ̡̜̰̱̭͈̺̲ / ̛͖̩̱̞ ^ ̣̰̼̠͈ - ͙̭͕͜ -  / ͚̰̤̺͍̘͜,
                        ̢̠̪̺͕̤͍V̡̼̠̣͈͉̟̝e̼̼ = ̨͔̻ͅ {
                            ҉̜̙̼͙p̀o͏͍̝̺͈̘s̼̼̳̀i̧̠͈̠͈̜̣t҉͖̟̘͍̮͎̜i̻̩on͏̖ : ͇ "a̩͔̰̙̠͟b̠̘̻̝s̩̫̱̲̘̟o̡̬̻̗̣̠l̗̘̦u͠t͓̦e̙̫͈" ̴̝̫͓,
                            ͏̞̖̭̩̥̭̙vi̻̤̤̲͙̮͈s͔̥̯͈̟̤͢i̲̟bi̜͍͖̞̤͕̺l̘͇̭̟͈i̞͙t͎̹y̬͘: ̢͍͖͍̳ "̟̪̤͈̥h͉i͏d͏d̝͜e̲͡n̥" ̗̪̼͙̤̭,
                            ͡d̵̝͉is̱͉̲͚ṕ̗̤ḽ̥͔a̘y̢͇̖͖͓̻: ͔ "̳͈̙̞̤ͅb͚̖̰l̳̺̦̞̲̣̗o̢c͓̼̝̺͉̕ḱ͇̼̹̜" ̶͎̲̻̣̣̥
                        }
                        ̣͉̞͓̬̠̕,
                        ̸̫G̘̪e҉͕ = ͚̘͎ {
                            ̪̤͈ͅl̛̗͓̣̱͉ę̝̭͓̘ͅt̼̞̤̮͟t̡͇͙̦͇e̟̦̙̩̞̳ͅŗ̼̬̝̺̻̜S̨̬̼̖̩̬̻p͔͈̲͓͙̤͖̀a̵̙͇̣͇̝c̶̺͙̩̩in̰̞̤g҉͓̹̘: "̯̜0̶̙͓̬̖" ̬͟,
                            ̣͕̀ͅf̮̦̲̫o̵̯̺n҉̜t͞Ẉ͇e̷̪i͔̹͍̖̼̺̼g͓͈̼h͚̲͈t̨̙͚̪͎͇̟͇: ̪̼ "̰͕͓͈͉̮͡4͖̠̮͚͙̻ͅ0̲͕̙̩̦0̨̘̙" ̻͓̺̫͎̦̘
                        }
                        ̨;
                        ̟̟̭̤̣͟f̨͔͙̜̺u̳̗̦͢ń͚̺͎̬̞̩͚c͞ţ͖̙͚̯i̮͚͟ͅo̜n͎̪̹̩̞̬̩ Y̤̱̲̻͉̮͘e̞͘(͚̭̖̲͉̠̣́e̵̫͎̤͕, ̛̼̥͇̻̬t̤̩̫͍̝̝͓, ̗̣̳́n͎͍̹͓͓̦)͖ {
                            ͈̙͖̀v̥̹͇͖̲͖̞̀a͚̱̥r͏̩̪̣̬͚͍̪ ̜̕r͎̩͇̟͢ = ̦̘̯̗͙̟ͅt̫̲̼̭̯͘e̞͕̩̣.͟e̛̥̟̲͕͈x̪̝͚̝͞è̮̥̭̣͓c̷̗(̦̣t͏̪̳̖)͙͓;
                            ͏̣̼͉͖r͜e͎͕̤t͞u̼̮͔͍͜r̵͓̘̜n̺̭̖̙͝ͅ ̙̟̮r̲̘̯͔̺ ? ͙M̻a̸̜͓̩̮t͇̳̻̠̜̥ẖ͖̘͔ͅ.҉̩͎ͅm̡̰̭̟̟̭͓a̱͔̹̘x̮̪(̣̩̹̩̱͡0͓͎͓̫̦͞, ̹̬͉̼̣r̨̺̜[͎̣̗2̠̮̞̜̥̹̭]̴͔̩̜ - ̭̥̲ͅ(̟̯̘͖͎̖n̵̦͓̻ | ̜̼ | ̩̙͈0҉͙̮͇)̟̤͖̪̲̞)̪̭̗ + ̢̖̮̲̠̪͙ͅ(̠͍̮̝ͅͅr̫̳͢[̷̲̹̞͎ͅ3̸͖͈͈͙]͏̱͍̟ | ̙͇̰̥̝̻́ | ̧̪̝̜͚̱ "̼̦̬̦̣̤̩p̜x̡̖̟͇͔̖ͅ" ̫͙͉͍͝ͅ)͎̤͖̹͇ : ҉̣̗͖̟̱̩̯t͏̳
                        }
                        ̛̯̘̹f̰͚̤̦̝̞͚͢u͖̥̼̜͉n̻̻ͅͅc̙̳̲̕t̩̠̠i̠̭̲̲͚o̧̞̻ņ͚͓̦̤ ̛͚Q̥̼͜e̶̥̱͚̜(͜e͕, ̧̯ṯ̵̭̩̪̺̱ͅ, ̥͎̩͈̩̕n, ͓̩̻̕r̘͎͙͚͖͟, ͡i̕, ̩͙͕̦̤̺̹ǫ̣͇̭̼)̪͍͉͈̥͇͓͘ {
                            ̴͔̬͇v̜̦̬̘̳͓ͅa̵͚̮̼̠̹̰̤r̺̙͙̲̳͖ ͕̬̖͟a̲̹̟̫̘͓ͅ = ̢̦̳̦͔̻͍ "̫̗͍ͅw҉͔̘̖̘͈̣̮i͕͚̳̲͈d҉̥͓t̶̲̰̻̩̘h͉" ̴̲̩̰͉̟͙̮ = ̧̣͚ = ̨̟͖͖̳ = ̙t͎̗ ? ̮̫ͅ1 : ̮̗̠̬̬͕0̲̖̜͎,
                            ̙͓͞s̴̻̤̥̮͉̲̟ = ͏0͍,
                            ̛̪̖͎̟̼̝̙ṳ̪͙͖̲́ͅ = ͎͉͘0̨̭̙̦̹͈͕̩;
                            ͍̤̰̼̹͕ì̼̘͙͓̫f̪͝ͅ(͔̱̪́n̛̙̦̩̠̟̤ = ͏̩̦̻ = ̺͓͙̦̱̬͇͟ = (̸̙͖̝͚͎̳r͖̲̬̭̹ ? ̨̟ "̵͖̹̗͙̳̬b͇̱̤͓o͇̳̖̕r̬͓̣̖͞d̹e̙͖̩̣̝r͍͈̫" ̧͓̲̺ : ̫͇̱̳̣̩̝̀ "̪͢c͔̟͖͉o̮̬͕͔̮̹̖n̡̺͕̣̣te̯̺͕͉̹̜̥n̷̲t̴͚̼̳̹̲̘͍" ̷)̝̞̺)͙̙r͏̟̯̟͚e̡̯͔̺̱t̴̺̪̹̪̻͇u͏̥̯̩r͇̘̺ń͕̳̤ ̶͉̯0;
                            f̰̙̣̳̦̰o̗̝ṛ̖̻̻̰̗͠(̣̼; ̛͙a̡ < ͝4̀; ̘̝̟a҉̥̗̪̝ + ̫͈̫̠̰͉̯͘ = ̱̠̮̯͚2)̵̭̝ "̨͓̞̘̰̳̜m͈̬͚͙̟͝a͖̞̤͖̻̣̬r̩̟͠g̺͍̹ͅi̷n̶͚" ̢͙̹͓͔͎̹̲ = ̗͔̦ = ̝͎͚̳ = ̻͎̹̪̮̲̥n̬͕͟ & ̢͔̥͉̖͇̘̹ & ̻̤͔̭̦̼͙(͖̖̹u͇͇ + ̦̭̮̮̦͍͚ = ͏̼͎̰̳͙S͇.͍̳c̸͇̮̦̙̙͇ͅs̢s͕̜̞(͖͚̙̖͕͘e̹͖̟̼, ̻̘͓̣̹n͘ + ̗͖̤n͟e҉͙[̨̺͎̘̻͖͎a̹͍̫̦̘̪͔]̘̞̬̕, ̫̮̲͈̼͖͖́!͠0̭̥̗͕͘, ͏̪͕̫̬i̳͓̫̱)̙͇),
                            ̮͢r̗͠ ? ̖̦̻̻͢ͅ(͉̠͔̳̖̕ͅ "̳̣̳̭c̵̰̜͉͈on͍͖̙͖̹̝̹t̤̘̹̤̭̦e̷̟̤ņ̦t͙̝̻" ̴͍͖ͅ = ͙̬̮̝ = ̪̱̱̯̙̘͉ = ̹n̨̟̫͍ & ̢̻̬͈ & (͓͔u̫̘͜ -= ͔̪̣̮͝S͉͜.̝̤͝c̩̤̦̙͓͉̦s̟̩̻͝s̸̮̺̯(̼̝̻̹ͅe, ̩̺̮͉̦͉ "̪͙̜̠͉̦p͖͙̪͎̫͘a͞d̰̭͚̕din̻g̤͔̤͓͓̝͚͡" ̙̱̻̠̭ + ̤ͅn͡é͙̼̯͔̼̫͖[̰̙̘̰͉̘a̱͔̝̻̘̝]̰͕̙͕̙̞͠, ̧̱̺͖!̸̫̼͓0͏, ͝i͎͕̯̗̤͚̙͠)̟́)͍, ̜͍̞̫̱̳͕ "͕̙̘̩ma̷̲̝rg̶͈̠į͓̹n" ̘̠̮!͚͕ = ̭̰̝̰ = ͉̭̫͜n̠̳ & ͍̯̳̗͜ & ҉̪̭(̶̖̗̠̜u - ̦͓̙̦ = ̱̞͇̜̟ͅS̶.͚͕͓͚͙͇͚͡c͈͚͝s̨͔͖͇͖̝̼̮s̨̟̗̠(e̶͓̘͍͉̞, ̠͍͠ "̸̹̤̮̹b̭̦o͇̱̦̯̤̕r͚d̙̖͎̬̱e͚̩̰̱̮͕r̰͙͍" ̸̲̰̮̫̩̮̫ + ̢n͈̮è͖̯̯[a͏̦͖͔͓͇̥͓]̸̱̜͉͚̺ + ̣̫̲ "̗͈͎̫ͅW̴i̪̺̫̭̝̖d̟t̪̹̫͞h̵̩͇" ̘, ̴̮̺̗!̺͙͔̙͔̘0͕̤, ͓̩̱̺͠i̜͘)̧̘̥͕̠̠͓)̟͘)̠̜̦̹͔̭́ : ̲̜(̵̬̲̩ͅu͘ + ̦̱ = ̼͙̼̬̼͝S̠̤̠͍̣̥͝.͎͕͇c̲̫s̹̫s̮͖̠̮̖̱̱(̫̱͖͎ḙ̯ͅ, ̡ "̢̣p̀a̙d̯͙͖͠d̕i̜͓͍͞ͅn̵͕̤̗̦̼̗g̢̤̱" ̣̱̪̘̘̤̼ + ̹n̵̦̼̙͙̠͈͍e͓͈͟[͉a҉͓̻]̟͉, ̵̱̦͓!̸̼0̼͍̀, ̦͍̠͢i̝̹̠̹͞ͅ)̢̥̞̟̜͍̣̘, ̺̟̳̤ "̗̦̳̪p̥̺͕͝a͎͎̝̥̩d̫̖̭d̳͉̞̠ị̱͙̲̤͡n̷̘̥g̥̙̝͍" ̯̥̭͢!҉ = ̛̜͚̗͎̺͕ͅ = ͍̹̟̯̟̦ņ̣ ? ̥̗̗̯̕u̧͔̦ͅ += ͉̠͓S̩̟.̺̹̝̝̰c̢̟̤s̢̬̦̺͕̤s̟͉̣̘̘̹(҉̭͔̞͔ͅe̢͈, ̧̙̳̞ "͙̼͞b̼̥̰̺̕o͢r̟̤̙̺͎ͅd̞̩e̝͠r̞͙̼̹͔͉͍" ͍͇̪̙̱͡ + ̡̭̥̥n̘͕̝ͅé̹̱[͙͚a̱] + ̖̪ "̲͖W͉͍i̘̜̭͔̣d͚͔̺t̸͇h͖͈̩̥̩" ̘̤͓̯̣, ̼̣͕͎̬̩!͍̙̟̺͉0̼̜̥͈, ͟i̠͔̝̦̰͟)̞͈̩̕ : ̷̻̹̜͍̦ͅs͢ + ͍͙̲͔̬͖ = ̩͖̝̹S͚̮͚̮͕͟.͕̫̭̯͖̦͝c̳͙̕s̛͎̘̳s͎̩͔̰͇͓̕(͎̱͖̖̰̰e͟, ̲͟ "͚͚b͉̞̯͟o҉̫̲͈̞̻ͅṛ̻͙͙͎͜d̸̮̘̪̗e̻̹̫͉r҉̘" ̲͓̦̙ + ̖͇̰n̝͕̲̪̠͇e̹̗͡[̲̳̳̤͚͈͉a̡̤̹̰͈̮̯̹]̣͉͉͓̹̘̬̕ + ̙̞͕͠ͅ "W̬̦̙͚̹i͎̣̤̻̜̳d̶t̩͕̗͎͇̟͢h̜͈̬͈̱̮ͅ" ͢, ̘̬͖͉͝!͚̠͙͉̲͈͓͟0̦͔̭̰, ̝̞͖̭͖̲͉͠i̳̳̥͇̺̺̖)͍);
                            ̥̝̩r͇̗̕ḙ̳͝t͎̣̲̟u̘͡r̻̱̰͠n!̀r̴̘̻̥̹̤͇̭ & ̲͍̖͓̥ & ̟̜̭̫̟̰͚0̪ < ̟̳͖͚̟͇̲ = ̰̯̟̙o͇̹̰̳̱̠͔ & ͔̩̪͇ & ̬̲̲̹͡(͉̩̰͍̙ù̗͉͎̳͎ + ͖͉̟ = ̡͖̭̲̮M͖̭̱͉̖͜ą̳t͚̯h̖.̘̝̯̙̙̥m҉͚a̦̲͚͇x̯̬̤(̩͇̟̞͕͟0͕̪̝̙͙̫͜, ̛̜͎̝̬̜̝M̹̫̦̻̜̖a̙͉t͎̠̬̥̣ͅh̸̯̭͓͚̯̻͇.̵͎̭͕̪̥̬͖c̥̟̲̮̤e̵̠̻̮i҉̲̟͖l̙̫͚̦̘(̴̬̖͓̟͓̠e̲͖͎̜[͓̮͕̣̭̭̫͝ "of̖͈̗̫͉͔̪͡f̘s͕̯̰͎̺͘e̶̫̱̳̜ͅt̤͔̟̳͎̟̫" ̠͢ + ̨̫̩̬͓̜̹t̛̹̞̭͈[̺̦̯̥̦̮͠0]҉̲͙.̫͍̫͡t̖o̹͚̞͡U̙̯͙̤̜̠p̪̣͉̟̣͎ͅp҉͉͉͎̰ȩ̖͖r̕C͓̠a̴̬̖̤̺s̗̫̟̜͎͚̀e͈͉(͝)̦͈͚̯̼ + ̵̘̻̪̳̜͚t̜̗.͚̀s̥̪͍͙͈͟l̡̞i̫̖̗̦͔̖͖͡c̭̠͈͝e̡̩̳̱̱̰̪(͔̯͎̪̬͞1͕͉͞)̪]̫̹ - ̛̫̬̯̹͓o͝ - u̪̖̥̙͇͚̘ - ̢͚͍̻s̸͖ - ͉̥̠.̴̖̝̯͍͔̩̟5̡͓̝̠)̼͇̜͚́)̺̙̪̬ | ͈͇̣̳͇͇ | ̹̩͠0̸̝͎̙̹̖̬),
                            ̦u̜̘̫̪̫̩̻͡
                        }
                        ̩͔͖͜f̨͙͕̺͕͕̹̯u̻͢n̠̲̘͕͕͞ct͉i͎͙͕o̵̭̣͇̪̖ņ̳͎̱̞ͅ ͉̦̜̝̫̯̦J̝̗̫e(̻̠̭e̖, ̵̯t̸͔̭͖, ̢̼̟̣̺ͅṇ͕)̦̙̮͇͉ {
                            ̟͉̬ͅv͚̟̗̖̱̞͙a̡r̭̪̖̹͓͍̙͝ ̞̘͎͈͈̠̖r͓̭̟̖͓͔͚ = ͓͙͍̯̩R͎͉̤̼̹͙͈e̴̺͉͖̠(̞͓̹̹̣e̲̠̙̭)̘̰͓̩͕́,
                            ҉i̥ = ̢(̵͉!͈̘̤͈ỵ̶̳̲͚.b̷̠̦͕̟̠o͍̞̮̥̮͇x̼͓̦S̢̭̭̩i̡͕̻͙̭̥̳̱z̯͎͡i̫͜n̬g̹̫̝̱̝R̟̹̰̫͍͚e̮̞l͓ͅì̥͙͈͔̣̣a̻b̡l̘e͉̫(͢)̠̟͚ | ͜ | ̹̝̥̻͢n)̵̫̜̮̲͉̯̖ & ҉̪̺̘͍̺̙ͅ & ̗̤̥̜̼̥̫ "b͖̰̠̱͍̕ͅó̙͔͕͙͈rd̘̘͜er͉̤̠-̱͟b͝o̸͚͈͎̮x̡͉̗̬̲̻" ̨̘͕ = ̗̫͙ = ̪̻͉̤͕̱ = ̵͖̗͓̖͖̳̟S̵.̗̙͡c̫̫͖̗̠ş͕̘̫s͞(̻e̵, ̛̬̫͚̫ "̨̙b͏̳o҉̭̠̯x̸̦͙͓̟ͅͅS̵̻̪͖i͙̰̘͟z̦̣̱̩̤i̻͔̮n͇͖̯ǵ̤̺͈̘" ͕̩͈̪̲̯͔, ͕!͈̗ͅ1̝̩̦̞͞, ̣r̪̩̥̪̻ͅ)̢̪,
                            ̧o̭̮̟̝̝͙ = ̖͇͔̯i̥̺̤̯͖̤͞,
                            ͎̹̝a̟͎ = ̜̪͔͕W̢͙̼e͎̱̲̯̪͢(̛e̝̟̥͕̳̯͜, ̜͇̰͎͍ṭ̳, ͙̟̩̫̞͉r̰̻)͉͜,
                            ͏s҉͇͍̪͈͕̰ = ͖̠̩̺̹ "̺̫̀o̧͕f͉̞͢f͎̻̳̗̥̕s͠e͓̠̫͖̻t̸̮̙̦" ҉̱̼͍̼̯̬͉ + ̼̯͙͕t[͔̖̤̳̫0̤̦̹͓̞̬]̛̤̺̙̙.̠t̨̞̲͈̫͇o͏͙U͠pp̻̙̮e̸͈͖̱r̵̞͎̰̩͎͖̼C̷̼̖̤̥ͅa̡̳̫̣̬͓̣se̥̲̹͝(̨̼)̰̬̱̹̟̥̤͡ + ̰̞̫̱̣͔̼t̵̘̟̟͎̼̰.̹̱̭͙͚͖sl̶͉i̞̖̙c̮͉̳͚͔̭͡e(̗͟1̢̜͉̘̻̗)̖̱̱̲̣̞;
                            ̟̱͘i҉̙͖̖f̤͉͇(̮͓͓̼̪͈̳͝P̣͉͕̖͇̜e͖̙̮͔̞̗.̹̗͚̝͎ț͇͍̜͝e̦̪s͉̗̠͠t̪(҉̯͔̠͙̪a͠)̲̟̟͕) {
                                i̝͚͈̬͔̝̦f̟̣(͚̥̝̲͓!̸̮̮̘̠ņ̹̱̹̯̼͔)҉̻̰̘̹̱̥r̘̩̖͈͇̠̖e̪t͈̘̹͡u̢r̛n͖̫̼͍͓͎̥͢ ̲̩̫͓̥̣͟a̶̺;
                                ̩̼à̳ = ̛̰͉͉̮̟̪͓ "au̠͔̭̝̠t̠̭̞̤ó͕͙̹͚͔" ̮̘͈̺̱̤ͅ
                            }
                            ̴̻̲͍̱̰͉̼r̻̹͖̰e̵͚͓͇̤͈̯̱t̮͍̳̼̰͕u̸r̷̳͓̪̹̞n̞͔̜̩(̘͍͙̺͍̀!̛͈̩̳̺̭y̝̼͉̙̙͘.̬̼̩̪ͅb͚͎̤̙o̖̗ͅx̥͡S̥̼̥̖̠͖͓i͖̰̺̫̠̞͟z҉̪̳̲̬̪i̟͓͖n̶̺̯̟͎̦̗g̵͉̯̥̜͇̣̞R̞ͅe͉̗͇̬l͚̦̀ͅia͈̟͎͔̮̳͟b̥̥̀ļ͓͍̗̥é̦̣̙͖(̟)̵̖͈̣̜̖͍ͅ & ͉̘̲͙̲ & ̘̲͎́i̪̰͓ | ̮̜̦͠ | ̜̜͔̱̺!̲̳̺y͔͈.̨̫͎̲r̲͓̝͉el̖̖͈̠͚̭i̱a͔̝̰̪b̙̀l̬̩̺̭͉e̻̥̱̩ͅT̘̞̙͉ͅͅr͖̠͍͉̭D͏̙͙̥̗͈i̜̟̼̘̱m̼̝̳͝e͕̣̝͍n͓̫̻ş̤̺͇̯i̧͔̥̫̭̠̗̲o̖̣̺̪̳̩͘n̹͇̯̗͙͉̯͝s̜̪̫̩̜͔͍(̱̣̱̺)̧̞̹ && ̴͙̦̝̜̘͍A(͏̦̼̟̙e̘̳͡ͅ, ̧ "͇̼t̨͍̝̘̗̟ͅr̦̯̰̣̻" ̰́)͍ | ̧̥̜͖̯ | ̙̮̜͔̞́ͅ "̯̼̮̙͎́a̫͖͎̻̱͘u̦͓̫̰̰̬t̙̬͎̥̝̻o̥̙͖̼" ̹̰͇̮ = ̼̥̱ == ̫a̸̤͍̮ | ̹͙̹͎̣̱ | ̼͍͍͍̤̳͙!̶͈̺̥p̮̘̝ͅar̷̖̬͈͍͈͚̘s͟e̩͚F͉l̲̳̖̝͓̗o̳̻͉̥ͅa͍̣̜̖̙͈̲t̟̗̺̭̦̞̼(̹̱̦̝̮͝a҉͓̯͇͍̭͚)͏͇̲͇̬̩̬ & ̜̱̱͇̬ & ̶͚̳ "̵͇͙̩̙i̫͓n̙̤͔̯̭̣͢ḽ̯̜͓̰i̳͉̼̱ńẹ̛" ̘͇̱̩ = ̼̮͙̳̱̯ = ̱̗͠ = ͇͔̥̳̣̠̼S͓̣̟͓͕.̞̩͖̯c͉̭̣͕͎͡ͅͅs͕̖͚̰̦͎̮s̵̯͈̟̠͖(̫͓̩͚̳͖̰͟ḙ̶̳̮͓, ̨͕͕̙̯̮ "͠d̤i̖͚̟̩s̨̜͈͔͔̟̩p̘̲͍̖̖͓̳̀la̛͕̯̹͕̲̼y" ̳̗̼̖̳̪͍, ̞͇̥!̹̰͕͎̘̘͙1̩, ͖̗͇r̯͉̯̠̬͜)̱́)͔̦͈̙͎̞͝ & ҉̼̬ & ̤͙̠̻̖e͔̪̟̼̮͖.g̀e͍̬͔͍͓̱͠ṱ̖͎͔̣̙C͔͎l̻̬̩͎͖̭͡i̸̙̙ͅe̴̦͍͓̣n̪̹̘̯̝͙̘ṯ̜̞͈̺̩͉R̛̙̰̱̗̘̙ͅe̵̝c̮̻͔̗͎̣͠ͅt͍̭͍͔͔̯ͅs̨͕̤̺͚̭͇̖(̶̝̗͔̣̝̞)͈͖̘͜.̴͔̩̖̙̳̻̺l̫͙͚̺̩͜e͍͖̭̦͕͙̰n͍͞g̨͈͔̥̝̭̫͖t͜h͉̱͜ & ͍͔ & ͇̟̪͔̲̞ͅ(̳̫͉̘̟̙͞i͓̺ = ̲̮͉̤̙͍͠ "̰͉̥b͇͖ͅͅͅo̢̙̱̹̮͕͈rd͠er̟̱̥͓̳͕͜ͅ-͚͔̣̘͜b͓͚̞̭͔̮o̝͇x̳̝̗̤͡" ̡͈̤̩̯̻͍̳ = ͙̱͘ = ̥͔̱̞̯ = ̞̹͙̮͡S.̮̦͖̹͡c̙̕s͙͠s(̗̻̝ḛ̶͕͕̻̞̲ͅ, ̶͓̙̬͈͇̦ "̮̮̮̹̣̰͝b̠͢o̗̹̙x͕͎̠͚S͏̱̰͙͖̦i̗̦̦̼͍̜͍z̸̯͉̦i͚̙n̖̠͎g̤̭͉̱̯̳̀" ̘̲͓̞͈̻, ̦̪̞̪̳̪͘!̪̬̲̰1, ͉r̦̰̦̭̤͇)̠͍͉̹, ̳͟(̛o̡͎̯̬̫̺ = ̖̠s͓͕̣̳̯̬͈ ̴̗͕i͚̰͙̱͈n̸̗̻͎͔̭͙̰ ̳̥̰e̺̫̝̼)͇̘ & ̕ & ̧͖(͇a̺̲̘̳̳̮̜ = ͙̹e̦͖[͟s̡̲]̮͚̹͎)̩̭̙͇̮̗ͅ)̕,
                            ̩̰̩(̹̥͡a̩̲̫̣̩̦̘ = ̴͉̝̠p̣̤͡ͅa͇͢r̹͔̲̰̪ͅs͓̭̻͡é̮̩̠̹F̟̲̤l͈̫̼͕̥͙oa̲͘t҉̯̞̲(̵̮á̰̪̜)̯̣͔͖̟ | ͍̹͓ | ̯̯̹̪0͓̫͈̙͚)̸̻̞ + ̮̪Q̧̭̼͓͔e̖̲̗̝͚(̵̻̺̺e̼̦̘, ̖̞̜̬̻t҉̻͍̲̻͓̭, ̥͇ͅn̟̘̮ | ͏̘̮̺͎̙ | ̮͓̤͝(̻͉̙̣͍͈͉i ? "̡̥̘̺̙̙̣b͍̟o͕̭̣͙̥̮r͕̮̙d͏̹e̦̪̺̯̳̬r̯̬̯" ̴̺͍͚͈̭̮̝ : ̵͇̫̰ "̭̞̜͓̮c̸̩̘͇͇̝͕ͅon̟t̖̻̬e̸͖̩̹n̜̘̖̞̰͕t̥͔͓͍̝̘͙͢" ̷ͅ)͉̟͕̟̦̬͜, ̮̖̫͢o̟̯̫̜̳̜, ̙̮̭r̗, ͈̘͉͚̕a̲̗)̘͚̱͉̻ + ͖̗̫̯͠ "̼̱̗̗̳̟p̷͇͔̙̥ͅx̥̞͍͚̺̜̩͟" ̹̩̞̯͡
                        }
                        ̢f̟̳̤̼͕ͅu̜͓ͅņc͓̹̺t͎͍̗͙͖̥̮i̗͚o̵̝̜͕̙n̟̺͙̣͕ ̫͘K̛̗͎͉̝̠̱e͝(̵e̴̳̗̥̖͖̺, ̡̰t̶̗͕̻͍͚̝, ̝ͅn̠̬, ̰͍͢r҉̼̥̱͓̝, ̶̹̤i̳͢)́ {
                            r̯̞̬̜̗̺͍͠ḙ̜͕̪̭͍͔́t̨̹̻͙͔̣u͔r҉͉͖̩̰̣n̨̟͙̙̳͉ ̛̙̦̥͖̜͍n͎̘̬̘͍e҉̼̲w̟ͅ ̬̩̥̗̪͍̗K̛̜̖̦̠͎͇̲e̫̼͚̣ͅ.̩p̣̣̪̳̞̺r̢̳̺̪o̤͕̲̹̭̟̥t̪̣̼̗̜̰ͅo̡͈͖̦t̯͝y̭p̵̰e.̜̹̦̞͙͉̲͝i͕̬̻̤͉͇̝ni̟͔͕̬̗͈̣t͓̯̬͖̬͓̱́(̱̯͘e͞, ͎̮͚̥̠͔t̠̣͔̕, ̝̞̮̱͕̺n̜͎̤̤͟, ̬̻͓̤̩r̳̹, ̷̫i)̙̰̤̤̖
                        }
                        S̸͖͖̘̹.͕e̶̝͇͕̰̠̖x̞͈̣̼͉͢t̫̕e̡̹̮͎͙͉̲n̵̖̝͔͍͈̰͇d͔̤(̶̻͇̮͍̤̜̼ {
                            ̱̦͉̫̺̱c̟̲̥̤s͔̺͞s̲̪̗͇̦͖ͅHo̟͈͞o̜͈̰̗͇k͙̤͕͇̝͚ͅs͈̗̠̹͞: ҉̤̟ {
                                ͇̭̲̘̤͝o̼̪p̜̺͢ac̜̤̱it̢̬y: ̙̣̞̹̳ͅͅ {
                                    ̨͈g̗̞̘̮̪e͔t̤̘̥̯: ͕͢f̛͖̟̬u͉͕̩̠n҉c̶͚̩̤̫t̻͉͚̹̹͖͠io̸n̙̪̖̩͖̝͘(̪̼̺͠e̢̺̜̠͇̞, ̬͍̲͕͎̘͈ṭ͙̖͖̹͟)̀ {
                                        ̟͙ͅi͔̮̳̝͍̭f̰̞͇͚(̨͚̫̘͈̠̘̩t̸)͍̻̜̜̙̹ {
                                            ̺̰v̧̙̘̘͍a̪r̴ͅ ̵̝̜̺͍n̮͚̜͚͔̼͎ = ͈̼̪͍W̘e̴͍̤͓̠̜(̱͝e̯̞͘, ̲ "̯̖̰o͖p̜̱ac̺̫͖̳͉̻̪i̵̞͈͕̞̳t̨̠̭y̢̗̠̠̯̥̭̫" ̶)̟͇;
                                            ̲͕̦͈̗̜͠r̺͙̫̪̯e̤̪̹̩͈̥͕͡t̞̤͖̻̘ú̞̭̩͍r̶n̲͉̭̼̘̣ "̱͍̕" ͔̟̜̘͡ = ̥̦̲ = ̜̦̕ = ͖͚̲̘͍n̛͓̼ ? ̹̺̦̩̪ͅ "̹̗͇͉1̳̻͙͕͉̀" ̷̼̝̹̳͙̖̲ : ͙̱̪̲͖͘n̢̮͇̤̭
                                        }
                                        ͚͢
                                    }
                                    ̛̠̺̹̮̬͎
                                }
                                ͈̰̻̟̖ͅ
                            }
                            ͉̞̮͎,
                            ̻̦͔̻c̮͇̫s̭sŃ̖͕͖u͍̜͎̭̩̰̰͜ḿ̟̦̝̜̖̰b͙̼̪̩͉͟e̶͙̖r̞͍͚͓͎̥͡: ̬̮̥̟̗ {
                                ̫̭͟a̯̬͖͟ͅni͕̖̳̥̩͙m͕̰̰̩̲͙̟͝a͇ͅti͏̰̳̖o̴̘̦̺̼͙n͍̯͖͔I̺̖͚͙͉ͅt̮͓͚̳̜̖͖e҉̲͈̦̗̖r̘̳̙a̠͢t͎͖̮̣͉̯i̜̪o̭̗͎̖̹̪̪ǹ̼̳̫͖̤C̞͈̮̟͚ͅou̮̭̣ṇ̱͈̳͉͇̞t̛̥̘͉̜: ̫̥̱̗̭̱͖!҉͇̭0̨̞̣̗̭̮,
                                ̻co̥̰͙̘̘l̶̝̬̺̟̝̥ͅu̡̬m̥̗̥̖n̷͚̥̘̘̹͔̻C̡̰̣̣͓̼o̶u̬̝̹̜̤n͇̝͚͎t̴̫̝͇͉: ͇̠̟͇̲!̰̲͝0͈̥͎͓̪̼͠,
                                ͎͠f̨̬̟͍ͅi̤͇l̻͍͇l̨̰͎̦͇O̯̠͚̺͉p͉͎̘̹͟ͅa̤c̺̙͉̠̠̺̣i̶ty̧̟̖͍͖: ͔̝̦!͇̟̩̲̞0̩̞̪̦͇,
                                ̖̯͚͝fl̘͓͙̬͈e̶͇̙̖͎̜̬x̻G̢̳̖ͅr͎̹̲̤̜̪o͉̫̳̥̩͇w: ̞͚͍͇!̨̝͖͙͕̩̘ͅ0͖̜̖̱͖͢,
                                ̩̲̬̤̻͖f̶l͇͔̦̙͓̬͔ẹ͉̜͘x͔̯̥̦̺ͅS̥̪̻̯̞̯̩h̺͉͈̟̺͉̟r͓i̡͚̣n҉̭k͕͢: !͚͞0,
                                ̲̭̬̥̬͈́f̫̟͇͖͝o̶͎̜n̛̠͎͚̗̰̹̟t̙W̘͙̗è̬͍̝̲i̬̞͓̯̹̹̞ģ̞͓̫̝̯̫h̩̮t̞͚̦: ̗̲͚̘̤͞!̥̝̺͟0̭͈͈̦͓̱̩,
                                ͚͘g̬̥r̹̰i͚̫̰͎͉dA̝r̻͝e̷̹̳a̩̩̤̠̟: ́!̠͝0̼̣ͅ,
                                ̺͔̬͕g҉͇̻̙̯͙͔r̗͔̤͚͝ͅͅi̘̜͎̯̻d̷͕C͚͎̯͖̫͡o͖̭̹͇̦̹̣l̦ų̦͈̰̗m͓͎̪͞n̨̤̱̲̦̗̙͔: ̲̮͓͔̠̻!̳0̰̞,
                                ̨͈̰̗̝̬g̹̥r͕̩i̪̱̗d͓͇̭͎̼C̛͔͈͉̘̞o̡̞̪l͜u̗̖͠m҉͓̭͖͚̱n̢͉͔Ȩ̬͚n̳̺̼͟d̩̗̠͝: ̟͘!̛0̥̘̞́,
                                g͙̭͕̜r̯i̬̻̠͙d҉̪̹̬̦C̘̹̞͚o̠̻̣l͈̞̼̱̪uḿn̝̦̙̫̬̰Ś͉̯̼̝̞t͉̭̦̞͓a͙̦̯̥̼r̨̞͖͓͚t͔̟̠̮̤: ̟!̶̹̱̱̥0͝,
                                g͔̱͍̟̱̰ͅr͖̻̙̭̪͈̟i͕͚̝̹̮͓d̨R̩̫͕̹͡o̵w̢̪̱̫͔̮͔͔: ̭͙̲!̞̻̦̦0̸̳͔̫,
                                ͎̭̜͎͙͉̳g̣r̵̤i̷̺d͏̭R͔̠͜o̜̠̮w̨͓̥͕E̲̼̞̖̝͉ͅnd̦̥̲̼̹̮̜: !̛̣̣͈̣̲0͙̙̘,
                                ̡gr̢i͔͓d̙̘̜͇̼R̨̲̤̱̜̪̯o̸̼w̻̯͈̟͟S̼͖͈t̹͜a̸̘͔͉r̷̲t̵̬̞: ̡͔!̴̬̯̫̞̱ͅ0͎,
                                ͓̥̤͞ḻ̷̱̬ͅi̢̖̞ņ̫̠̻͍ẹ͉̮He͚͇̼̯i̻͇̙ͅg̢h͉͍̱t҉͈: ̼͕!̳̯̪̩̦0͏̪͈̯̜̼͔,
                                ̵̫̯̞̬o̝̦̟̦͎̼p͏̩̫͍̻͕͚͚a̯̭̫̰c̥̣̻͉͇̳i̠͓̙͔̳͍̜t͙y̻̫͓͖: ̴͕̝̦!͢0̝̮̫͎̪,
                                ͡o͇̖͞ŕ̠̠̰̘̖͖͖d́ȩ̦̭͈̝̙r̠̙̥̤͔̺͔̀: ̵̹͇̯̰̩ͅͅ!̟̥̤̞0̞͞,
                                ̛̤o̝̩̘͜ṟ̴̫̲̳̯p̟̦̣͙̠̞̠h̶̝͔a̠͉̜͓͞n̙͔͇̜̞͉̘͞s̠̰̟͎̹̯͡: ̴̫̰̦̻̘͔!̵͍0̥͎̞,
                                ͙̹w͍͈̪͟i̳̼͟d̥o͏̖͚͎̰͔̲w҉͇͇̲͔̞̠ṣ͉̩̘͍̠: ̝̺̘̪ͅ!̨̗̣0̩͚͙̫̞͍̤,
                                ͎͖͈̥ͅẕ̦̠͟In̘̫̬͍͜d̠̥e̛x҉̺̬͇̠: ̜͔̲̪̜!̴̘͈̩̘0,
                                ͍̬̺̰͇͓͍z̮̻͍̫͇͙̻o̥̟͞o̻͓̠̟͖̩̳͟m̯̘̦̗̪͠: ̩̟̙̩̱̞̠͟!̰̤̜̖̣̮̦0̙̙͢
                            }
                            ̠̬̙͕,
                            ͙̣͔̞c̥̠̘͡s̵͚̼̳̬͉̮s̨̥̘͈̳P͍̮̲̬͓̜r̻̭̝̟͚ͅo͔̬̱̤̙̣ͅp̰̙͕͔̙̭͝s̪: ̯ {
                                ̞̖̲̤̟̻
                            }
                            ͖̲͙̹̺̻,
                            ̥͓s͉t̰y͜l̴̼̯̲̳ͅe͏̹̞̠: ͟f̠u͉̹͚͙̜n̪̫̥̱͚c̠̹t̩̩͙͕̤̗͔i͇̮̖̭on̤̥͕͇͝(͡e͖̥̦͍͟, t̼͖̲̘, ̻̀n̢, ̤̺͔̼̥̬r͚)̕ {
                                ̻͎͚͎̝͓̘if(̻͔͚͎e̠͍͙͚͎ & ͓̟̰̼̫ & ̴3̜͕̟̯̀!̯ == ̗͚e̴͕͙͔̱.͔n͚̘͓͙̙ͅo͈͖̦͞d҉̮̳̱̲e̫̺̠T̝̼̞͕͙y̨̯͍̝̩̗p̻̦̜̳̱͓̺e̘̺̩̘̬͝ & ̥̭͙̮ & ͎͖͉̪̖̫8!̨̣̺̥̰͉̺͔ = ̵͕̣̱̠ = ͢e͙̥̳͙͘.̟͝n̛͔͎̗̘òd̛e̙̻̦͖Ty͈̣̥̪̞͈͔͜p̼̘̼e͉͎ & ͉̦̗̗̬͍ & ̴̟e̛̲̮ͅ.̴͖͍s̭ṯ̤̗͉̤y̥le̹̬̖̙̯̪)̢̫ {
                                    ̤̭̤̭͕͓̥v̧̥͖̱͎a̸̗̙̗̻r͜ ͎̥̬̲͈̟̗i̛͕̬̭̮,
                                    ̛̩̹̘̗o̥̺,
                                    ̡͎̠̻̜̻̹̦a,
                                    ̖͍̝̪͚s̴͕̱ = ҉͓̗̤̘̼̟ͅX̟̳̤(̥̣̯̀t̥̞͇̀ͅ)̘̬͖̦̞̤͘,
                                    ̗̮̺͎u̥̠̺̗̞̫͡ = ͎̮̞̭́X̡̲̲e͔͍.̬̼̪ṭ̗̫̻͉̕e̮̞͈͖͖̳̳s͏̱̖͇̘̫t̢̯̯̪̘̺(̞̰̹̥̹̜̱͡t̲̝̜́)̪,
                                    ͙͔̬͘l͕̥̮̯̩̲͞ = ̵e͇.s̜̟̙ͅt҉̻y̫̮̩̝͡l̵̠̻̟e̸;
                                    ͏̝̬͙̞̗͇̣i̢̹͖̹f̡̯̯̺(̪̦̦̦̞̞̗u҉̻̹͎̥̤ | ̜̰̝̳̦̲ | ͙̮̯(̙̪̘͍̦͎̘͞t̡̥̱͇̻̤͔ = ͙͡z̴e̢͎̣͓(̯s͏)͜)̤̼͍̟̬, ̖a̟͝ = ̸̱̙̬̖S͈͝.̴͖͉̩̘͙c͉̯̼̣̣̪s̺̳̙͞şH̝̜̞̭̫̣̮o͕͕o̜͜k̨̳s̹̟͚̙͇̟͝[̸̮̱ͅt͔͎͇̠]̮͍̀ | ͚ | ̢̻͎̥̘̟͕̮S̴.̶͕̖̺̤̹̥̜c̶̮̰̜̮̥s͖̠̳̜̱͡s̭͍̺̬̳̥͖Ho͚̣o̘̠͎̰͈k͠s̛͙̞[s̛͕̠]͇͖͎͉́ͅ, ̯̙̳ͅv͜ǫ͈̗͓̬̪̳id̝̀ͅͅ ̠̟0̩̲̭͔ = ̘̗̫̙̙͔̲ = ͇̞͉̪͡ = ̪̦͔ͅn)̱͘r͟é̦̻̣̟͈̹t̡̞̪̫̮u͇͚̭̠̭͇r̝̞̖̰̼̩ǹ̹̠ ̗a҉̬̪ & ̛͉̘̙̱ & ͖ "҉̖̝̜̳g̞̭e̺ṭ̤͎̳" ̧í͇̗̹͙͈n͔̠͕̺͇͔͇ ͔͢a̧̟̖̤̺ & ̦̦͉͈̦̝̙͜ & ̣͓͜vo͙̤̼͉̱͖̟i̘̲̝̪̟̪͞d͓͉̹ ́0̮!̲̳͉ͅͅ = ͖̪̺͇̝͚̞ = ͉͉̲̦̭(̜̖̞̰̦͍͟i͚̭̗ͅ = ̘̘͕͚̯̲̬͝a͖͖.̥̭g̸͚̺͓̮e̵͍̠̻͎̥͍t̼̥(͈̞̰̙͚̣̰̀e̛̗, ̬͍͈̪!̩̖̻1̛͖̥̰̼, ̦̠̹͜r̫͉̱)̛̯̦̭)͉̣ ? ̴͓i̶͙̲̖̪̖̫ : ̫͎̺͍͓̯́l̘̥̖[̮̩́t̮]̝̬͍̝̯͎;
                                    ̞̀ "̸͉͈s͍͖͎ͅt̺͙͉r̺̲̯̲̟̪ị͎͇n̲̫̤͖̳g͓͎͙" ̰͓̯ = ̗͕͚͢ = ̡̤̳̩̲͔̦̬ = ́(͙̩͎͓̹͉̗o͉͚ = t̳̞̖̼̻͈͜y̨̗̤͉̦p̙͚͡ȩ̠̝̱͎̙̳ͅo̜̺͙f̡ ̩̺̦̲n̸)̦͈̮̤ & ̪ & ̻͉̻̼̦(̼̖̖i = ̧̞̝̖͚̗te.̵̬̝͓̩͚e͡x̫͔̞̘ec̮̤̺̻̤̪͙(̼͓̝͎̙̺̘͝n͔̹͓)̬̻͓̹͙̯͈̀)̠͈̙̠ & ҉͉̝̳̮ & ͔̼̫͖̫ḭ̯̦͎͞[̼̺͖̜͇1̩͕̠̜̲]̯̞͜ & ̪̣͚̥͓͙ͅ & ҉̯(͉̩ṋ̸̭̠ = ̧͖͕͕̻̜̫ͅs̻̜͔e̡̦̟͉̱̰̳(̮̟̰̣͍̰̩̕e̤̙͙̘͚̤̱, ̻͓t̫̣̹͈̕, ̱͓͘i̹̕)̲͔̕, ̬o͇͈̝̠̪̞ͅ = ͚͎̩̭̤͢ͅ "̤̯̤n͔̮̳̩u͍m̸͔͚̲b̞̬͔̼̳̱e̛̫̤͕r͚̻̮̗͠" ͟)҉̮̦,
                                    ͏̖̼̻nu͍̫l̦͓̭̲̰͙̦l̻̬̩͍̻̮!͢ = ̘̗͔̩̞n̦̝͖̪̠̟̥͜ & ̜̠̠̝̫̙̯ & ̥̭̲̱͕́ͅṇ͚̥̲̻ = ̻̻͘ = ͙̘͇n̷̻̫ && ͙̼̫̺́("͏͈̘̤͕n̩̠̱͢u͖͚̟̦͖͓m̷b̡͎͔̟e̳̥ŗ" ͎̰̳͚͔!̣͚̯̟͚̠̀ = ͞ = o͙̝̟ | ͔ | ̞͡ͅù̘̜ | ̬͓͈ | (̗̞͖̻̙̥ͅń + ̤̱̗͇͙ = ͎̣ì̠̣̳ͅ & ̡̹ & ̗̗̀i̜͖͖̜[͜3̺̦̗̤̘͚̬͝]̨͉̬̤̣̠ | ̮̭̙ | ̜̜͖͕̰(̢S̹͕̜͍.͏͔̲̳c͇͓s̢͚s̠͘N̴̯̺u͖̟͎͖̦͍͜m̫̖͔̙̜̮͈̀b̢̗̫̗͇̯e͏̱͎̬̱̝̪̮r̤̻͈͓̫͟[̫̱̙͕͔͘s̰͍͔̰̘͖͠]͈̩̘̭̤̫͈ ? "̛̤͓̘ͅ" ͏̹͔͎ : ͎̭ "͚̹͙̩͞p̷͙̙̰̲͖̖x҉̖͔̬͉͚͖" ̠͈͚͎)̵͔͎̳̬)̛, ̞̖̭̖̘ỳ͓͉.̡cl̵͖̱e͇̯͍͡a̲̗̣̙͞rC͓̟͈̼l̤̠͎̹o̢n͖̮̯̦eS̫̫̠͕̬t̳̩̖̩͖͎͙y̡͔̯͍l̩͚̘̝͢e̸ | ͔͚̭̪ | ̛̬͎̩ "͖̻̺̘͕̙̻" ̺͕̦͓̖̙̤!̨͚̝̫ = ̵͇̫̬̪͓ = ̢̭̗̥̦͉̥n | ͉̺͉̬͉ | ̬͎͠0͏͇͈̰!̗ = ̝̪ = ͚̀t.͖̞̟̟͖͕̤i̪nd̴̤̱̩̖̥e͓̭͕̝͓̮̯x̝̤̖͉̼͔͍O̬͚f̙͓̞̠̥͢(͈̥͙̼̝̦̤͡ "̮̫͔͘ḇ̛a̶̫͙͎̯̰͉͖c̸̮̦̙k̬͔͇͙ͅgr҉̜o̸̙̪ṷ̮̘̫̟nd" ̲̗͚͚̲̀)͙͖̜̹́ | ̖̬̗̬̩̻ | ͏̬(̵̖̰̰ͅl͖̦̦̘[͍̀ͅt̷̞]̱̺̲̘̤ = ̴̥ "i̲̳͓̪̘̤͉ǹ͙̣͙̲͖̞h͎̜͘e̡̮r̮̞i͔͙̗̟͚̝̼t̝̠̫̝̦͡ͅ" ̧̬̦)̧̖, ͕̭͡a̪ & ̼̘̦̜͕͠ & ͅ "͖̦̹̥s̸e̲t̲̙͖" ̱̻͈̬̥͎́i̢̱̱̙n͏̯̙͖͈̙͖ a̤̪̭̰̰̰͘ & ̝̳̜͠ & ̹̖v̶o̪̳̠͚̱į͇͔̲d͓͚͍̜͞ ̯͉ͅ0͔̪͇̠ = ̨͚͚̺ = ͔̫̖͎ = ͠(͈͕͎͚͈̜̤n̢͇̝̘̫͖̭͕ = ̜͜a҉.̮̘̪̹s̡̘̬e̥t̤͍͚̝(̛̘̱̟͕͉e̗͟, ̗n̙͖, ͏̲̟̲͇̼͚r͏͖̲)͏̗̣̟̬̝̝͕)̮͍̱̹ͅ || ̣̯͎̯(̛̰̳̤u͠ ? ̮̲̱͙̫̜͉l̡̙̬̗̗̖̺͔.̠̖͚̙̩͙͟s̫͉̳͇͓̮̱̕e̖̮̣̘t̯̼̳̥͎̳͕P̞̦͈͙̦̦͕r̜̩̤̟̕o͉̥̙͙p̲͈͎̣͝ẹ̮͕͍̮͈̩ṛ͔̫̖̀t̳̱͕̯̪͓̣ỳ̫̬̲̱̹(̱͈̟t̟̦̳̜, ̭̬͟n͕̮͍̣͞)͓̘̰̹ͅ : ̨͓̹̱̼̥ͅl͚͉̫͟[̨͚͔̝ͅt҉̦͎̠̰͕]̗ = ̥͡n)̴)̞̤͎̦̹̻͓͠
                                }
                                ̥
                            }
                            ͟,
                            ̸̟̙̳̤͇̹̘c̠͜s̥̗ș̱̳̝̘͡: ̻̩fu͉̯͎͓̱ņ͚̙̩̟͕c̨̠t̲io̭̺̱̝͠n̸̦̩͓̖(҉͎͖͚̱̹̬e͢, ͇͇̱͖t̻͚, ̸͈̹̣̙n̝̱̯̺̺̙͘, ͇̘͇̗r)̖̻̰͈ {
                                ̤̥̺̭͜v̪a̙͇̠̙͉̭ṛ̞͖̼ ̶̱͇͈̠̼̟i̮̣̦̖͍͙,
                                ͞o̸,
                                ̝a̹͓̯͕͍̗̱,
                                ̯̜͚͕s̹̜ = ̨̯̪͇X̞͔̗͎̯̱(̧̰̜̫͎̻t̬)̢̫̭̗͙̮;
                                ̵̗̟̗r͖̭͙̭͕̬̠e͖̣̣̹͈͈͢ͅt̸̪̺u̯͉͈r̵n̛̠͍̫̩̜ͅ ̟X̭̤̲̭͍͘e̴̹̩ͅ.̭t̴̬̗̞e̯͙͕͎s͉̠͖͈̝ͅt̲̼͙̀(̤̲̼̳̗̲ͅt̙͡) | ̞̤̯ | ̬̱̪͙̳͍͕(̺t̵̖ͅ = ͓z͙̥è̼̻͍̘(̥͔̗̖̣͙s̛͔̟͚̻͔͕)̵̥͙̯̗),
                                ̀(̵̟̣̖a͙̻̬͔͈̦͞ = ҉̯̩̣̱͇̟̖S̝.̜̖̭̫̫̳͇̀c̮͞s̨͓s̛͓̦͈H̴o̬͍̖͕̪̘o͜k̥̠̜͔̳ş͈[҉̪̲͈̯t̠̪͈͕]̵̜̟͕͔̪̹ | ̴̻̘̩̘̪̲̦ | ̜͘S̮̼̠͍̤̥͞.͓͖̘̹͔̳̠͜c̵͓̮̘̣̜s̻̖̲̮șHo̗̱o̵̼̥̘̪̼ķ͇̺s͎̩̥̦̳̟͈[̠͜s͏͔̙̻̣̱̞̰]̤̞̕)̝̙̠̲̦̻̹͜ & ͉͉̟̟̳ & ͏͇͓̠̖̻͖ "͙̗͜g̫̙̱̝͇e̢t͓̝̩͔͜" ̮̜̯͕i͇̥͝n͉̯̙ ̲͕̣̰͍͍ͅa͚̮͉̮̞ & ̵̻͙͙͙͉̻ & ̹̭̘̱(̼̘̜̜̟͍i̱̺̺̠͢ = ͘a̠̙͚̣.̣̳̲̼̞g̤e̻̬t̶̺͚(̹͙̝e̡, ̰͚̲͖!̰0̶̠̼̹͍̫, ̳͈͓n̲̟͖̮̰̝)̥̙͉̦)͙ͅ,
                                v̱͓͞o̟̠͡i̥̼̞͖̖d͜ ̟̺͖0̩̯̝̩̘̦͞ͅ = ̱͚̠̪̪ = ͔̥̘͙̻͡ = ̥̰͇i͓̗̯͓̤̼̻͡ & ҉ & ͏̪͉͖(i̭̮̲̺͜ = ͈W̲̖̘eͅ(͔͚e͈̹̼̼͇̱̻̕, ̣̼t͔̠͔̮̱͍ͅ, ̺͕r͜)̩͖̭̘̹ͅ)̭̞̺͙,
                                ͉̫̪̮͇̀ͅͅ "̠͎̦͝no̼̖r̬͙͕̼̟m̡al̜̘͖̠" ̻ = ̫̰͎͎͙̹̀ = ̜̖̣ = ̷̠̫̺͚̲i̧ & ̰̣ & ̙t̖̯ ̪̝̺̺̳̰ͅi̳̣̰̭̥̦n͔̮͠ ͈̳̯̗͟G̲̖̕e̙͚ & ̲͚̠̪̩͘ & ͈(̨̣̝̜̪͎̲i͉͖̲͟ͅ = ̤͎̰̣͢G̤̕e͖̩̬̣͕͓̳[̜̞̲͇̯̳̕ț́ͅ]̖̘̼̥̦̘̖)̙̖͓̩,
                                ̵̦͎̠͈̲̣ "̙̩͎ͅ" ̟ = ̩̘͙̻̪ = ̲̜̘̹̫͖̻ = n̟̣̖̬͕̤̱ | ̹̗̭ | ̥̜̭n҉̟̫̦̺͕ ? ͎̲̗͠(̧̲͔͚̤̯ó̥̞̰̯̳ = p̻̲̳̠̥̳a̦̝͈̮r͖̗̞̣͎̬͉͟şe̶̩̲ͅF̯l̥͝o̭̞̕a̹̥͕̭̞̞͠t̰̲ͅ(͡ḭ̮̻̜̪͚ͅ)̹̥͙̗̻̥̙, ̛̯̻̺!͚͔͔͇̠̭0̠͍̰̣̙͎ = ̴ = ̷͚̞̖̺ͅ = ̷͉͎n̞̥̭̲̕ | ̴̫̻̫̭̬̺ | ́i̢sF̳i͖̰̤͍͙͇̭ṋ̭͙i͓͓̤͓ţ̦e͓(͟o)͉̜͔͔͟ ? ̝̙̕o̷͓͙̻̞ | ͎͚͇͍̪̙̠́ | ̝͖̫͙̥̝0͈͉̪̖͎͓̕ͅ : ̝̭̬̖̥̺í̪̦͍̩͇ͅ)̘̙͍́ : ị̲͚̠̤͟
                            }
                            ̩̪̦͢
                        }
                            ͙̺̩̭͎)̣̥͔͙̜̥ͅ,
                        ͖̗̯͙̪̜S̤.͝e̮͔͚͚̤͘a̪̱̗c̜̠̥̯̕ḫ͖̗̺̥͢(̣̝̫̮̣̗͡[̛̝̳ "̲͙̠̹̞̤h͝e̡̫ì̻̮͇̞̹̪g̗̣̼̺͙̘͉h͚͚͉t̵͎̗" ̞̞̜̻̞̠͎, ͚̙͢ "͉̥̪̫̼̱̠w͏̺̰̫̯̯̹̱į̦̲̘̳͉͓͉d̢̝̦̝̺̣t̤͖̳͎͕̝̭h̼̤̞͍͘" ̤͙̟]̵̪, ̱̪͙͙̱͙͈͟f͞u̬̲̼͎̠̖ǹ̩͍͎̥̤̖c͕̞̘̯̟t̢̯̞̥̲͈̺i̺͇̞̪̜̮on͙̪(̭͠e͏̦̱, ̪̥̦͈ṵ͖̙̪̺)̼͍̞̫͍͉̜͜ {
                            S̛͔̺̝͚.̼̻̦c̰s̻͔̣͉̫͍͘ś͍̞̯͚̳H̳͈̰̠͎o̟̞̘̼̭̺͠o͏̙̣͕̺͕k̭͈͕̫͕s̺[͘u͍̟̰͟]̥̕ͅ = ͓͓̜͕͎̖ͅ {
                                g̝̙̻͉̫͚͎e͖̮͓͞t̤̟͞: ̖͓̝̹͉f̶͖̳un͏̠c͏͔͕̳̲̗̩ͅt̛ì̯͔͍͎̥o̤̟̬͖̪͔n̜͇͇̱̦(͙̻̗ͅe͡, ̤t͓̱̰̦̱̺͠, ̬̞n̥̞̜̲͢)̺͔̻̼̳̟ {
                                    ̼i̳̭̭̼̯̗̫f̝̗̬͇͈(̸t͙̪̼)͓r҉̟e̺̻͈͖͇̥t͏͕̱͔͇͔u͉̟̟̤r͕̫n̪̻͓̺!̻͚̣͉̖͍̕U̙̮̮̤͚͉e.͔ͅț̷̦̬͍͙͍e̠͘st͓͙̞͢(̮͜S̤͈̜̰̣ͅͅ.̣̱c̸̼̜̞̲̬̠ͅs͉̫̠̳̩͓̫ș(̧e̝͜, ̘͔ "̟̞̘d̙͔͖͙͉i͚͞s̤̫̹̫͝p͚̹̟̰ͅl̮̟̺͖̩a̙y̬͇̘̫" ͎̬̦͉͕̟)̟)̤͕̱̣ | ͞ | ̀ḙ̸̬͈̺̠̯.̗͚͉̟̫͙̳g̭̭̀e̸̜̫̮̣̟t̻͔̝̹̭̪̺C̻̳̥̩̞͡l̫̰̣̖i̢e̵̠̫̺̟͕n͏͕t̳̺͎͙R̥͈̤̯e̴̦c̖̩͇̗t̸͎̣̩̜s̭̘̦̲͚̜(͕͡)̶̗͇͖̤̘.̗͉̬͙l̲̖̻ͅe͕̱̘͡n̤͜g̮̭̜͓t́h & ̜̀ & ̝̣̜̞̩̰e͉̣̖̮.̵̻̯͖͉g̹̟̦̖̣̝͢e͈͉͎t̜̪ͅB͙̗̘̮̳͡oų͓̪̣n̤̗̫d͈͙͕͙͓̩̪ín͕͉͓̝g͈̭C̣̞͍̜̜̪̩l͉̙̦̥̯͓͔͞i̲̱͓͚͙̟̰e̷̲̭̟̲̮n̹̺t͎̬͖̗̱̺̞R̖͇͙͔e̛̹̣c̘̜̟ͅt͙̺̬͇̞̻͡(̮̺̮̬͡).͕̩̫̜̺̰w̤̠̝̫i̪̕ḑ̤̩̲̦̹̰t̼͘h̤͙ ? ̩͔͎̪̫͟J̲̦͙͓e͕̻͔͇̠̟̹(̷͍̖̯̲̪̣̘e̵, ̪̩̬̗̗̗̗́u̢̘͎̰̱ͅ, ͕̤̠̞n)̛̤͕̤̟̪ : ̸M͇̪̤̗̲ͅe(̶e͖̠̮ͅ, ͚̠̲̮̯͓͞ͅV̧̞͈̹e͏̲, ̙f̮̳̲̝͇̕u͓̪͕n̬̟͡c̨̹ͅt̵̩͔͎̰͎ḭ̕o̯͡n̮̗(̢)̳̻̠̭̖͉͍ {
                                        ͕̭̝͇̤͈ré͓͇t̗̩̪̹u͇̱̞͙̘̯͓r̺̟̖͚n̤͉̞̲̟̖͠ ̧J͠e̘̻̙̫̘(͕͍̣̬̦̤͎̕e͖̱̖̮͍͖, ̛͎u̦̫͍͚, ͇̜̤̖n̢̙̰̖̠̭)͓̙̥͙
                                    }
                                        ̧̙͔)̭͓̤̰̠̦̖͞
                                }
                                ̳̤̠̝͈̬͖,
                                ̶͎͖̠ș̱̪͕̤̘͘e̺͚̜͍̹̞t͖͜: ̜f̯̥̜͓̝͝u̺̞͠n̘̝̮ct̸i̙̦o̷̲̦n̜̝̬̯͕͞(̵͕̱̯̜̠e̼̘̞, ̵t͚͈͚̙̻̯͇, ̮͎̰̬̺͘ṇ̛͈̲̭͓̪)͢ {
                                    ̴v̟̹̳́a̴r̼͚̣͈̹̣̣ ͓͚͙̙̮̼r̙͇̹͉͔͈̬,
                                    ͇i͔̺̱̱̤͔ = ̥͓̬͍̮̹͕R̺͎e͎͈̫͞ͅ(̝̯̤̦̘͎́e͈͘)̥̹͇̙̘͓͙,
                                    ̖̦̖̰o͓̼̦̘̰͡ = ͈̲̭̯̩̫͖͡!̼y̷̠̹̘͉̤̹̞.͓̫̝̠̞͡s̷͙ç̻͕r̴̦̠̘͍̳̦͎o̲̫̘͚̱l̡̻͇̰̬̬͖l̮̙̭̖͜ͅb̞͈̦͚o̶x̮̦̠͓͍͔́Sḭ͓̦̪͢ͅͅz̼̥̕e̗͉̝̞͈͝(̥͖)̗̗ & ̰͖̱̲͖ͅ & ̝ "̗̼͠á͖̜̯bs̸o̟̰͕̰̖̘̦l̩͓̩̤͕͟u̻͖͎̘̤̘t̡e̩̤̺͠" = ̸̣̼͖ = ̹̹͔͓ = ̠͇i̸̫.̨p͍̱̙͠o͖̙͕̖̹̪͡ş̖̲͕̭̤͈i҉ṱ̨͇̻͈i͔͙̤̲̤͍͚o̬͢n̷͙̝̟͇̳̞ͅ,
                                    ̱̘̩͎̫͎a̘̜̱̮͙̗͟ = ̥͈͎͉͚(̭̣o͡ | ̺̜͘ | ̹͇͙̯̦͢n̷̠)͡ && ͏͈͍͚̬̹ "̠̼͟b͖̺͚̗̫̰o͏̞̟͍̳̼̗r̺͖̺͘d̴͎̫̘̮͕̹e̝̮̖̜͠ͅr̖̙͘-̫̯̗̲̱̟͞ͅb͚͚o̴̩̫̬̩͉x̭͔̘̯̗ͅͅ" = ͚̻̰͈͎̯͘ = ̷̹̲̻͓ = ̦͕̪̠͙̬͙͠S͚̤̭̫.̮̝̲͕c̠̜̬ṣ̭̫͖s̛̙͔̜͈̱(̥̺͇̺e҉̘̙, ̗̹̝̲̲̼͔͠ "͏̻͚̤̠̭b̟͔ͅo̹̗x͚̭̥̜̬̝ͅŚ͚͉͚̥̩̘i͈͖̤̣͖̫͉z͏̟i̼n͡ģ̜͈" ̱, !̠̹̜1̨̼̘, ̠̥̳̭̙ị̥̣͖)҉̺,
                                    ҉̦̭̭̫͔̗͕s̜̖ = ͍ǹ̯͎̰͙ ? ҉̠̙̝̦͖̙ͅQ͉̝͇͖͞e̛̪(̖͙̣͖̞ͅè̜̙͖, ̨͍͚̙̤͚u͕̖͙̩̼̥, ̻̙̤̜̰͎̦n̡, ̗a͍̰͢, ̡i̢̠̘͚̣)̭͈̗͉̞͕͟ : ͙̖̜͉̣0͍̺͚̼̱͠;
                                    ̴͈̥̫̩̼͈͇r͖̳̝͠e̤̝͔͈͇̘̪t͎̺͈̫̺ͅur̮̖̻̩͡n̶̫̗ ̮̺̣̩̦̱͝ͅà̲̮ & ͢ & ̭̼̦͚͔o̡͇̱͔͔ & ̫͍͉̲ͅ & ̘̺̲̰͚(̘̻̟̬s̥̻̤̥ - ͏̙̯̖̦̱ = ͍͞M̡̬̭̳̦͔͍͓a̫͇t̨͈̙̖h.̫͖̘̙̮̝c͕̘̖͔̪̰̕e̲ì̱̜̟̺̖l̨̳͎͙(̷̤è̖̯̝̼[͔ "̶̦͕̫͚͕̝o̲̜͖ff̺̩͕͚̙̝͈s̡̖͖̟̮̘e̪̕ͅt̵̹͍̭͉͖" + u̲͎̼͈̦̤͕͝[̴͚̣̹̱̱̞͕0̳̬̼̳̮̰]‧t̲̹͖̝͕͇͍o̼̼U̢p̯p̴͔̪̬̣̝er̵Cą͓̥͍̠̩s̻̣͓͚e̲̲̹̦͇͖(̦͉̦̘͈̬̦)͚̮ + ̢͓u͏̥̝.͙̝̼̖̥̫͞s͚̲͖̻͔l͏͓͚̲̟i̞̰̖̦̯̝̪c͇̮e̙͜(̦̭̣̳͍̜͕1̸͓)͕̠̜̗̳̯̕]͘ - ̬̪͙p̥̤͔a̬͚̳̜̟r̠̫̤̪͙̻̀s͉̰̬̰̼e̘̮̻̱͖̺̙F͓̥̫̪͙͕l͎̱͘ͅo͓͎̲͈ͅa̠t̼(i̶̘̭͓͚̥[̲͞u͇̩̠]̤͖̻͕)̘͢ - ̸̪͈̘̖Q̗͕̻͓̕ḙ̭̼̀(̞͓͇̞̪̜̭e̕, ̪u͉̠, "̧̗̞b͍͚o̦̝͢r̶d͔̖̼̺̥ȩr͠" ͔̱͍, ̫̹̝̼̘̣́!̫1͘, ҉i͔͇͚̠ͅ)̘̯͓͙ - ̶̥͎̲̱̺̥.̜̜̥̳͚͇5̪͍̺͎͔)̬̥̦̙̦)̜̠̣͔̘,
                                    s̨͉̬̪̭ & ͠ & ̝̺̯͙̰̗͕(̪͉̪r͔̘̙̹ = ̭̫̮̜ͅte̱̲͈̲.̯͇̝e̤̝͚̻̫͜x̬̯͇̲̼̀e͕̥̼̯c(t̩͇̭̙̩))҉͙̠ & ̡͚͇̩̗̦͓͇ & ̝ "̯̮p̸̜̮x̫͕͎" ̘̯͇̺!̫̩̟̜͔͈ = ͍͖͉͔͘ = ̞̥̼̣̫̳͡ͅ(̵͖̜͉̦͔͙ͅr[̳͎̲̼̟̱̞3̛̰̠͍̪ͅ]̦̯̲̯́ | ̹ | ̺͙̲ "̯̝͠p̫̤͔͕͔͈͈x̡͔" ̠͎̫̙̣̠̣) & ͕͙̤̬̦̘̻͞ & ̯̫̗͞(̸͔e̱̱̲̜͓̪͇.̛̟̘̭̭s̷͈t̟̭̼yl̢̲͎̦̞͚̹ḙ͔̼͚[̻̦u̘̥̜̭]͈̖̝̪̗̮̘͢ = ̜̞͎͉͉͎̩t͈͠, ̦̻t͉͘ = ͔͈̘̝S͙̳̳̬̜.cs̛̼s̩̰̖̼̝̣͖͜(͉̠̼̳̗̪̻͜ḙ̯̪̟̜̗̘͘, ̠͚͙u̻͍)̪̲̠͙͘)̱̺,
                                    ͓͓͓̰Y̻͎̲̞e̝͘(̶0̟̜, ͍̟̘̖͇̙̗t̥̤̟̙͎̺͝, ̙͇̮̰s̙̖͔̪̹)҉͔
                                }
                                ͏̭̦͚
                            }
                            ̴͈
                        }
                            ̘)̙̮̣,
                        ̱̣̟S̜̝̜͍̜̣̖.̬̙c̨̞͔͖̯̙ͅs͖̤͢s̥H̰o̰͖̟̦̥͝o̢̟̭͈̟k̺̰̠̫͍s̡͓̗.̮̪m̘͔̗̪̥͟a̫͈̘r̫̞͔̘̯̲g҉̝̺͖̯̣i͚̼̦ń̪͓̳̰͙͙̥L̩̩̠̘̯ͅe̜͈̲͚͙͈f̸̤̜̘̝̥t͚̦͓ͅ = ̥̙Fe̯̼̬̭͉(̹͎̳̪̼͚y̕.̤́r̪͕̲̩͍̗͜e̱̺͍͕͈l̙̞ia̴̞b̴̝̭̯le̛̯̞̬̗̲̣M̮͎a̱̪̤̹̫r͇g̷̲͓͓͕̲i̞͖̪nL̘̲͈͡e̮̪̣͢f̷t̢͙ͅ, ̪͉f͖̤̺u͎̜̹̺ͅṇ͙͍̞̫͚c̮̝̰̖̞̦̭t͇̺͙̪͜i̦͓̭̣o͚͍̗̩n͕(̸̻̗̤̪̘e̴̮̝̬, ̭̱̤͕̻͖̫t̵͕͙)҉̥̼ {
                            ̼͕̲̹ͅif̝͈̗(͎͉͖͉̜̤ͅt̬̬̦)̗͜ͅr̘e̥tų̣̤̮̼̺̪̭r͍̠n̰͉͘(̧̗ṕą̬r̬̘̤̲͜ͅś̞̟̞̗̙̘̖e̬̫̺͈̣͕͔F̧̪l̬̹̘̬̱o̖a̝t͖̮́ͅͅ(͏W̭͇͙͇͖̻̼è(̱e͓̠͍̤̲̗, ͔ "͕̤m̹͎ͅa͕̙̫͚̦̝r͕̦̥͞g̫̼̥͚̳i͉̜̺̼̭͜n̪̣̜͕͓ͅL͙e̜̣̤͢f͏t̝̦͉̞" ͓̝̜̭)̱̖̀)͔̙̣̝ | ͏̪ | e̯̗.̺̲͕͍g̕e͍̭t͉͕̙͚͙̰B̟̰̯͈̥͟o̹͍ṳ͈͚͕nd̯̣i̥͓̼̙͔̝̱n̢̥̠͕̤g̯̯͇͓C̕ĺ̗̪̳i͔̹̯͙̝̙͙͢e̴̼ṋ͓̦̭̗͢t̶͍R͚̥e͈̭̳c̞͉̥̺͍t̲(̲)̯̩̰͢.̖͡ĺ͓͕͇̼͙̤͓e̻̩͓̪͟f̘̪̲̩̺t̻̙̭̜͎ - ̟̙M̮̱̻͚̻͎͕͡e̦͎͞(̧̯̬͇̬͚̪e̪̝̬̱, ̲̜̥͇̰ {
                                    ͖̭͍ͅm̡a̸̲͕͙̬̬͓r͈̝̯̣̞̗͝g̘̻̮i̺̩̠̱͉̠n̷̞̻̯̝L̤͔̖͇͢e̮͍̥f̱̰͉͞ṱ͔̝̤̟̘: ͡0̞͇
                                }
                                    ̹͉̲͉͘, ͖̰̙̥͔̼ͅf̵̩͙ṵ̬n͙͎̲̥͚̬͘c̷̫̱t̖̠̪i͇̫̗͍̹̣̖o̫͇͚̝̬̼̪n̺͓̪̲͍̹͔()̠̟͎ {
                                    ͍̗̖͙̀r͙̙̭̯̙e̼̺̳̘̺t͔̟͉̪̯̙u̡͓͔̞͔̭r̯̟̹̜̯̘n͟ ͏e̟̺͔̩̕.g̴͚̪̩̺͖̳ḙ̗̕t̺̪B̯̙̪̲͠ͅo͔̻̞͉̩̫̮u̼͔͍̩̭͈̙n͎̥̯̯͖d̥i̺̮̫n̢̙͎͖̻̙g̨Ç̲l̛͓̣͍̺͈̙͚į͓e̗̭̳̬ͅͅn̰ț̜̩͙R̦̺̭̙̣e̷̤̪̼c̴̪̰t͠ͅͅ(̺͚).̠̯̺̬ḻ̯è̗̹̼̝͖͙f̰͚̭͈̬t̞̣͍̹̘͈͡
                                }
                                    ̯̘̰͎̲͙)̣̳̭̱͎̣ͅ)̣ + ͔̞̟̘̺͟ "͕̳͇̱͍͢p̰̺̟̹̕x͕̻̘̗" ̝͉̖̳̬̲
                        }
                                ͏̟̲)̸͓,
                        ̫̯̟͍S̞̻̖̱̖.̗͖ͅe̻̘a̢c̮̫̯͢h̠̮̩͚͈̖͚(̡̬̝͙ {
                            ̡͙͈ͅḿ͚͚͍͇̲͎ͅa̡̤̖̩̞r̙g̲̪̣̮͇͔͠i̗͉͘n̜̤̺̮͖̟͎: ͔̫͈ "̣" ͡,
                            ̙͈ͅp̗a̛͚̱̰͙̖͕d͚d̨̼̘̖̜͇ͅi̤̳̗̺̱̖ͅn̹g̜̲͍͕ͅ: ̗͉͉͍̤́ "̦͔͉̖͚" ̵͇̭͚͍͚̙̥,
                            ̨͙̙͇͖̙̩̙b̮̟͎̦o̵r͝d͙͍̙̗͚̯͝ḛ̖̦r̞̦̭͕ͅ: ̶̝̝̣̥̯͔̺ "W͙͢i̷͓̞͕̜̩ͅd̸̥̲̗̖t̨͍̹̭h̙̫̞̥̖" ̳̮̹̦̲̤͠
                        }
                            ͜, ̶f̰͉͓̩́ͅu̬͕̯̞͍̥ṇ͕c̰̼͇t̫̳̱̺͕̣͜ͅi̢̘͚̱o̥͞n̤̠(͙͎͕̫i҉͍, ͎̖͍͔̬͎͇ó)̮͇̟͖̱̥ {
                            ̤̜̹S̻̯͔̭͘.̴̼̗cs̵̥͚̦̭̦̭s̰͕̣H̰o͎̺͎̲̕o̦̘k̘͞s̼[̳͕̠̪̦͍̥͟i̖̠ + ̥͉̜o]̛̪̞̰͇̺ = ̳̱̬͢ {
                                ̡̜̬éx̼̻̤͓̥͙͎p͖͎̣̣̠͍͘a̶̞̥̦͇̤̳n͕͇d̘͖̥͈͠: f̹͔̭̦͓̀u҉͖̮̤̭nc̷t̻i͇͉͓̣o̮͉͝n̪̰̜̥(̮̰̰e̡̲̰̫̯̻)̝͘ {
                                    ͚f̳̺͍̭̱̘o̧͚ṛ͜(̨̞̹͍̥͕͎̗v̘̫͖͕͚a͕̫̱͔̥r̜̠̜̲̜̹̗͠ ̖́t̪̱͢ = ̡0͖, ̮n̮̯̺ = ̹͕̪̙̲̥̭ {
                                            ̧̤
                                        }
                                        ͏, ̲͍̜r̫̱̩͍͚̺ = ̺̲̪̞́ "̝̥̹̠̮̥̦͜s͉t̟r̢͉̝̫͇̣i͕̜͕̩̞n̥̜͔̞̭̘g̣̝̗͞" ̸͔͙͕̥ = ̞̻̻͇̯͖̗ = ͓̞̱t̤͙͔̠̻y̵̭̲̖̮̫͇p͔͇͙̖̼e̮o̧̰̣̰̪̞̤͉f͔̝̳ ̥e̤͔̕ ? ̶̙̖ę.̼͠s̙̳͓p̢̹͇͎̣̖̖̦l̨ḭ̣ͅt(̣ "͉̟̤̪̭̱̣ ̷̭͇" ̝͙̤̯̝)̻ : ̶̺͕̥[e̲̬̪̺]̻; ̘̲͉͓t < ҉͇̮̼̱̰̗̟4̤̪͎͖͖̦; ̳̻̰̘t̥̬͓͍̺ + ̩̮͈͘ + ͎͢)̦̫ͅn̘̞͓ͅ[͈̥͞i̻ + ̯̫͙͝n̻̲e̸̹̹͓͚[t͡]̨̙̪̘̮ + ̠̮̠o̬̲͕̹]̝̣̠͉ͅ = ̫r̵̼͙̖̯͈̬[̖̼͇t̩̞̖́]̷͕̲̥̩̺ͅ | ̫͖͉͉̰̯̺͝ | ̧͔̤̪̹ͅr̖̯̗͔[̦̀t͚ - 2͚] | ̼ | ̶͙̼̫̗̮r̙[̛̲̭0̖̟̥̯͡]̷͈̦̻̝̝͎͕;
                                    ͙̖͉̀r̲̠̦͇ͅet҉͓͉ur҉̬̞̞̻n͚̹ ̢̦͙͔̖n̠̙̞
                                }
                                ̖̟
                            }
                            ̳̭̼̭͟,
                            ̲̮͕̰͢ "͎̳͘m̻̹̞̣̲̠ͅa̮̪̟ͅṛ͇̪̥̝͟g̶̪̘̲̼̦̼į̼͚̝̭̜̳n̩̮̮̜" ̠̰̻̝͍͝ͅ!́ = ̰ = ̧̘̭̰̥̥i̙ && ̤͇̭̣͈(҉S.͈̹͙ͅc̪̜̲͜s̝͢s̗̩H̴͙o͈̥̜o͉̰̦͎̜͖͓ḳ̞̤̕s͖͓͇̗̘[͍̥͎i̖ + ͙̙̜̞̭͢ó]̛̞̳͖̤.͔̰̜͢s͜e͕̩̝̟̼̘̱̕t̹͍͚̠̪̫̠͘ = ̙̻̜̖̭͢Y̤̣̘̯e͙̝̲̹ͅ)̞̖̥
                        })̸̭̫̤̟,
                        ̧͈S.̬̫͕̮̟͈͟ͅf̨n̗̖͓̙͇̙.͏̹͔̗̫é̬̬̟̙̗͓x̨̜̗̣̜ͅt̜̬̦e̠̝̖̬̟ṇ̛̣̰̝̯̟̘d͖͓̮̖̤(͇̘͎̞ {
                            ̶̥̘̪͉̻c̱̱̹̥̹̗͓s͉͓̤͓̳͝s̵̟̣̩͙̝̲: ͏f̪͈̳u̦̲̤̪̭n̦͉̪̤̲̰͡ͅc̸̱̲̤̻̟̠͙t͢i͉̩͎͔͓̳͢ͅoń(̣͎̯e͓̯̣̘͟, ̯̘t͓̣͖̞̠̫̖́)̮͎ {
                                ͏͔͓̦r̕e̘̟̥̬͔͈͕͠t͉͞u͎͖͡ŗ͈̦n̖͡ ͓̥̲̜$̹̼͔̻̪ͅ(͍͙̰t̸̰̝̳̫hi͔̱͘s͖̟͔̯̞̞, ͍͎̼͎͇̜f̱͔u̟̯̫͚ͅn̙̤̞̰̲̗c̺̟͙̫̪t̘͓̝ìo̙̟̘͘n̳͍̺̖̩͞(҉̰̮̼ẹ̼͖̜̫̮̬, ͎̖̰̹̼̗t͓̹͓̦ͅ, ̠͇̼̟̺̠n͏̗͚̬͖̟)̼̭̹͉̫̳͖ {
                                    ̣̝̫͓̭̰v͍̣͝a̲͇̳r̶ ͕̯̩̮̗̙͠r̤̯͔̮̗,
                                    ̦͙̻͔i͉̻͕̠͙͉,
                                    ̶̹͈̯̗̮͇̙ơ̳̣̲̟̮ͅ = ̮̙͉̘͚̙ {
                                        ̙̤̦͖̠͙̺
                                    }
                                    ͚͉̮̪̻͞,
                                    ̷͉͍̯̩̠a̗̗̜͖̟̼͟ = ͠0̲͉̣̠;
                                    ̠̟̞̳̮i̳̭̞̲̩ͅf̭̪̙̮̠̲͎(̲͕̩͚͙A̤̰̜̩̖̼͠rr̡̙͎̳a̡̰̜͙y̨̯̪̻͇̟̯̖.́i̮͙̞s̶̲Ar̩̤͙͢r̷a͇͇̦̤y̥̺(̰̠͓̜̳͇̙t͏)͍̞̦̯͔́)̖ {
                                        ̡̖͚̝f͙o͉̹̖̤̭͚̫r̟͔̺̱͘(̵̻̯͖͔r͕ = ͝R̞͉̼e̳̼͠(͎̰̖e̬̤)͙͇̤̼͚͈̘͜, ̞̘̹̥̲i͔̼̤̣̬̱͝ = ̜t.҉͍̥͙̺̭̺l̷͇̫͉͉̬ͅẹ̬̩̥͝n̪̝̤̪̻͎͠g̩t̩̞̪̦͙̠̕h̫̘̪̩̰; ͍̼͔̫͝a͠ < ̱̤̫͇̥̖i͏̦͈͚͔̮͉; ̹ͅa̙̗̝͕͚̩̜͜ + ̦̫̻̠̜̲ + ̼̮̩̠̱̞͇)̣̺̞̠̤̫͈o̧̼̮͓̦͙ͅ[̴͖̹̘͎t̤͈̭͎̫͉̬͟[͎̖̰̯͓͠a͔̝̩̱͉̬]̡͎̬̭͉̭]̮̻̳ = ͓͘S̲͇̤̗͚͍̀.̫̺̠̜͢ͅc͙̤̙͈s̺͈̭͜s̺͕̙̘(̲͉̤̻͉̞ͅe͚͔̰͖͇͢, t̲̥̬[̞̙̺̠̖a͚͓͍͔͔̺]̳̹, ͕̯͢!̩̯͡1͏̣̜̻̟̥̦̱, ͇̱̪͖͕̟͟r̗̞̻̖͉͍͡)̢̖̭;
                                        r̷̭̘̺ȩ̰̘͖̬͖t̹̭͎̞̟̭u̵̜̤r̷̩̦͎̫n̡̺͕ ̙̙̳̯̙͟o҉̺̥̜͍
                                    }
                                    ͇̖̼͈̪̰̱̀r̞͉͎͓͕e̱̺͍̜̫ͅt͔͈u̡̝͓r͢ṉ̮̱̹̬̦͜ ͍̖͍͈̣̙͝v͇o͉̥̼̹̻̺͔i̧̠̞̻͕̪̣̩d͍̬̝ ̩͍̼̘̗͠0̣͉̭̥͖̫!͍͙̫͚̀ = ̨̱̟̗͎̼ = ̳̭̹̱̙̬n̞͉͙̲͙̟̳ ? ͍̱̯͕̘S̯̩͙̩͕̜͈.s̝̠̘ͅt̮̻̜y̖͇̹̣̹̪ḻ̀e͏̙̣̪͓̯̬̯(̢͉͕̪̝͕̙̥ę̺̤̯̺̣̬̳, ̘̭͙͇̮̤t̰͘, ̡̭͔̫̩͉̟n̸͕)̞̪͈̗͠ : ̣̜̜S͖̞̫͇̝͜.̨̥̩̺c͕͍̝̟͇̞s̹̗͎̼͔̗͖s͏(̬̣̖͖̬̹ͅe̞͎̣͔, ̭̮̟ṭ̛̙̜͉͔̘͕)͖̹̤͔̪ͅ
                                }
                                    ̡̜̖͍͕̘ͅ, ̰͎̪͢e͇̫̤, ͖t̻, ̰̦̱̰1̯ < ͞a̸̩̥͙r̢̝g̶̝̘̝̙̙̮u̥̙͔̮̻̭m̡͈̺̭͍̤e̞͔̣̬̫̲n̮͖͚t͇͉̹͜ṣ͙̠̀.̻͖̦̰l͍͇͕̥͍ẹ̼̳͇͔̠̟n̛g̷̺͖̤͎̞t͈̰̫̗̥h̭̺̼̭͕͠)̶͍̘̟̘͕
                            }
                            ̜͇̟̜̱ͅ
                        }
                            ̰̲̟͔̭)͖̹̗̬,
                        ̧̪(̬͈̣̤̲̟(͕͔̟͓͖̭S̱̭̥͚͕̱.̰T̟̞̮w̼̩͇̙̲͚e̜͈͜e͖̥n̨̰̞̬̟̘ = ̢͍̫͇̖̝K̪̻͞e̼̟̣̖͎̝͜)̛̙͔ͅ.͏͎̜͇̙̘̱͚p͚̯̖̬̣̞͜ͅr҉ͅo̗̻̲̹̥̩t̛̪͔͎o̞t͙̮͡y̲̞̥̫̣͍̫p͖͔é̦̮͕͉̟̪̯ = {
                                ̮̟̰̦̪͇c̣̗͉̣͠ͅo̶̼̲̣̦n͟s̯tr͏̱͖̯u̮͎͚̩cț̰͍̟ͅo̲͇̺̙̜̞̹r͍͎̱̀ͅ: ̢̼̟͈K̸͚̺e̴̱͙̳̪͙̬̬,
                                ͜į̭̼̳̮ͅn̨̥̭̹̫i̞͝t̛͓: ̳̣̬̬̖̝͈f̤̱̖̹̰ͅu͖͇̗n̥̪̗͔c̮̰͇͔t̩̟͢i̛̞͇̘̦͇o̧͍͖ṋ̳̳(͇̹͇͍̱e͖̮̺̜̣͝, ̸̻̟͓̺̼͔t͚͟, ̱n̜̟, ̸̭͍͈̠r̭̹͖̟͉͜, ̹̜̺͎͈͕ͅi̞͖̮, ̲̖̜̥o͕͍͍̗̤̬̜)̰̬ {
                                    t̺͘h̀i̩s̼͇̥͙͕.͏̭̦ͅe̖̥͟l͚̮͍̳̞e̮̥͔͚̪̭͡m̪͓͎͙̜ = ̩̲͇̤e,
                                    ̸̞͖t̼̖̜ͅh͢i̯͓̲̖̞s̳̰̥.̹͚̩͍͕pr̵̮͕ͅo͎͔p̩̗͕̲̟̘ = ̝̝̟͕͜ņ,
                                    ͔̕t̝̳̲͇͝h̙͖̬̯͉̭i̷̳s̪͎.͓̜̣͎̣̖͙e͇͈͔̖͎a̛̱͕̥͓͉̻s͙i̹͎͘n̙̭̺̭g̰̠͓̩̥̱̻͡ = ̫̪̖i̻̭̞̬͎̩ | ̢͖͈ | ͚͍́S̷̻͉.̮͉e̜͚̥͈̣a͉̭s̛i̼̣̣̳̹̱n̨g̮̣̞̦̹͟.͍͚̥_̶̙d̘̝ę̰̖͚͓f̱̹̥͓̦̥͢au̜̺̻̜͉̯l͎͞tͅ,
                                    ̧͕͉̹͚̞̻t̛͎̤̼h̤͓̹̤͉̠is͇͙͓̩.̧̝ǫ̻̹̻̬p̖̺͡t̸̘̠i͍͎̰͡o̥̤͜n̖s̸͖͖ = ̷t̲̤͢,
                                    ̩̪͔̤͙̝̳t̝̥͈̻͡ͅh͔͈i͇̯̕s̙̫̩.̟̩̞̙sͅt͔̪̻̫͎̩̲a͔̮͔̣̦̟r̤̜͍͔͚̫t̠ = ̸̫t̀h̖̼ͅi̻̞̹͟s̗̮.̺̹͉͎̯̯ṇ̝̟o̜̦̜̱͚̥͈͠w͔̫̯̹͝ = t͈̱̫̦̟h̗̞̙͓̠̜i̱̪̞̲s̟͕͔͇̬̳.͚c̝͓͔̞̩̱͈͞u͍̤̪͔͔̖͡r̻̥͓͓̭̠()̘̩́,
                                    ̳̘͕t̝͔̹̠͟ͅhi̛̻s̼̖̠̞̖͇.̲̙̱̱e̵̳͕̳̲͕n̦̖͎̳d̶̦̥̜ = ͓͔̜̣̝̠r̤̲̯̝͔,
                                    ̟̩͖̣̺̠̘ţ̲̞̗̻ẖi̠̰s̕.̛͇̭̹͔͓̙̩u̴̹͕̣͙͓ṇ̜͚̼̪i̺̣̫͙ṯ̛͖̙ = ̬̠o͏ | ͇̰̮͈̱͓ | ̲͞(̺̕S͇.̠̤̙̭̹̺c̞̳̖̱͈s͚̯s̼̺̩N͚̝͓̱̜u̷m͎̰̹b̷͍̭̦̰̬e̡͚̪̺̮r̷̟̪[n̻͓̳̤̞͖͡]̣̭͈̠̖̀ ? ̵̣̺͉ "̀" ͉̙͓̠̕ͅ : ͏͉̜̱ "͚̻͚̭̝̪̠͠px̖̀" ̻̲)̦͉
                                }
                                ͈̰,
                                ̷c̝̭ưr̹̟: ̳̘̼f͙̜̹͎̤͕ų̯n̹͖͖c̪t̸̤̞i҉ǫ̻̗̙̮n̞̲̯͕͖̪(̰͉͟)͕̻̦ {
                                    ̫̲̪͔͎̼vá̜̱̭͉r̭̻̤ ̜͇e̜̞͜ = ͈͚K͏̪̞̺̙e̼̩̯̣̭̜.̴p͎̘̝̦̩r̡̰̫o̢̤p͍͍̱̣̻̞̲H̫͖̱̗̙͠ơó̪̞̗̼̳k̰͖s̲͕ͅ[̵̥̪͇̣t͈̠͘h̴̝͉̖̭i̹̙͓̝̟̤s͈̻̣̦̙̫̗.p̱̹̱̦̰̘r̞̩͞ó̦͈p̪̬̯͘]͇̞̯̣̠͞;
                                    ̝̮̹̱͇̰͙͢rę̳͚̠̼t̡̖͙̟̥̘u̼̯͟r͕̖͇̱̲n͚ ̖̠̬͔̺̹e͚̙̙̠͜ & ͏̰̼̗ & ͖̬̭͕͝ḙ̜̹̦.͏̝͕̱ͅg̼̦̠̩̻͉͜e͙͝t̫̪̯̟̻̙̹͜ ? ̫̻̥̳̰e̸͉.̛̠͔̲͍̰g̬͡e͓̻͘ṯ̶͈͓͍(͏͉̪̝̹t̨̥h͈̻̺̯̥̘ͅi̹̖̣͖̪s̥̙͓̫͔͉͝)̻̙͖ : ͈͔̺K̷̪̻͓̘͕e͏ͅ.͇̗̫̠͔͇̻͜p͙͔r̘ǫ͔̗̱̲ͅp̲͎̥̼H̡͙͖͈̞ò͙͕̗ͅo̟̲̪͇̗̭ͅk̫̟͍̜̞͘s̟̲̠̣͉͚̭.̷_͝d̪̘e̞̖̯͍̝̙f͏͇͚͇à̩͍̬ul̗̜̻͡ţ̖.͕͓̻̹͚̀g̙̥̳͚e͔̱̯͕̤t(̣͇̟̺̗͓t͎͕͚̜h͎̹͉̣i̡̝̺̤͇̤̗s̡̘̤͚)̬̳̥̠̞̠
                                }
                                ͕̦̘̜̹̟,
                                ́r҉̪̗͈u̹̱̝n̻͔̳͚̕: ̯̗̗̗͞ͅf̬̟̤̮͚̯̲͞u̪̞̭͎̻͈ͅn̬͇̘̘͘c̺͉̭̖ti͚̪̬̲͘o͞ͅn̯̘̱͉̠ͅ(͏͓e͝)͟ {
                                    v̛̖̭ar̭̭͇͎͓ ͍͖̥̮̲t̗,
                                    ̭̖̰̺ń̲̝͚̣̗ = ̤̞͇̣͍́Ke̹̗͖̤̜̪̼.p͓̖̳̻̻̤͠r̲̬̮̻͡ͅo̼̜͈̰p͎͞H̸o̭̗̻o̰̖͔͘k̗̱̝͍͖͕s͍[̪͟t̻h̸̬͉̖i̧̗̞̩̠̘̭s̫͡.̹̤̩̞̗͓̲p̶̫̠̻̘ŗ̺̳ò̮̱p͘]̮̻̘̖̟͢;
                                    ̨͓̝͎̞ṛ̣̬͓̳̣͉et̟̫̬u̦rn̯̰̪̠̮̜ ̗͉̮͕̤ţ̩h̯̪̜i̸̲̯̼̮̱̦̣s̩̪͙̣̥.͏̞̝̣͓̳̰o̞̯͎͜p̘͇̫͇t͎͕͉i̱͔͙̖̳͉̻o͏̘̮͍ṇ̶̥̥̖̙̹s̻̰͇̪̖͍.̠̱̫͓̘̱͚͘d̯u̺̙̲͝r̕a̙̪͖͢t͔̝̞̹͔̳̙ḭ̜̯̻̯̖̱͠ǫ͈̭͈ǹ͙͓ ? ̤̹͜t̡̗̟͕h҉i̱̩͜s.̟p̦̬͎͎o̼̜̠s̴̬̦͍̦ͅ = ͇̙͎̥t͕͇̯ = ̹S.̢e̢͎͓͓̞͓̫a͓͠s͔̰̀i͏ǹ̹͇̪g͓̦̪͎̼[͕͇͉̝͇̫͉t̙͖͈̜͘ͅh͇̰͈͙̖i̙ś̹̥͔̩͔̥̯.̩̠͓͕e͜a̗͕̮̮̥s̭̮̥i̴͉͈͈͈͖͚̣ng͔̙̙̘]̙͓̠̀(̙̣̞̜̼e̳͇̥̹̖͚͠, ̜͎̥͘t̗h͖̯̳̩͘i̗͙͚̜̣͙͟ş̣̲͓̫̪̤ͅ.͕̲́o̻͍̹̱ͅp͇̼t̶͚͖̮̻ͅị̮̜͓͍̠̀o̬͔̬̘̬̠͢ͅn̢̟s̷̟̤̲̫̻̻.̶̫͍͙͔d̤̹u҉̭̼r͉̀at͙͚̳̳̤͢i̟̭͈̜͡o̲̙̮̜̻n͇̤͕͈̼̼ * ͏͕̘̗͙̲̥e͚̰, ̯̬͍̹0̤̣͓̹͙͘, ̛͓͔̝̖1̯, ͈̼̤͞thi̸͓s̩̤̯͙̫.̵̼̪͔̮̬̣̬o̢͉̭̫͎͎̖ͅp̬͓͈ţ͎̱̫ͅi̜͜o̯͇̪̞ͅn͉͟s̤̣̫.̻̤̫͖͓͕d̘̪͈̜͜ụ̪̦̹͡r̭͍a̠̥̩͞t҉̯͚̙i̫͡ǫ̩n)҉̪̤̫̣͖͎̼ : ̤̯͕̣t̡̞̱h҉͇̗̫is̹̫̪̖̜.̨̜̞͕̰p͚̪̺o͏͔̣̗ͅs̰ = ̦̻͔̪t̘͓͖̣̟͟ = ̞̩͇̹e,
                                    ͙̩̬̣̼̻t͔͇̤̮̯hi̹s̪̺̮͎̭̺̘.͕͕n̯̜͈̠͡o̠̮͟w̟͍ͅ = ̝̯ͅ(͔̰͝t̨͈͙̘̻h̻̟̠̮̠i̺̞̰̮̕ͅs҉̲̳̘.҉̰e̕n̰d̯̱̟̮̼͉̕ - ̫̫̘͖̲̦͝t̝͇͘h͔̙̘̗̘͟i̮s͢.̯͈̺͈̻̘̻s̵̻͚͉͉͎̖t̘̯͓̗̭̗ͅạ̭̤r̫̘t͖̥̤̭̘͟)̣̪̝͇͖̝͈́ * ̤͇͔t͎̙͟ + ̵̣̖t̮͔͖̰̗͡ͅh͏̪̣̞̺̗̳i͉͇̦͜s.̀s̗͖̰̲͉͚͝ta͓̰̻͇̱̮r͡t̷̤͇̫͉̬̱̤,
                                    ̳̲͍̫͇̙̫t͉͔̳h͈̙͘i̛̱̯̖̰ͅs̠͓͈͚͎̺͈.̳̠͙͇̦ó͉p͙͖̯͇t̜̺̪i͉͠o̵̻͉̝̝n̴͔̗̝͍s̛.͙̺̪̦̟ͅs̰̦͖̦̭͎̬ţ͓̱̟ę̙͈̞p̠͙̠͕̙ & ̸̬͙̳ͅ & ̣t̹͎h̘͓̪̀i͓̖̙̻̥̺̣s҉͎̯̫͍̣̖ͅ.̳̼̣̼͡o̸̜̭̘p͚̙̗̠̠t̪͈̥̀i̭͔͈̰̺͈o͇̺͔͎̤͈ns̢.̙s͕͘t̪͙͝e͍͙̼̣͜p̸͈͇̠̫̗̲̣.̱̙̮͟ͅć̞̪a̟̣͔l̸͕̲̠͈̘͚͉l͖͙̝̯̞̟͉(̢̪̬̤̥ṭ̜̮̺̰̹͓h̢͎̳̬̲̯̰i̥̼̣͕̱s͉͔̺ͅ.͓̬̗̼͎ͅe̬̖l͏̲̞̯͉̻̤͍e̯m̖̫̺, ̞̯̻͚̭̩̪͠t́ḩ͍i͈̯̣̭͓s̨.̘͡n̝o̟̰̬̩̦͟w̷ͅ, ̟t͕̮͉̝̙̘̝̕h͎͓̼͕̝̘ͅi̵̩͈s̘̝̮)̡͙,
                                    ̷̳̦̬͕̰̯̝ņ̫ & ̹͓̦̻̝̼ & ̪̪͍͇n̝͕.̹͙̳͓̹͇șe͈t̟̀ ? ̶̱͚̠͓̙̮͈ǹ̲̼͙̝̫.͍͡s̳̩̭̝͉̥ͅé̝̗̰ͅt̠̙̣̙̬(̛ţ̲̫͔̺ͅh͙̹͓i̳̥̣̤͇̻̫s͚̝̼͡)̩͍̩̘̀ : ̷̯̼K҉͉e̮̜͞.̻̱͉͓p͏͖̳̦̰̝̱͖r̪͙͙̟̳̩ͅo͈͔͈͇͈p̥̦͇͝H͉̦̝o̺͉̲̣̭̠̹̕o͙̟̖̰͎̱̝͠k̝͚͈̖̝͇̠̕ş͚̯͉̼̼̘̜.̝͞_̭̫̯̰̘ḓ̼̱̹̘͝e̱̱̺̻͘f͚̰͉a̬̙͉̰u̶l̯̘̣͕͟t̜̭̼.̛̫͍s͍̘̦̥͖e̲̼̕t̷͈͈̘͖̬(̞͎͟t͜h͓̣͍̮̱͔ͅi̘̱̬͔s̹)̦͎͙͍̬,
                                    ̭͚͓͉̠̬͙͡t̮̜͔̱̙̠͇͞h̻̮̖͟i͖͔̳̹͓̕s͔̦̟͇̣
                                }
                                ̮̪͇͇
                            }
                            ̫).̤̦̠͈̦͜in̶͙̰̭̣ḭ̲̞̫̝̻̻t͙̮̣̬̪ͅ.̺̹͉͚̖p͚̘͙͙̜̗ͅr҉͉o̮͖̟͇͇͍ͅto̡̞̫̹̤̬̗ͅt̙͕̳̹yp̨̖e̢̟̥̞̯̞̖̭ = ͍̭̣̮̘̙̭K̥̺̘̝͕͚ͅe̹͖.̗͔̝̖̹p͟r͇̗̫̠͠o̜̞̱̼͈t̺̹͓̰̼͚̲o͙̬̕t̙̝̖̮̯͔̥ý͚̹̣̺̭̘pe҉̘,
                        ̯͍̯͕̦̱̖(̦̞̼̩͔̣͠K̡è̫̝.͝p͍̺͍̣͜r̶̥̦̩ͅo̜̳͚͇̣͎̥p̶̗̭H͕͖̙̱͈o̺̦͈̪̖͝ó͙̼͎̭̙̖̪k̻̝̺̭͢s̷̲ = ͎̳̻͉ {
                                ̳̠̱͖͔̳͉͡_̬̙͟d̤è̠͔f͎̮͙ạ̟̰̪̝͈͉u̬l̪͈͇͕͘t̘̪̙̩͔̼: ̧ {
                                    ͙͙̞̤͇̰̦g̘͖̮̰̠̞͓e̼̖t: ̰̱͎͈f͍̗̹͚̗̟͠u̘̲̤̦̫̖͉ņ̪̞͍c̥̲̗ṱͅi͕̖̙̘͚̥o̙̣̱̱͈͎͞n͈͈̗̞(e̢̱̲) {
                                        ̗͚̹̘v̥̙̥ͅa̰̺̳r̯̘̯̤͔̫̀ ̯͚̫͖t͍̳͇͚̯́ͅ;
                                        ̝̬r̤̙̯͈̜̀e̴̘̥͈ț͎̟͖̞̥u̸̜̹̦͖͙͇r͙͉̖̬ṉ ̲̳͍̲̙͞1̻̰͔͠!̮̟̦̥̺ = ̞̜̭̙ = ̨̟̠̘̞̖̯̫ẹ̬͝.̝̪̣̰̭̮e̶̮̦̟̮͓l̦͜e̖m̷̰.̶͔̠̲̞n̨̝̞͇͎̮od̢̪̗͙̼̣̘e͖̘̰͉T̨͔̝͇̟̻̥͉y͜p͓e̸ || ̸̖n̳̠u̯̖͓̤͉̘ll̟̫̣!̴̰ = ̘̻̩ę̳.̫͓̖̣e҉͍̝̯̗͕ḻ̛͔͕͍̦̤e̝̝̳̯̫͇m҉̣͚̹͇̞[͓̲̠̙̮͔̳e̷̫͙.̵̭͖p͔͟r̳o̙̝̱͈͟p̞̖͖]́ & ̻̻̖̜̖̪͍ & ̜̝̟͡ͅn͙ͅu͉͔̰̤͕͞l̡̙͚l̸̟̪ͅ = ̯͓̼͈ = ͉̫͜e̸͈̟̭.e̝̹̗l͏͚̲̺͍e̝͕͈͝m͖̯̠.͎͙̮̣̤̬s̵̟t̡͚̩y̛̹̯̖̻l͕̞̘͉̖e̹̟̜̝[̙e̺͉.͍̤͉͔̹̻p̸͚͍r͉̦͔͚̮͔op̬͓͙̪͡]̯̜̘͖ ? ͚͎̬̝̬͡ͅe͕͕͙̰̞̟.́e̘̘̦̹̜͓l̮̞̝̪̬͍̣ḙ̡̥͙̺͔͙m̢͎[̱̝̘e͉̻͙͕̺.pr̝̗̞̰͔o͈̼̫̪͍̙̦p̜̠͓͕͞]̩̘͔͎ : ͈̱͖(̖̲͖͕̥̹͢t̤̦̺̹̕ = ͕̰͔̬̮̪̬͝S̝.̺̫̻͕̳̮̺c̰͖̥̳̬̜̀s̢̰͍͓̰̤s̸͇(̯͠é͓̥ͅ.̨͚̦̲͈̝̯̙e̢l̩e̲̳̣͍̹͠m̟̤͠, ̵̦̻̦̹̬e̟̳͖̞̠̰̤.̴̻̱̯p̶̳̤̳̫r̖͖̩̝̥̮o̠̻͈̕p̫̠̣̻̭̩̼, ̶̺̯̗͈̮̪̭ "̹̫͡")̙͝)̺̺͇̫̼ & ͍̤̥ & ̛̥͉̭͍̯ "̵̻̣a̢̜̣̝̭u͈̩t̤͍̟͍o͖̱" ̩̺̳!҉ = ͚ͅ = ͙̪̀t̡̪ ? ̵t̴͇̳̱̳ : ̵̬̜ͅ0͚̥̖̥͎
                                    }
                                    ̘̤͈̳̖͎̝,
                                    ̱s̀eṯ̰͖̗: f̪̻͖͕u͈̩̣͚͓nc͜t̠̬́i͕̻͔ọ̢̮͚͕͕̹ͅn̴͎͈̗̣̬̝̠(͉è)̜̮̩̺̤͚ {
                                        ̠̬Ṣ̩̹.̬͎̭̪̟̞̯͢f̳͍̥x̹̙̱̠̣.̝͈̗̣̯͈̞s͈̰̖̲ͅt͜e̪̪͈̜̟͍͟ͅp̜͇[̝e͔̩͇͡.̞p̢̫̣̘͇ŕ̘̹͙̞̺̲̲o̠͟p͎͓̼͇͉̮ͅ]̮͙ ? ̦S̰͕͜.͚̺̮͜f̼̭̱̖͖̥̫x͖̘̫.̷s̘͕̞̫̖̰̩͟t̶̥̮̱͖̮e̠̼̠̼͍̭͘p̟[̶͎͈e̦͓̯.̵̤͖̣p͏̝̝̺͔̱̤͙r̛̳̼̞̥̙o̦̞p̷̣͇͚̣͎](̣̫̥̥̰̤̬͟e̩͎̳͕̣̙̳)̭̳͙̰ : ̨͉1͎!̟̠̠̬͕͍͖ = ̷̲̞ = e̟.e̼̞͈̲͍̞̕l̢̳̠̙͇̩̭̜e͖̜̭̥̜̯ͅm̧.̘̗͘n͔̖̳o̧͔͈͈̗d̴̻͓̝̝͉̬͓e͏̬̟̦̳͎̫̯T̲̣̮̳ͅy̻̱̝p̙̬̫͇e͖̤̟̭̗ | ̺̰ | ͏̘̲̥̜͓̲!̼͠S̭̘.̖̞̩̠͎̮͉c̟̺s͈̝s̞͙͉̖̭͉͡Ḥ̨̥̗͚̯͉̭o͖͚̼͓̼͎o̖͇k̼s̪͕͓[̶͕e͘.̴̟̪̯̤ṕ̯̺r̦͈̻̱͍̣͖͠o͈̪̣̬͕̺͞p̬̮̪̘]̼̤̰͕͟ & ̡͔̰̼̥͇̫͔ & ̸͖̝̘̺n̖̘̠̰̮̟̯ù̝͉͇̠̦̫ͅl̛̝̪͕̖̯͔l̪̣̙̞͚̖ͅ = ̮̪̼͖͚̱͇͢ = ̱̬̺̦̫͡e҉̘.̷̳͍̺̬̜e̙͔͜l̢͉͉e̲͚̪͎m̜̱̼̫̭͚̲.͕̹̩̘̰s̵̞̱͕͍̞̝ṭy҉̦̬̦͚l҉͓͈̺̫̣̳e̮̖͇[̵̞͔̱̺̲̜̗ź̩̮̼͚̟e̻̬̻̦(̰e̻͉.̮̞͍͍̝̦̀p̦̬r̲͍͇̩̱͟o̮͈͎p͈̠͟)̤̜͖̘̘̼̀]̻͚̭͚͡ ? ̴͙͕͈̪̺e̛̦.̴̪̖͖͕el͏̘e̸͍̩̭̜̦̞ͅm̬͈̥͔̺͓̟͞[̳ḛ͚.͝p̞̙̯͚̺r͏̮̰o͏͓̜̮p̴̯̜]͍͔͍ = ̙͙̫̬͕͢e̕.̺̳̩͜n̘̠͕o̮̳͝w̹͈̳̙̣̫ : ͖̩̯͓͍S̺̖̦͙̜̀.̟͉ṣ͇̞̪̖̭́t͓̝͖̣̥̪ͅy̯̰͍̭̘̠l̢͖̘̞̝͕e̫̜̜(̴e̻̞̞͞.͖͔e̬͈̝̟̯l̴̬͎̥̖͈͖e̦̞͚̺͖̬m̴̞, ͕̳̺̹e͔̣̜̪̹̕.̻p̼̭̯͖r̸͔̠͇o͙̺͔p̣̲̼̜͎͕, ͎͔̳͉̗͘ͅe̖͙̥̰̦.̻̼n̢͚̳̩̝ǫ̼̮̝̤͍̻̼w̨͉͔̲͕ + ͎͍̗e̡͓.͈̲̝͖̗̭͠u̙͓͎̭n̵͇̝̜̘͉í̳̗̩͍t̸̪̲͔͈)̶̬̫
                                    }
                                }
                                ̹
                            }
                            ̰͚̺̖͘ͅ)̛̦̤̮.̛̩̘s͕̮͈̟͚͈͟c̵͕͙͚̙̼r͏͈̝̟̭o̖̟̯̭ͅḷ̡͕̬̱͙l̴̳To̱̯̼̠͇͈͝ͅp̪ͅ = ̴̼̭K̝͈̣̫e͙ͅ.͈̲͎͎͢p҉̜͈̗̩̹̲̗r̲̬͕o̶̫̯̠̜̹̰̳pH̟̹͚͇͡ò̩̖̯̩o҉͖k̳̘͇̞͍s̠̩͔͉̲.̢͎͔̭ͅś̺͕̳c̷͙̩͉͇ͅͅŗ̞o̦̬̼͎͞l̖͍̪̺̙̦̜l҉͙̞L̗͖̘̼͈͢e͖͖̪̲͍̝͠f̟̯͓̫̝̤̖́t = ͖̟̹ͅ {
                            ̟͎͉̺̭̀s̗͉̀e̳̭̤t̫̰͕̟̮͙͈͟: ̖̘̳̥̖͙̱͝f͏̮͉u͍͙͈͡n̰̺̤͞c̰̹̦̼̥t̖͇̹i͕͓̯͍o̶̻̯̫͔͈͙n͎͎͉̙(̣̹̳ͅe̟̜͓͚͢)̛͙͉͍͍̬ {
                                ͍͔e̷̻̺̳.̵̬ͅẹ͙͓̣͜l̹̼̺͉̟̣̝͝e̙͓͉͙͙m͜.̭̜͡n̞͇̰̠̦̙͡o͚̣̱̩̹d̨̪̠̥̬e҉̘̠T͎̮̣͎̳͉y̖p̢͉͚̬̣͚̝̮é && ̸̖̜e̪̜͈͚.̳̠̰̼̫̠͜ͅe̞̳͟l͎e̦̖̻͓͔m̶.̟̖̘̮͝p̻͈̪̻̝ar̠̹̕e̹̤̠̩̱nt͚̱̲N̰̖͚̟̻͔͝ͅo̠͇̥̘͕̰ḓ̮̯͢e̯ & ̘͚̼̗̼ & ̰(̲͓ͅe̹̲͟.͎e̪͖̝͙̲̫̖l̨ḛ͕̭̘͈̹̺̀m͎̲̮[̧̻̻̗̳ͅe͕̗.͍̩̠̳̙p͇͔̰̭͝r̪̖̕ọ̤͚͍̩p͇̜͇̗̳̙͠]̢̭̤̯͈̠ = ̴͎͇̫͎̘̻̠e̡̯̝̞.̩̫n̬̙̝̼͓͎͈o͇̗͙͓̝w̥̱)̡̼̳̜̦̪͉ͅ
                            }
                            ͠
                        }
                        ̻͠,
                        ̸̪̫S̭̝̰̜.̵ea҉̹s̵̳i̸͙͇͔̟̳͚̪ǹ̖g̸̲̥̣ = ̘̮̪̠̬̯ {
                            ̙̮̮̝͔͎l͙̰i͚͇͚͘n̤͔͉͖͈̭̕ͅe͞àr͎̬̣̜̪͍: ̯͉f͘u͍͚̕n͙͕̮͙͎c̯̜̠̯͉t̩͚̺i̹̜o͖̭̟̦ͅn̗̤͈͕(̀e̲͎͎̘̖)̡̥̗̬͇̥ {
                                ̜͈͉̙̩͙r̻͠è̟̤̞t̳̱̦̠̬͟u͏͓͙͓̩r̰͕̗̭̞n͕̲̙͔͟ ͡ẹ̣͎̜
                            }
                            ҉,
                            ̩̙̜͓͍͔s͓͖wi̟̜̹͕̦n̡g̵̣͈̰: ̼̝͙͕̀f͏̹͙̞uṉ̛c̻̪͉̩̼̮̗t͖͚̥̘ͅi̡̠̻o͕̲͚̤̗̭n̙̖͇͙̺(͍͍̀e̥)̣͓̞ {
                                ̨ṛ̺e̟͙̩̣͡t̵͇̠̜u̬̰͇͉̲̬̮͟r̡͓̫̩͈̙̞̝n҉͇̰̯͚̱.̫͓͔̞͔5̳͖͟ - ͜M͏a̯̟͍̫t̫͞h̯̱̲.̨̘̳̱̺͎̯̦ç͙͉͍o̯̲̖s̳̬̫̜̘̀(̼̞͔͉͘ͅe͉͇ * ̙̞̹M̭͇͕̘̳̞͜ͅa͙̟̲̱t͇͓̭̗͔̝͘h͎̥̳̜̪̺͖.̦́P̧̺̩̯̻I̮̦͖̮͞)̮̰̝̼̝ / ̫̪͎2̙͚
                            },
                            ̬̺_̝̪͇̞̬͍d̗̞̤̮̭̤ͅe̶͔̙̩̳̤f͈͈͍͝a̲̤u̫̭̳̬̠̝l̘͕̠̗̳̼͘t̘͈̯̜̝̙: ͖̮̩͇́ "̣͉s͈̱̻̙͓w̜͍̼͉͕̥͕in̮̖g̼̭" ̮̹͚̻̯̼͢ͅ
                        }
                        ̺̮̟̣͚͖,
                        ̶̗͉̼̮̖͚̜S͎̪̹.͍̟̲f̹̲͚̪͕̠x̼̫̘̜̫͠ = ͍̤̮̻̮̭͡K͙̼͔̠̩̻e̹̱̻͉.p̱͙̬̮̟̙rͅo̳̻̭̣̜̯̻t̠͎ơ͖͙̱t̸̫̯̥y̞̭p̡͚̪e̬̫.̲̣̣̲̣i̢̜̺ni͕̻t̼,
                        S̝̣̺̼.̩ͅf͎̥͓x̪̻ͅ.s҉̥t͕͙̗͖̩͖̠ep̠̯̺ = ͜ {
                            ̞̙́
                        }
                        ̳̭̹̫̼͕͞;
                        ̳̯̲̪ͅv͏̬̥̞̭a͎̞̮r̲̳͙̯̰͙ ̛̖Z҉̰e͙͙̪͞,
                        ̝͉̩e̛̲t̛̳,
                        ̷͖̪͓t̠͙̬̙̦̹͝ͅt,
                        ̰̘͓̦̻ǹ͎̬̘̬͚͚͔t̯͍̣̟̳̘̳͜,
                        ̞͚̮̦̮ͅr̟̣͎̹̭͡t̵͚̰̲ = ͔ / ͎ͅ ^ (̟̠̻ͅ ? ̧ : ͖͉͕͕̝̼́ṱ̲o̢͇g̦̘̱g̹̞͉l̙̗̝͜e̼ | ̺̀s̳̟̭͎̕h̖͚̳͓̩o̰͞w̺̰̗̫͚͎ͅ | ̫͍̪̬h͓̙̩̙̣i̢̳̱̝ͅde̪̼̳)̼̝̼͉͚͙͙$̼̝̭̰͖͚̙̀ / ̴͓̖̣̱̖̫,
                        i͈̫t̵̳̙ = ̻͉̠͚͔̣̙ / ̞̳̺q͘u͝e̢͍̻̝̥͓͚u̷͖͕͙̠e͍͎͓̯̼̩H̯̝̹͖̹͙͚͝o̫̺̠o̱̥̩̠͟ḵ̼͇̯̥s̮̹̹$͚̮ / ͖̤̱̼͠;
                        ̣͍̤̲̟f̮u͎̼͔n̦c̪t̗̯̗̕i̶̙͔̜̜̙on͘ ̘̫̦̮͇͖o͚t̻̤̼ͅ(҉̪̤̟ͅ)̥̞̩͙ {
                            ę̣̜̫͙͓t̺̼̙̣̞̀ & ̰̫̩͔̝̤̥͡ & ̡̟̭(҉͎͔̝!̵1̮͔̺̯͚̠͠ = ̸͓̯̟̩̪̮̬ = ̞̫̘͘ͅ = E̹̠̥.̱ḩ̩͍̖̝i̠͍̝̯͚̺̜d̀ḑ̺̱̮̗̬̜̮ḛ̦̹̹̻̘n̰̪̬͍͎͈ & ̻̜̦̀ͅ & ͔̣C̢͈̫͉.͔͖͍̯͓́ͅr̳̖̱̩̲é̖̫͚̰̳q̦̫̟̩u̷̮͈̝̟̪e̩̜̞̹͕͜s͚̳̙̪t̼̦̱̫̮̭An͚i̺͘ṃ̪͙a̴̭̹͙̞̣t̺̥̬͓̲͔̪͘i̺̲̬͔̳on͕͚̼̬̹̻͓F̨͓̘̯̗̭̼̗r͔a̷̮͇̟̞m͜e͍̩̻̘̝̟ ? ̭̥̳C̢͍͍͈̰.̸̗̫̝̻̥ͅŕ̥̘̣̬èq͍̩̞̱̣̣͖̕u̦̺̦̟̯̬e̱̼̳͓s̯̜͜t̸A̳ņ͙̪̳͔̲̩̰i͔̻̱m̛̬̦̪̣̼̠͈at̛i͉̠̙̦̯̩ó͎͍̜̯̪n̷̙̗̘Fr͉̰̥͍̭ą̺͎m͓e(̷̗̤̝͇̦̱͇o͕ţ̹͙͓̥̬̯̩)̛ : ̜C͘.͔͈͉͕̜͡s͢e̡t̞͈̰̹Ṯ͙̞̱i̶͕̜̖͈m̻̝e̡̺͙o̢̭͖̰u̗͇͎ṯ̙̦̖͓̖̲͢(̖͔̥͉̯̗̹o̦̙̤t̰̮̞̗͞, ̦̻͖͉̗̜͔S̴.͖̫f́x̨̪.͉͖̭̪̥́ḭ͖̺͓̣̮͓n̡̟̳t͉̮͈̰̟ͅe͢r̳̖̪̠͔v̳̼̟͓̠a͔̰͉̙l͔͖̠͔͢)͖̹̝̙̕, ̼͍͍͝S̴͚.̰̺̟̠͚̪̕f̹̱͖̲͖͚͝x͚͙.̠͕̜͎̲̙̰ti͕͉͖̼c̖̳ͅk̶̗̦͔̲̟̫̹(̧̞͍̪̥̲)̸̩͔̳̟̯̠̬)̠̱̣̪ͅ
                        }
                        ̧f̸u͏͕͙͖͕͓n̳̖̣̬c̳̮͙t̛͉̪̝͔iòn̡͈͇̮̤ ̳a̢̠͙̫t̥͚̥̪̣̜(͉̝̠ͅ)̥̳̳̣̰ {
                            ̶̣͖͖͙̩͖̱r̷̙͎̜etu͞r̴͇̟͓̲ṉ̪͍̜̮̫ ̀C͉̝̝̲̦̱͚.͎̻͇͉̺̫̯se͢ṱ͍T̜̹i̠̙̙m͕̘͈̣̕e̫̮͢ou̠̯t̴͚̞̪͎(̻̥̪f̼̞͎͉͍͖u̖͈͕͔̱͙̥͜nc̞̜̲̟̰͖ti̶̬̖̞̫ͅo͝ņ̳(̞̪̺̭̟)̻̯͎͈͓͖ {
                                ͟Z̗͍͜e͇͍͎̻̝̳͟ = ̨̤̘̩͙͓̖̼v͕͚̙̮o̹̭̖̠͚͍̜i̡̖͍̥d͏̮ ̬͉͍̗̬ͅ0̡̯͓̠̖̼
                            }
                                ̸̺͖)̹͍̟̺͚̭,
                            ͇͕͉̖̭Z̷e̹̘͎̕ = ͇͙̖ͅͅDa̤̺̱͇̟̤te͇̺̲.̢͚͈̲̰̩n̝̪o̖̱͕w͈(͇̼̖̪͍)͖͘
                        }
                        ̞̟̰͇͔f̞̰̼̯̞͈u̡̘̪̯͉̪n̡c͢ṭ̵̭̟i͍̲͡on̴̦ ̙s̲͜t͏̦̠(͎̯̙͇e̝, ̞͞ͅͅt͙̳͔͕) {
                            v̻̞̗̥̭̖̦a͏̻r̺̭̹̱͕͉͟ ̲̱n̼,
                            ͙r̞̤̜̜̥̟ = ̖0̘̱,
                            ̩̼̦͕i͏͚̹͕ = ̶̪ {
                                ̡͈̦̲͚̯̹ͅh̖͝e͏̖̼͎̥͔̬̖i҉͈̫̻͔͔g͙̯̘͚͓̖͡ͅh̨͕̺̱t̟̺: ̰̭͍͔̠̠̕e͖͍͕̬̣
                            }
                            ͍̰͇͚̺́;
                            ҉̟̱̻͔͎f͕͙̲̰͕̦̭͠o̺͓͈̬͞r͓͇̜̳(̛t̫̞͙͎̳̖ = ̞̝͖͍̰̪ṯ̙̕ ? ͖͖̹͙̬1͚ : ̹̺͕0̧͓͚; ̙r̯̦̩̤͢ < ̦4̦̭̬̯̭͢; ̱͚̩̻̀r͝ + ̩̝̝̩̗͉ͅ = ͖̺̲̯̹̥͝2̡̤̙ - ͕̯ț̷̻̜̖̬͓)̝͔̺͕͚̩i̺̯̣͓͔̣[̺̙̠͔͞ "̨̤̝̱̼͚m̻̱̱á̟̪̰̘r̗̖̺g҉͍̲̣i̗̘̟̹ǹ̬̩͈" ̺̤̳̘̠͚͠ + ̥͈̼̙̹̘ͅ(n͕̦ = ͙̤̯̬̮n̴̮͈̥̟͙ͅe̼̠͟[̰̬̕ṟ͢]̮̮̜̖̬͓)̵̺̮]͔̤͇̣̬̫̗ = ̧̮̺̗i̝̞̥[̰͓͚͈̘̝ "͔͓̮̱̦̪p͏͕̺̳a̗̲̳͚̹d̰͔̭ͅd̝i̼̹̜̤n͚̳͖̰g͉̭" ͏̭̯̠ + ̴̰͖͓n̖̦̠͡ͅ]̹͈͓ = ̶e̱̠̮;
                            ͏̮̩̼r͔̙̰̫̯̪e̼̦͚͢ͅt͉̱̦͈̞̬̝͘u͎͙͙͎̬̜ṛ͚́n̟͘ͅ ̸̮ͅt͓̬̖ && (͓̙͔̠̤̼̯i̼̟̺.̷͍̹̜̭̲̭o̖͚p͉̞̬̪̪̕a̮̳͖̭̮̞͝ͅc̹͚̺̣̤̗ͅi͔̖̦͙̜̱̺t̨̪͕͈͕̟͎͚y͙̬̜̙̻͜ = ͏̲i͝.͜w̦͔͈͖͘i̜̟͠d͏̘͔̝̥̫t̨͚͕̱h̢͓̩̞̜̭̲ = ͔͖̪͜e)̸̮,
                            ̹͉͚͙i͚̲̪͖̟̩̼
                        }
                        ̧f͚̳̜̺̻u̦̺n̗̱̥͎͜c͈͉̬̖͍̙̰͟ṯ̦̼̳̹̰̫̀i̸̞̦̫̝̻o̟̗̪̟̖͚ͅn̤̗̠̞̤͚ u͉̳ͅt̰̰̥͇(̩̦e, ̟͎̞̯̭̝t̘̤̞, ̸̼̞͔͔̟n̷̺̺)̭ {
                            ̼̩f͓̬̺̬͠o̜͍̪͟r̞̯̰̣̘͢ͅ(̱v͔̝̟̹̕a̢r̭̫͚͇͖͔̺ ̷͓̪͇͉̻r̞̪͓̞͉ͅ, ̧̦ị͈͚̰͚͔͝ = ̶(͓̬l̥̲͡t̠.̣t҉̱̜w̹é̼e̦̞͖͚ͅn͓̱͉̪͔͜e̦͍̹̝̦͝r̨̪̙̲̙͙͎̖s̴̟̮͙͈̳͎̙[͍ṱ̻̞̲̯]̣̱ | ̰̼̪̭ | ̘̭̣ͅ[̟̪̪͚͖͔̝]̜͡)̤͝.̮̣̞̙͔̙͡c̀o̪͕n̗̥ç͇̥̰̮̘a̠͖̭̹͢t̠͍(̵̞͈̭̥̫͔lt̻̯.̷t̞͘ͅw̦͔͙̜̘͔e̲e̫̺̳̟n̢e͍̫͍͍̣ͅr͕̻̮̮͓̲̯͞s̫͉̺[͙͉͔̖̯ "̺*̴͔̠͖̬͇̙" ̱͖̰͓̺̜̝]̫͓͔̙)͚̱͖̻̻, ̠͉͙̘o̠̣͈ = ̡͇̹͈̩͔0, ͙̱̭a̧̹͓̥̙̦͔ = ͎̖̹͞i̪̹̪.l̻̮̪e̢͍̦͓̝̭n̞̩̭ͅg̨̖t̨̫̙̲̻h̗̜̙͈̺͓̩; ̴͔̝͕͚̩ơ̺̠̮ͅ "͡)͎̝͉̬.͍a̪̯t̞t̻͢r̛͕̠̙̼̪(̖͍͍̥n̡.̣̠̺̣s̴̻͕̜̪c̴͈̩̘͉͚r͔͉̮̞i̟͜p̵̦̺̥̱͉̞t̴͕͖Á̯̤͕̭̯̟͔t̵̝̠͔t̳͕̭͙͝r̯͔͈ͅs̨͚̖̪̩|͈̖͍͉̰|͖̫͕͘{̵͖͔̞}̵̝̭̗͇)̗.p̶̫̲͍r͉̺̣̣̼͙̬o҉̙̠̫̜p̟͙̺̦͚̘̰̀(̦̼͢{͓̳́c̢̪̞͔h͍͖̭a̸r̷͔̼̜̹s̳̬̲̖ͅe̙̠̥̹̹t:͚̯̤͚n̳͖̭͉̗̲͞.͕̥ͅs̙͚͔͔͓̲͝c̖̟̣̘̙͟r̢̠i̛̬̩̻̲̗̲p̢̬̺͈̖̩t̜̳C͕h̵̝̻̟ars҉̠̞̝̣͍ȩ̬̗̞͇͈t,̶͈s̢͍̞r̵͎̳͉͎̖c̖̩:̶̰̼͎͍̳ń̘̮͙̟̰̞.̩͓̲͉͚ͅu̮͖̟͞r͔͙͉͍͚̭ͅl̗͖̙͓̮͝}͈͈̹̖͘)̷͔̳̥̤͔͔.̘̯͉͎o̺̮̦n̞͘(͓̪̫͚͘" ̗͍̠̪̤̳̰ĺ͔̟̲͓ọ̝̼͇̲̝a͡d̛̝ ̳͎̟͔͕͈̥ḛ̶̮ŗ̞̱̠̻̳ͅr͍̙̘͎̀o̞̰͇̬̘r̟͚͖͈̳͓̫ "̟̯͚͍,̥̣̝͕ͅi̱̥͡=̧͙̤̮̻͓f̳͍un͓̲̗c҉̳͖͖̲ͅt̳̲̯̺͕i̻͔͎͙͕o̧̳n̼͉̟̻̱̕(͙̹̯̮̝̘e̸̤̜͈͙̼)̞͇{̻̮r̷͇.̴̭̖r̞̩̠͙̮̦̬e͍̲̘̼̦͚ͅm͜ó͎̥̩͓v̯e̲̬̱͎͔͘(̹͠)͏̲,̶̥͇̫̳i̴̫=̧̟̟̫̰̤͖ń̙̭̯u̱̥̤̰ḽl̡̬͎,̷̤̗͍e̡̱̼̗&̶̻̤̹̳̹&̢̘͍t̟͟(̻̟̹" ͇͉͚̬̝̬̪e̲̠̘̜̣̦͜r̻̹͍̦̠͢r͔̼ọ̷̦ṟ͔̭͎̜ "̙̻͟≠̥=̧̗͚̣̬=͙̗̤̗̹̥ͅe͓̭͖̯͜.̝̠t̳̭͕̲̫̝y̱̬̻̬̥p҉͇̥e̡͖͖͓̳̱̲?̗̫4͉̠͈̰̬͚̮0̯͔͟4̣͈͔̩͇̳͠:̠̹̮̥͚2͖̙̫͈̝͚͉0̢̮̤̦̣͔̟0͝,̙̣͓̕e̛̝̬̝̭ͅ.̛̥͓̤̫͎t͏͔̯̗y҉ͅp̱̪͖̗̮̘e)͖̙͔}̪̭̗)҉̫̮͍̙ͅ,͙͖͡E̫͕͟.̫̬̪̯h̖͕̰̱̠̙e̹̩̫̭͈ad.̯̮̺̻̗͉a͇̩̲̮̻p͞p͍̪̙͜e͖͓̞͇n̮̩͕d̵̮̼̰̟͚̩͍C͓͚̬h̛͕͕̣͚i͎̱̦̳̼͓̘l͍͕̘͚̞̩̼ḏ̳̠̬̦͡(̤͔̟͔̜͙͟r̡̟̰͙ͅ[͕̤̜0̤͡]̣̘͍͟)̢}̟͓̝̝̮̩,̖͠a̤̼͚̙̜̺̬b͖̖̬̮̹͡o̞̰͕̮̹̲r̦̮t̼̥̻:̡̞̳̼̮ͅͅf͙̬̦͕̙u̸̪n̬̰͚̹c͎̗̙͎̰̘ṭ̝͖̯̬̤͞i̯̲͈͠o̺̳n̸̘̰̞̥̮(̛͓̻̙͇͈͚̞)͈̭̻̙{̵̲i̯̜̳̙̱̟͠&̷̝̪̟͕͙̝&̫̳̰̦̬͙̭̕i̜̫͍̼̝͡(̧̜)̮̲̦̝̜}͎̟̻̤͖͇ͅ}̕}̨͍͙)̤̹͍̹͈̲͎;̢v͔͖̰͠ạ̻ṟ̢̠͉͔͕ ̨̟͍_̲͚t̟͍͎,͚͈͇̦̯̺́z̲͙ͅt̵͓̬̩̜͉=̖͖̣ͅ[̖͔̞̣]̣͙̗͚́,҉U̹̲̫̲̘̹̕t̬͖͠=̣̹̘̱̘̫͠/̠͝(̫̼̰̘̱̬=̼̜̖)̵̫̻̝͕̝͍\̣̯̫?̡͍͚͍͔͖̝͖(̮̲͓̫̱͜?͕͇̺̞͡=̭&͔̟̪̮͈|̷̟̗̻̳͈̩$͜)̰̤̮̦͖̫̟|͙̼̩̻̜̩\̬̲̦̤͍ͅ?͏\̵̺̲̘̠͙?/̙̲̤͎̼;̹̪̠̰͖͠S̻̪.̬̥̙͚̭͞a͚̥͟j̴a҉̠̩̗͚̦̞͈x͎̼̗̖̠̩Ṣ̬̘̘̻e͚̜͖͖̻ṱu͙͉͚p̣͉̜̱͓͚̪(̘̱̗{̭͉̜͓͇͚̩j͎̬̞s̴̹̞͇onp͈͔͔̫̞:̮̪̼̦̥" ̵͎̬͔̻c̳̘̦̠̘̙̳a̰̭̳̯ļ̖͚l̯b҉͚͔͙̘a̠̯͙͖͢c̨̣̝̥̳̹̮k̬͕̹͘ "̱͓͝,j̧̭so͜np̗̪̬Ć̘̱a҉̖̯l̳͕̙͖͙̮ͅl͖͞bac̫̺͔̳̯k̞͓:͍f̴͕̳̫͔͇ͅuṋ̲͔̠̱̲̦c̬̺͚͍̼ṱ̨̤í̟̦̦o̞n͈͕̺͔̤̲(͖̣͚)͔̠{̭̼̦̺̼̘ͅv͖̼̜͈̗a̩̥̱͚r̮̗̗͚̹͉ ͇̲̼͈̖̳̗e̗̝̘̥̱͙=̡̣͇zt͜.̡̳̜͚̮͖̤p̩̼͈̪ọ͇̥ͅͅp(̧͇̫̞̜͇)̟͙͉̦͈̻|̥̱̤͓͖̼͘|̺͕̲͍̠̹̳͜S̨͍̮̞̺̝̝̣.̼̭̜̣ͅex̲͔̻̝̮͎p͙̲͔̖͍͈a͎̼͉̦̤̬n̲̲̥d̡o̴̬͚̬̮̣̣+̡̱̖" ̡̪_̩̬͙̣̻̻͙͞ "̗̭̮͈̩+͜ẁţ̗͙.g͍̀u͉̳̗̦͟i̳͎̦d̛+̬̗͈͉̳̱̭͘+;̭͕̲͢r̶̹͇e̛͓͖̭t̩̝̠͔͎͔̹u̥ͅr̬n̠ ̷t́ẖ͖i̛̙̭͙̙s̛͕̲̞͕̝̱̝[̸̙̭̹e̡̮̰̬̞͙͍]̲͈̻̳̩̥͓=͇͝!̨̩̲̼̪0͉,̭e̦̗̞̦̺̞͚̕}̫̺̰̰̣̺}̩͉̯͖̻͝ͅ)̫͟,̦̫̞̬͕Ṣ̦̝̺̝̣ͅ.̟̜̬̠̼͉͓a̯̱j̗͔̼̖̗͖͔͜ḁ̱xPr̗̩͟ef̬͈̝i͍̼̣̤̞̥l̷͈̖t̶̪̹̮e҉r̛̺̫̠̜̹̘͕(̴̝̫̦͙̥̞͓" ̨̗͕̻̟j̗̙͙̺̭̳͘s͇̱̻̫͔̭o̥̹̻̦̗̖͍͘n̜̪͉̬͍͍̺ ̻̞̫̤̳̱j̘̦s͠ͅo͔͖͞n̠̘̜͞p̨̙̜̞̙͍ "̛,̥̥͇̩̯̟̼f̵u̼̣n̠̙̣͈͚͝c̯͉͇̤̖t͓̭͙̟̣įo̪ņ̭(̹̠͓ͅͅe͍̻͔̕,̸͈͈̯͈̦͓̞t̬̖̭̰̠͈͘,̛͔͕͓̙̹n̲̻̬͈̞)̢̬̞͎̳̣͈ͅ{̛̬v̲̲̻͉͚͚̜̀a̺̼͖̲̟̠̺r̭ ͖͔̹̥r̷̞͖̤͔,̡͓̟̰̺i͖,̬̝̯̪̥̰o̻̜̦̰,̖̣͓̥̲a͍̙̕≠͎̭!͖̬̦̝̖̦1̝̕!̳͕̟̹͍͝=̵=̞̺̠̩͓ͅe̞̝.̣͕̪͚͓͍͟j̲͚̘s͏̜̟͙̞̭̯ͅo͈ͅn̛̥̖̞͚͕̮̞p̹͚͘&̙͙̬&̢̭̪̜̥͈̼(͔U̸̯͕̬̫̼̰t̫.̥͈͎te̦̯͕͝ͅs̱̹̫̳̜̼͝ṭ̷̝͉̭̣͖̩(̲͇͠ͅe̱͖.̮̖u̯̤r̥̱̀l̲͇͘)̭̜́?̷̘̟͕͙" ͕͉͉u͇̳̗̤͈̤̠͢r̢̙̠̥l̸͍͍̫̙̭͕ "̩:̮̦̝͉̱" ̛͕̦̗̼̱̦s̛͓̲̭̣t̲̮͍̼͟ͅr̖̦͈̩̻i̭͖͎̭͉̼̫ng "̛̖̼̘̣̝̖=̷̟͍̰=t̮̦̦͇͈̙y͝p͉̜̗̣͖̥͞e̡ơ̙̥̺f̡̫̜͍ ̝͉e̸̬̯.̗̳̟̲d͉͍̠̦͟a̼͓̜̤͍̥̹t̲̖̳̞͍͍́a͔̼&̖͍&̨̜̩̥̟̞0͓͇̝̗͖͖̠=͉̺̩͇͍͈̞=̨̲̯=̣͢(̼̮͖̗̪̩̩͞e̵͚̮̘͈̪͚̯.҉͕̭͇c̱̪͙͚̲̦̫o̭̯̩n̮͔t̴e̙͔̫̤ͅͅnt͏̞̩̦͚̼̦̩T̳̰̻̟̥͕͝ͅy̘p̢̖̫̺̠̻̜̱e̪͎͇̞̠̙͘|͍͇͉̭͇|̶̝̼" ̤̮͍̹͓ͅ "̱̥̪̼͜)̳̫̖̳̪̗͙.̨͈̗͙͈͈̮i̦͉n̢̞̫͚̦̼d̶e̖̻̬̭̞x̵̳̪̙̣ͅO̮̞͢f̴̠̖̜̹̼̖(̟͇̮̖̪̟͠ͅ" ̷͔̭ͅap̖̖̤͎͓̮͖p̮̬̲͚̕l͏͈̟̻̣̮̗i̠̯̞c̠̣̻̙a͡ͅti͏͇͙̟o̴͈͙̲n̵̘̟̝̜ͅ / x̮̫ - ̛ww̷̹̫͍̰̺̜ͅw͘ - ̴͓f̛̙̞͓̠o̡͇r͓̭m̴̲̺͔̤̳̞̼ - ̧ụ͕̤͔̲r̴̖̻ļ̤͈̘̼̮̘̻en͏c̲̗o̵d̝̰̻͓̺̭͡e̳̯̝̗̗d̩̭̹̤ "̢̱̱)̶̙͉̹̤̜͔ͅ&̼&̥͖͞U͙̘ţ̣̖ͅ.̩͎̳̻̗́t͖̝̪̝̤͟e҉̼̭̣̻̲śt̤̙͇̝̼̹(̦̲̘̣̪̭e̩̦̼̜̺̘.d̷͈͔̜͇̤̹a҉͖̳̠̤̩̣̭t̨͕a̫̩͈͓̯͟)̖̹͘ͅ&͉͍͢&̦͓͕̯̹" ̖͎̦̝̲ͅda̶͙̰̣̘̞͉ͅt͖̱a̦ ")̡͉̼;̢̗̗̖i̺̬̯͔͖̟f͓̣̟̫͈ͅ(̻̀a̴̼̱̬̳̟|̘|̡̪̻̖" ̮ͅj̫̖̤͞śo̤͓̭̠̘̜͢n̵̤̥̙̺ͅͅp̞̺͍͚ "̣̫͡=͈=̥̘͔͖=͙̠͓͇͟e̙̫͜.̹̲̯̬͈d̳͇ͅa̲͔t̤̜͇͇̩̘a̺͈̱̝̳̦̣͜T̞y͎̼p̸͖e͍̻͖̠͠ͅs̥̯̺[͈̘0̸̟]̲̟)̮̼̣̹̞ͅr̪̼̗̞̦̗̘e͉̭͖̱̖̮͇t̷̖̼̮̖̪ų̤̺̯̤̝r̡̩͙̮̖̘̜̺n ̼r=̪ę̫̟͈͖̤͈̗.̭js͍o͍͚̘̞̠̺̠n̫̥̥p͞C͇͎͔̳̮a͕̟̬̗̗͈̘l҉̝͕̯͔ͅl̗͙̱̦̘ͅb̡͕̳̯a̖̮̭͍̪͍c̱̩̰̞k̢̠̤̩̰=͞ͅm̸̙͈͓͔(ͅe҉͓̯͎.͖̖͖̳̫j̶͓̘̞̬șo̷͓ņp̠͟C̠ͅà̲̯̻͍l̪̠͇̹̱͙̀ḽ̨b̻̖͕͈ͅa̢͇c͖̲̳̪͍͓k͍͇̣̹̩)̜̜̯̳?͠e̫͔̣̫̤͉͍.̮j̀s̻̼͉̣̫͜o̸̖͖̰̞ͅn̦͉p̲̤͈̦̀C̺̬̠͍̹̀a͉̗̠l͎̮͇͓͔̲͡l͚͈̬̗̘͍b̸ac̩̰̺k̴(̰̫͖̠͇̣)̣̰̥͇̱̺̦:̜͔̫̲e̯̱̫̻̥̠̲.̶̪̞̫j͎s̙̼͔̰̠͞o̲̮̞̯n̼̦p͍̦̘͇̭̲̰̀C͎̬͓̮ͅa̱l̷̯͉̩̪̲l̝̼͍̝̞b̴̦a̛c̱̬̥k̞͔͚͉͉͇ͅ,̴̖͚̺͓̣a͏̺̻̬͚?̩͚̼͖̺ͅḛ͉̖̤͝ͅ[͈̭̤̼͜ą̺̪]̟͙̗̝͚=̬̯̠̠̣̹͘e[̫a͍̱̪̫̜͖]̼̼͚̲̭̹͎̕.͚͎͓́r̟̖̣̫e̴̜̣͍̥̠p̗̫͇̘l̙̗̮ͅa̲̞͖͓̺̭͝c̯͚e̙̭͖(҉̳̯̠̘͈̠̥U̖͡t̪̖̪͖̻ͅ,̦" ̮$҉1̟̮ "+̜̟̫r͘)̣́:̖͕̙͖̺͈ͅ!̯͓͖1̪͔̤̥!͇̳͚=̟̩͇=̜̻e̥.͎͝j̺̙͚̼͟ś͙̹o̞n̢̯̼p͔̣ͅͅ&̤̳̣͉̮̼&̬̮̥͖͙͓͠ͅ(͖̺̰̟̩͇̼e͍.u̠̥̟r̰l+͓̯̗͎͈̟=͕̺̮͉̻͙̞(͝T̗̩t.̞t̩̰̤ę̻̹̙͍͍s͕͠t(̵̤̗̝͓e̠̹̻̝.̟̩͕̟u͓̝r̫͈l̼͕͕)?̫̬͎̦̬" ̶̳͖̞̭ & ̴̲̤͇̹̰̝ "͖̦͉͈̲̙̞:̲̫̣" ̳̗̠ ? ̥̝͙̬̬̘̰ "҉̝̲)̺͖̤+̻̖͕͕e̻͚̮̺̖̗͖͡.͏j̛̻̝̮̝s̪̩̠̜̞̝̭͢o̟̣̘̤͎n̵͎̫̻͙̪p̯̰̘͇+͉" ̠̟͙͘ = ͈̼̹͚̻̘̫ "̯̦͙͍͎̝̗+͏̖̙̘̝ͅr̼̫͍͔͝ͅͅ)͓͇̠̟͢,̢͔̥̩e̥̺̲͚.̦̳͚̥͈̖c͖͎͉̭o̙͉ṉv̻͖̰͇̫̖̜͜e̩̦̟r͍̝̜t̝͔͙̮͎́ͅè̼͎r̵s̰͖̬[̧̬̪" ̷͎̗̩͙̪s͖͓̠̖͕͙̝c̰̦̦̥͖̠̗r̛̦̥̙͍̤i̴̯̘̙̗pt̮̤̘͇̭̱ ̘͓j̠s͔̲̙̳͟o̖̮n̢͓̰͈̖ "̩̳̦̘͔͝]̖͇͚͇͓̻̣͝=̢̱̭̫͚ͅf͕̙̥ͅu̧̜͖n̼̜̟̺͍ͅc̨̬̦̟̻̦t̪̞̮̝̜i̵͕̺̺̻͙o̮n̡̜̩͎()̯͔̦̻͕̼͕{͕̪̳͈r̡̜̤e̛t̠u҉̤̖̝̪̘͇̝r͏n̡̗ ͚̬͙̙̝ó͓͚͚̠̬|̖̙̘̭ͅ|̞̰̤͓̭̙Ṣ̼̤͔͞.̳̖ͅe̮̖̻̞̫͍͡r̨r͔͓o͈ŗ̹̲(͇̰̤̭̥̻r̻̟͓̝̖͎+̬̭̪̰͔̲̳͝" ̴̥̫̦ ̼̦͚̯̮̙͓wa̲̟̘ͅs͉ ̘̬̲n̠͚̯̺̮̭͓o͔̺͈̹͔t͏ ͚̭͎c̼̪̙͕̙̫a̙l̨͕͙͔̭̬l̖̳̙̪̭ͅͅed̢ "̙̥͚̮͙̬̟)̥͕͔̺̜͉́,̫́o̶̩̻̘͙[̪̜̕0͟]̺̪̟̗̪̮͞}̸̱͚,̪̫̦͈̲̗̦e̢.̹͍̼͠d̨à͍̘̻t͉͈̞̻͔͍̲a̗͜T̞̖y̧͉̯͈p̪̹e̼̺̙̲͈̣s̺̖̼̟̝̻͢[̝͙̝̟̮̮̻0̥̠̦̩͖]̴͈̝̫͙̣̩͙=̲̠" ͚j̦͎̹͍͉̦͡s̛̹̦͓̳̤o̴ṋ̢̩ "̢̣̰̱̳̭̤,̼̗̙̳̥̮̖i͉=̺C̠̼̞̺[̩̼͎ͅr̲̫͝]̫̩̳͍̫̗̻͢,̮̪͉C̹̤̙̻[̪̟̦̭̙r̦̞̼]̫̟̬͕̲=͇̦f̪͍̞̕ͅụ͙̱̹͇͈n͠ct̪̣̣̞̺ͅi͇̳̞̰̭̪̯o͎̲̱̣̹̼n͔̜͕͎̩͚͜(̧)͓̣̗̻ͅ{̗͎͡ͅo͈=͈a̫͉̠r͔̖͍͍g̴͕̥u̲͎̱͍̺m̬͚͖̺͈͙͎͢e̻͍̙̞̠̯ǹ͍̼̺͍̜͓t͈̬̙̩͍͈s̼̞̖̼̠}̬,͚̘̭̺̭n.̗͖̻̬͉͙͟ͅal̳͖͓͕͉̠̣w̯̬͖̝̹̰̥a̡̰y͔s͏(̠̱̹̼f̨̳̺͕ͅu̠̟̤͚̺͖͘n̳̕ct͏͈͇̳̖̮͎ḭ̜o҉̳̩̺̰̭͖̲n̡̟̻(͖̞̹)҉͎̯̣̣̹{̘̜̖͘v̳̮̯̖͞o̸͈̞̲̭͖ͅͅi͍̰͔̻͔ḑ̗̟͍ ̻̱̣͖̜̬͝0̜̗͞==̖̫͙̹≠í̱̥?͇̣̳̤͈̹S̴̳̰ͅ(̩͙̰̹ͅC̲͓̬̺͝)̫̪̭̫.̹̟̬̯͈̥̘r̵̗͚̬͚̰̞̥e̵͚͍̯̩ͅm̲͟ov̜̣̦̝̦̻̰̕e̛̙̱͇P̴͎r̲͠o͙̬̼̦͔͓͠ṕ͖̥̜̘͍͙̱(̨r͖̬̮)̖͔:C̳͇̠̤[͞r̦͉]͞=̀i̲̭̣̟̱,̰͍e̮̻͕[͎r̜̘͇̟̬̻]̶&&̙̗(e̗.̫͈j̛̩͇̣̜̱s̥o͍̺̼̻̳͚̱n̺̫̥̞͉p̞C͈͞a͕͕̱͔̺͉l͜l̼̫͓̩̤͉̕b̩͉͢ạ̛̙̰̱̬͙͓ck̴̠̮̭̭̼=̩t̷̮̗̝̝̮̦.̱j̱͙̟̻̲s͓͖̪̜̲o͈̜͓͕̦̜͡n̪͈͇͍͘p̷͓C̥͖̱̼̯a̞̱̖̮ͅl͈͝ͅl̫͕̟̬͖̠̖ba̩̜̱̞̙͕̟c̟͙͚̬̪k̵͍̲̝̦͚,z҉̞t̤͎͉.̯̖̖p̙͈͞u͎s̮̭̠͕͔͝h̗̗̜̫̥͕̩(̷͔͉͕͕r͏̦̻̭)͍̗)̰͕,̸͎̙͓̯̱o͚̺̺͟&̡&̻͚m̥(̖͈̟̻͞ͅi̛͍͔̖̻̮)̞͚͎͚̜͘&̖̪́&̰͔̫̝̰̹i̤͉̜̟͍(̣̜͇̝̯͇̜o̵̯̱͉̙͎̤̤[͜0҉͚͚̠̻̤]͍̜̘̥̹̥)̶̙͎,̩̰o̪̰̱̠ͅ=͈͓̠̞̲i̲͉=̱̟̙̕v̲̙̙͍̫ò͈i̷d̢̬͚̬̦̙̣ͅ ̗͙̗̗͎̥̦0͖͙̯̜̯̟̬͝}͔͕)̗̹͟,̪̤͎" ͚̝̣̜́ş̱ͅc̖̖̩̼̼̙̲r̩̤̜̕i͚͚̠̲͡p̷̜̼̪̹̝t̪̀ "})҉͚̘̬̫,̝̱̦y̡̠̦̬͔̫.̰c҉r̘͓̙̰̬e҉͔̖̼͔̫a̳t̞͢e͏̝H͇̱̺̦͢T̸̺̣̯̟̫̱M̯͉̤̩͞Ļ̮̗̗̯ͅD͏̹̮͉̟o̷͚͕̪̖c͕͇͖̻̠u͎͚̠̰̘͠m̟̝̤͍͖̘̜e̛̗̟̪n̪̤̥̪̬ͅt̮̩͡=̙̻̜͉͕(͇͖̪̩͈̦̭͝(̰_҉̺̖̲t͖̯͈̯=͖͖̦̣E̮͝.͖͡i͉͖̳̳̤̰m̴̙͍̬̰̘p̵̣͈̘̜ḽ͙̳͖͓̩̀e͖̦̟̼͕m̬̦̺̩e̡͙̜̣̰n̪̞̗͍͞t̛̹͕̪̞͖̝a̳̝͞t̲͍͇i̦̗̟̮͔̬̠o̢n̛̩̤̤̤̱̣.̭c̙̺͈͓ͅr̻ḙ̭͓ͅͅa̢͓̫t̮e҉̙̤H͚͈̜͉T͏̲̝͍̰ͅM̮̹L̲̦̣͈̬D̠o̡̰̖̪͖c̴͉̳u͖̩͔̭ͅm̷̼͉̰̳͉͔͕e̶̟̗͉̳͎n̝̖t̨̩(̣͍͈̮͉̜" ̦̲̳̥ "̥͕͙̰̠́)̸̩.̧̹̩b͖o̙̤̤̩̠̭d͎͔̪͕̺͔̝y̷̭͓)̞̼̙̳̳.̗͚̯̱̜i̬͇̮̗̞̙n̝̺͍͓̙̗͞n̲͓̭͈̣̭̼e̬̗̹͓͘r̻̠̦ͅH̨Ṱ͎̲̙̮M̝̫̣̪̙͞L̴̩̣=͇̯͕̳̰̱ͅ" ̜̗ < ̨f̲͕͈̪ọ̥r̼͔͖͖͢ṃ̧̯ > ̤͚̪ < ͇̰ / ̹̜̖̝͈͡f̫͔͕̜͕̻͘o̤rm͖̬̣̩ > ͎͙̭͚̞̮̦̫̯̤ < ̪͓͇͍̗̩͇ / ͔f̯͘o̭̘̭͓̖r̯̺͉̝̟m̡ > ͚̼̠͝ "͝,̳̀2̰̹͓̘͙=͉̞̗̱̙̪̞=̲͙̬̭͢=̶͕͙̱͚_͎͓̙̮̠͝t͙̤̻͔͎.̟̬̰͇c̭̪͉͓̠̗h̶̙̠i̱̻̜̮l̘͙͙͠d̘̼̣N̮̹̝̞̦͓̬o̧̩̩̭̞̦d͔͖̮̼͚e̯̘̗͈̼̭͠ͅs̗͙͉̙̩̯.͟ͅl͖̫̦̝̜͖e̸̝͎͇n̬gt̞̝̜͍ͅh̺͈̹)̠̼̹,̬̠̗̩͚S.҉p̟̣͝ą̬r҉̥̝̦seHT́M̠̫̤L̘̦̭̹̮=̥̠̹̕f̜̮͖̫͈̘͍u͈̝͟n͏̘̩̯ͅc̞̞͓̺̲̭͝t̫̲̟̻͚i͔̥̗̣o̭͔̱͘ṉ̟͍̼͇̮͔(̟̻̫ͅe͚̗̖̫̬,̠̜̭̖̣̥͖t̶̫͔̳̰̬̘,̺͈̫̬͕̞̜͞n̶)͟{r͍̙̼͚͢e̬t͖̰̞ṷ̫̲̱̙̀r̴̬͉̠n͢" ̳̪̲͍s̴͉̰̞̭̙͙tr͖͎̥͖i̤͕͙̜̜͢n͍̻ǵ̪ "̪͟!̶̳̥͖̤̳̘͍=̬̝t̛̲̻̰͔y̳͢ͅpe̡̖̩̗̰͇̫of̠ e͎?̡̬[̷̭̩̠̠̯̹]̴̪̗̮:̪̣͚̖͙̩(̻̱͝" ̗̞̟̖͚b̦̹̮̹̩̙̺̕ò̺̠o̴̦̦̟l͡e̟̖̜̬͓͓a̢̭n̖͕ "̛͉͎͕̘̝=̩̘̪=̘͈͙t̞͠y͕͎p̮̠̫̮̫e͍ò̹̙̰̝̜̬̫f̞̟̲͍̭͇͝ͅ ҉̲̤̹̯t̢͔̺͍&̷&͍͈̟̪(̖̮̼͙̤͚n̳̪̺̣̞=͚͕ͅt̝,̞̰͖̙͚t̠=̧̦̜̻ͅ!͈1͉̲̰̫͇͇)̠͇̻͉,̵̣̫̞̬͎̦t̬͇̤̥̤̱͎͘|̱|͝(͡y̴̬.͓̟͖͍c̱͕̹̺̭̙͓r̖̤̟͖̭ea̲̠͚͡ṭ̸̠̭e̱̟H̟̰͖T̶͍͔͔̯M̺͕̙̟L̮͙̟̼̥D̢̙̱̤̮̬͙͈o̹̬̖̣̠͟c҉͖͈̺͉u̦͇̞̭͠m̮̻̖͕̪͈e͕̗ṇ̺͍͎̺̮̩͟t͝?̗͚͠(̹̥̯̩͚̣̀(̥͖̝̳̬͕̻͜r͏͎̱=̫͕̰̕ͅ(͚͙̣̣͇̺t͍̩͎̣͈͎̟=̨̙̰͕͍E̮̺͘.̣̖͖̼̭i̟̤̙̺m̯ṕ̺͍͓̜le̗̗̮̹̱̘̗m̮̱̖͇͚̼ͅȩ̖̫̱ṇ̞̯̙̻͓̠t̷̯á͇̟̥t̵̲̻̭̫i̯̜̜͍̩̰o̘̣͙̱̱̜̳͟n҉̤̙̼̥̞̮̺.̀c͍͓̲͢r̷̲̭̱̭̯͚̹e̵̜̫̙a̜̹̺̬̫t̢̹͉̫e̦H̺͚̤̖̟T̺͍̲̘M͓͟L̠̤̯̰̮͔D̤̮͝oc̛͓̺̭u͙̼͕̪̺͝m͓̹̠̬̤̱̮e̡n͙̦͔͖̖t̴͕̹̱ͅ(̪̖͔̀" ͏͕͓̖̞̘͍ "̣̺)̯͎̳)̺̮̫̬͙.c̖͕re͎͞a̝͎͕̯t̤̰̠̪͡e͔̟E̶̖͖ͅl̼͈̬͘ḛ͔̝̮̗̮͝m̧̯̜̪̖ẹ̸̪̮ͅṉ̥̭̩͖͉͔͡t̹͔̺̫̹͜ͅ(̷͎̣͉̲̣͈" ̴̦̻̱͉͍b҉̰as̹̯͖e̛̙ "̖͍̬̼))͍̺.̤h͖̙̙̻̝̜͢r͚̭̹̺̱͍̞ef̱=̙E͕̺̤̞̤̦͡.̱̤̰̖̼ͅlo̺̻̯͈c̤̕a͕t̷͕̗̩i̞̳͞o̵̤n̬̼͙͎.͇̼̜̯̼h͕̲̭̫̠͔̳r̦̖̜͇̙̦ḙ̢f̳̫̝̦͔͙͖,̛̳̗̞͓͇̲̱t̗̻̳̪̺͙̖͡.̹̩͔̫̱h͇̣̭̝̮͍eḁ̗̲͕͍͞d̙.͔͎̱a͖͝p̘̦̝̩̀p̯̟e̮͝n͎d̸̤C̨̩̠h̙̲̝il̥̤̲͚̠d͓(̴̘̝̖̝͚r̳)͇͈̤̝)̼̳͓̹͡:̤t=̩̜͖̥E)̲̹͎̹͜,̧̳͍͚͍o̟=̨̞̯̻̮̪͙̱!͕̪̼̪n̩̰̥͖̰͚&̡̣&̥̠͉͇̫ͅ[̛͙̮̱̦]̶͔̝͕,̷̱̞̣ͅͅ(̶̹̞͓̬̭̮i͎͓=̜͉̯͈̣N̡̰̰͎.͙̩͙̭ͅe̲͕̪̰̙x̲̖̹͓͉͖͘é͕c̦̭̥̙̖̩͍(̺̭e̗̗̥͍ͅ)̼̳̳͡)͏?̟̪͙̝̙̰[͍͡t̴̙͚.̷̯̠̦c̜̯͍r͈̜̺e̠̞̟a̦̹̞t̺̠͓̪͔̺̟éE̛͖̠̞͈͚l̺̜͖̘̞ͅe͏͚͇m͓̱͉̝̙e͕̰͈̝̬̘n̷̫͙͔̼̰t̩͡(̥i̭̥̮̘[̬̠̪͖̬̦1̼̹͝]͈̖̝͚̩̕)̺͠]:̗̮̝͙̕(̞͞i=̞̳̖̞͕͚xę̗͇(͓̙̜̣[̬̤̤͇͘é]͉,͔̪t̼͓̼̯,̻͕̼́o̷̮̯̟̖͔̼)̝̹̲̲͇͉͉͢,͏̯͚̬̰͇̼ͅoͅ&͚&̨̰̻̙̻̣͇͉o̼̳̺̘͇.̯̫̲̖̻̖̤l̤̱͕̗e͏̞͍̟n͎̺̭͔̯ͅg̺̱͠t̨͚̲̯̟h̳͕&̢͍&̳̜͇̩̪̹̳S̜̮̥͙͍͙̠̕(̺̣͎͎͍̗o̸̯͉͇̱͈)̨̟̮̰̠̥.͔̳̻͔ͅr̨͖̫̜͈ḛm̢o̗̯̠̹v͖̳͚̳͟e̪̼͉̱͉͈̬(͔͢)͙͇̝͙̮,̛̥̭̭̩̝̟̪S̜̬͈͍.͏̠̣̼̞m҉͕̤̰̩̟̼e̜̼̘̦͎͠ͅr̕g̨e̟̤̘̘͟(͖̬̭͚͕̫͠[̬]̣̣͔̫̀,̲̼̙̟̩̹̙̀i͙̩͈͖͖.͈̰͙̥̮͔̝c̫̙h̥̻͝i҉͙̩̯̘l̞̜͇̬̳̲̕ͅd̫͓̣͖N̘͘o͢d̗͓͉ẹ̛͓̼s)̨)̗̘͍̫̩)̴;̴̜͖̼v͓a̪̼̼͔͉̪̖͢r̪̖̤̘̰̟͚ r̬͈͙ͅ,̡̖͇̪͈̗͓i̛̥͉̣,̧̜͚o͏̣̙}̘̮͇̀,̩S͈̭͙͉̻͝.̞̺͟f͜n̰̱ͅ.l̥̙̬̯͕̞͎o̶̮͕͚͈͍̮͓a̛͓̜̺͇̣̺d̵=̡̖f̼͞u̲n̴̟̰c̜͙̱͙̞̳̲t̺̖̠͙̖̀i̶͓̲̻͕on(̙̘̟̯e̫̩̞̮͈̺̮͠,̛̰̯ṯ̰̪̻,̶n͔̺͉̣)͓̬̺̜̠̯ͅ{̳̫v̤͎͚̼͘a̶̝r̥͕͓͙̣͝ ̹̪̬̪͓r̬̩̤̟̜͍,̸̙̱̥̥̞͓̠i̤̕,̞̼o̢,̸͙͔a̩̮̠̰̼͘=̴t͕̳h͕͠i̙̝̼̤̠̠̙s̛̼̼,̢s̶͈̣̫̠=̩̰̤͖ͅe̘͔̖̗͘.͇͙̫̟i̮͓͖͢n̵͇̻d̼̬̭͖͘e̠̣̘x̩̯͖̻͕̣͜O̲̻̬͖f͍̪(" ̘̗͖ ҉̞ "̘̩̻̖̳͠)̴;́ṟ̰̥͎̰͚͡e̱̩̕t̶̟̩ṵ͚͉͉́r̜n͚̙-̡̗̟̮̯̬͉1̵̰̺͍͖͔ͅ<̶̟͉̟̥̭̯s̥̺̖̀&̳&̺̰̻̯͞(̙̦̹̼͠ŕ̝̟̩̩̹̗̱=͎h̠͚͎̮͠t̮͎͖͈͢(͖͈̹ͅe҉̤̹͔̖.͉sḷ̯̱̲͙͍i̼̖̰̩c̡͕e̲͝(̸͉̪̰͙͇̟̳s͏̜̮̼̥̼̮̖)̩͎͢)̗̱̠͙̳̖̱͞,̡è͙͇̭͕̯͚̙=ę̤.s͉̣̻͇̭̜̦͘li̖͔̤c̤̰̗͔̩͔̪ḙ̷̹(̺͍͉0͖͙͕,̱̪͖͓̰̘s̸̝̟͎̜̻ͅ)͍̘̩̮̣̤̭͟)̡̣̮̼,̛̞̥̦̳͙̩̥m̷̤(̮̼̩̰̭͜t̗̠)̥͚̮?̩̹̟̯̼(͔̱͎͍͟n͇=̩t͉̘,̺̪̮̪̹ͅt=͉́v͔o̶id̜ͅ ͚̹̻̱̰͘0̖͎̬͚̕)͇:͉̱̤̰͉t̘̩&̨͙̙̟͕&̗̞̩̭͙͠" ̸o̭b̜̟̙̜̹j͙e̡̮̠̟̗̫̼c̤͈̲͔͚͡t͏͖̞ "̱̳̲͕̼̮==҉͔t҉͇̖̬̼̝y̙̟̪p̯̘̙̘̝̮͘ȩ̺̜̤̙o̹̙̻̯̗̫͢f͠ ̸͇̭̙t͙̻̮&̟͡&̦(̱̰͓̯̘͢i=̼̻̥̠͉̪" ͔͙̪͕P̝̺̥̮̹̲O͇S̗͓̰͜T͖͉̪͔̟̀ "̹͈͘)͚,̯0͡<̬̬̺̜̻a̻.̜̞͉len͍͈̞̹g̤͇͓t̬̘̣̦̘̠̞h͔̙̮͝&̛̥̫͈͕&̧͖̥S͞.͏a̬͔͔j͇͠a̬͙̲̩x̜̪̥̗̺ͅ(̣̮͔{̴̬̱̲ṵ͔͙r̲̮̮̜͍͚̤l͙͔̘:̜͜e͙,t̮͎̜̬̝͞y͡p̥̼͎̩͈ȩ:̸͕i̸̗|̩͚͎̥̮̱͚|͚̖̺̞̖̘̺" ̧̲͕ͅG̶̟̟̮͎Ḙ̗̰̻̜͕̻T̞̤̞̼̤ "͙̬̹̲̩͓̫,̘̺̣͖̖̤d̵̯̦̠a̺̦̞̞̘̼̳t͇̺̫̘̤̞̀a̗͖̺̫̞͍̥͠T̬̀y̻̳̜͖͟ͅp̡͔̜̱͉̘͖͓e:̛̘̩͕" ͉̞̜h̛t̠̪̤̤͎̟m̩̟̘̳̙͎l̵̦̲͖͎̪ͅ "̟̲̠̙̱͔,͕͎̭̼̦̀ͅd̖̝̬̮͖͓͖ḁ͇̮̙̲̪͟ͅt̬̮̦̱̙a:̡̥͇̤̪̪t}͎̜̘̞̪̩̹)̵̱̮.d̖̬̜̺̜͔͠o̹͍͉̩̰͠ń̲̗e̻̰̲̼̹̰(̠̱͝f̘̫͎̼̪̫u͕n̵c̦̱̲̟̥t̩̲̗̻i̞o̴̥͖͉͕̺ͅn̢͈͇͓̞̠(̙̟e̞̮̺̫̹͉)̘͕{̸͚̝̺͉̬o̡͕̜=̷͈̮a̡͈̪̗r̘̦̕g̮͇̣͕̖̣ư͚͚̙m̜̭̬e͚̻̹n̜͍̲̯̬̭̕t̶͚̫͙ș͔,̞̲͉̤a̫͚̘̪̖̳͎͡.̛h̤̤t҉m̫̮̝̀l͈̗͞(͎̰r͏͎̯͇̜̳̺?̩̠̞͙̗̮S̞̟̤͇͈͞ͅ(̞̻͇̼̯͖" ̗̩̝̕ < ̪d͖̫̖͎̜͙̳ị̝̹̞̼͡v͘ > ̴͔͍̹̤̖ "͙̻)̲̮̣̥̞̜̕.̥͙͝a̠̥̹͚͇̣ͅp̹͘p̡̜̪ẹ̞̱̗̺̠̰n҉̮̯͔̟̬̫̟d͏̼̜̪(̹̤͍͙͇̼ͅṢ̺̹̤.̕p̶̜̦̺̼͍̩̝a̟͖̟̘̜̺̩̕r͍̙̝̘̮͘s̥̝͓eH̪͕͇̝̪̟͠T̶̤M̩̯̯̗̤ͅL̻̥͙(҉̖͔̬̝e̦͉͝)̟̹͉̱͢)̴̞.̛͔͖̲̜̮f̳̤̣̟̦͡i͍̼nd̗̯̰(͇̭̕r͈̜̫̖̝͝)̮͈̱͍̝͟ͅ:̶͈͙̮e̞̣͎͕)̝͔̖͍}̸͕͉̼̼̗͎)͍̗̖̘͍̱̀ͅ.̢͇̯̯̫̠̘a̵̺̲͎̺̪͙l̫̯͉̺͚̬̱͠w̵̰a̷͙̻͎̤̦̤y̩͖͎̳̟̥s̟͉̲̬͓(̡n̨̥͇͈̘͇&̬̯̱̬&̻f̙u̲͈n̘̘̜̳͈͇͇c̪̺̲̞̭̳͟ͅt͖͉͜io̤̲n̬̭͈͎̺̻(͖̹͕̫͡e͖,͈̠̬̥t̯͖̮)̩͇͇̖̯͍̝{̮̫̼a̡͓̫̬̣̹ͅ.̧̞e̹͍͚a̺̦̹c̩̝͢h͏͚̠(̘̕fu̬͚̝̼͝ńc̶̖̩ͅͅt̟̮̜̜̠̮͜ͅi̷̼̩̺̜̘̤̦o̢͉̝̹̲̗̣n(͔͉̯̠)̮̖̫̲͉̹͎͘{̬̭̠̦͙̤͇ṋ͉͢.̸̩͔̗͎͇̳a͎̝̯p͏̬̭͕̬̱p̫͙l̺̻͞y̺̺̭͉͢(҉t̤̝̙̩͕̜ḥ͔̼̦̹́i̹s̠͕͢,̴̹ͅo̫̦̠͙̼͚̹|̫̫͎̳̱̠|҉[̼̺̘e.̬̜͖͙̙̠̘r͏̤̝esp̗͕͙̹̳̻on͕͈͘s̲̤̝̟̖ͅe̞̘̼̠͈̹T̴͉̣͈e̴x̭̺͝t̗͕͓̱,̗̳t̷,e͓̹̜ͅ]̥)̰̦̤͍̼̝̮͠}̱͎)̸̟̦̞̜̪}̬̞͉̱̝͇͉͘)̭͙̗̥̟͉,̷̱͈͔t͇̲h̺͚̹̖̪̠į̰̳̰s̛̲̼͍̻̰̣ͅ}̲̣ͅ,̙̼͔S͚̖̜͎̺̬͚.̵̭̳e̡̺̣̥̜̪x̥̝̬̠ͅp̡̰͓̥r̭͡.͓͘p҉͕̫̰̜̫s̢e̷u̵̟͉̺d̙̗̟os̲͖̭͙̠͉.̷͖a̪͉͚̜n͔͔͉̭̞͙̳͜i͉̟m͞a͔̬̱t͍́ḙ̺͖̰̪̺͙́d̦͉̗̦̼̯͍=͓f̻̮̘u͙͎̜̱͚n̗͕̤̣̠c̮̺t͉̰͙̪̖̺ḭ̦̫o̶̥͈̳͕̩n̸̻̘͍̳̝̗̯(͖͖̼͔̙͍͠ͅt̯̮͙̠͇)̲͜{̜͙͝r̤̥̻̖et̞̕u̗̤ͅͅr̘̱̻̤̖n̶̰̠̜̳̳ ̗͕͚̠S͙̰ͅ.͚̕ģ̟r̹̼͈e̸̯̼̗̙̰p̗̼̥̬͖̼͡(̧S̱̹̻̥.̭̠t̻͙̖͕̗̯i͕͓͚͓͈̩͟m̲͉e̯̹̪̼͙̦̳r̡͓̦s̛͔̱̝̫͔,̼̕f̛̬̲̖u̶̼͇̺̭̺ņ̰̯̱̹͕̰c̞̖͉̗̰͢ti̻ǫ̪̥̟n̪̮(̯̹̬̳̜̝͠e̹̯͕̼͇͙̖)̷̦{̯̻͚͠r͢e̼̭̥t̡u҉̯r̻̪̝͕͝n͔̹̠̬͈̤͝ ̧̙t͈̝̪̀=̜̥̖͓=̥=͚ͅe͎̭͞.̫e͚̲̮̝͍̹͡l̷̗̱e̤̞͍m͞}̡̫̫)̳͔.̯̤̭̺̮̦l̻̖̳͍̠ͅe̻n̝̺̫̩̩̮̖g̬̳͈͍̳̮̣ț̥h}͔̰̫̻̬̟ͅ,̺͙͟S͚̳.͉͎̖͎̮ͅo̫̭͙͖͖̝͢f̜̳̥̠̭͠f̲̫̜͚s̶̻̪̠͕̩̱͈e̻t̺=̠͚͜ͅ{̝́s̯̳͟e̡̬̳̲̝̱̬t̠̲͓̫̻̞̕O͎f̥̭̙̪͈̭f̠̦̠̪̻͘s̷̜e̙̱̫̮ț̫:̧̦f̧͚̝͈͉̩̠u̞͓̖͉̗ͅͅṇ̦̤͇̱͠ͅc̤̫t̠i͟o̱̲͓̖n͉̳͍(͜e͔̯̤͎,̦͈t̮͈͉͡,̹ͅn̡̼̟͓̭)̟̜̠̱̯̝͢{̟v̢̮a̷͓͇̗̠̼͚r͜ ̲͚̮̟̰̠̕r̨͉͔̠͇̥,̘̖͓i̸,̻̥̘̮͎o̖̪̼͎̭,̴̟̦͓̥̩̤a͖͚̖͖͉͈̮,̰s̘̝̹,u̠͢,̛̞l҉̰̠=͉S.̨̼̠̭c̗̦͔͜s̥̭s̙͙̦̼͓̺͕̀(ę,̟̩̼" ̨̗͕p̪̹̞o͈̪si̧͚̮̗̞t̵ị̷̬̜͉̻̦̘o̟̺̭͙͘n̻̠͙̗̞ͅͅ "̩͍)̺̤,̫̭̀c̩̮̺͔͡ͅ=̷̯̼̖͎̹͇ͅS̹̘̮̙̝͓̠(̵͈̼̦̦͉̞ę̺̭͓͇)̹̭̬̘̣͡,f̡͕̩̗̩=͉͠{͘}҉͕̱͙͎̞;" ͍̝̳̩̤ş̺ta̼̟̥̙̹̪̪t̬͙̗̬̬ͅͅi͚̪̘̪̘c͓ "͜=̧̺͔͇̩̲͍̖=̶͓̠̺̬=̤̻͓͔ͅl̪̠̥̥̳&&͜(̗̝̰e.̮͠s̱̺̤̣͘t̪͉̣͍͍ͅy̰͖l̝̮͔̱̩̯e̹͈̻̠.͉̖̩̬̱p͏̹̙͖͕̦͙̻o͈̯̟̼̥s͖̤͈͔̜̰̝i̘̖̗̥̻̘̫t̨i͈͈͇͇o̰n̶̹̘̼̖̲=͖̮" ͏̬̪̣re̯la͕̪̫͇͍͈ți̱͇̼v̲̯e̸̮̜̻̭̟ "̰͔͚͇̥̀ͅ)҉͈,҉̙͔̖͕̞s̷=̼͓͚̕c͕̲͞.o̶͍̺̟f҉̬̱͍̠f̴s̝̖͓̟̝e̮̥̯̲̝̗̥t͈̼̹̲̪̣͝(̱͟)̗̠̳̗͓̭͢,̢̪͙̲̼o̦=̙̪̤S҉.̲͙̜̘̱c̡̞̗̬̱s̟̘̲̞̕s͙̩̘(̵̲e̗̟̘̬͍͇,͘" ̹̮̦̪̫̞̳t̮̮̗͉͙͠o̹͔̱̥͎p̛̯̺͎͔͎ "͠)̨,̪͎̻͕͉̳̟́u̺̝̲=͚̼̹̥͈̘͔S̫͞.̷̖̻̰̬c̨͔̭s̯͓̰s͓̼̣̻̬̟(̷̲̲̲̻̫̪e̮̯̝̥̱,̱̳̞̩̟̫" ͏̞ͅl͉͠e̱̤͎̥̬̼̣͘f̸̞t̖̜ "͞)̦̳,͏̹͇̬̯͚ͅ(̰̜̥̲̼" ̵ạ̮̺̬b͏̣̩̦͕̗̱s̨͈̞o͓̳ͅl͔̮͠ͅu̵̩͉̳̖̙̦̘t̥̩̙e̮̮͍̖͓̕ͅ "̼̝̦͕̘̱͇==͡=̞͍͘l̞͢|͠|̵̟͖͖̦" ̙̪͟f̡̪͎͚̳i͚͍̝͕̟x̱̗̬̗͉͔͍e̛̝̪͙̟̥̭͎d̼ "̷̣̩͓͓̝̫=̷̜͇̠̺̦ͅ=̡̠͓=҉l̤͞)͙̝&̫̝͜&͙̺̼-̷̱̞̳̼͉̟1̸͖̲<̮͔͍̤͎(̸̝̫̯o̗+̭̬͉͉̜͘u͓͟)̠͙̣͓ͅ.̵i͈n͓̯̲̹̞̫d̰͝e̳̹̬̲͔̹̲͝x̟̠̮̭̯͟O̢̹̹̭͓̝̤̗f̬̠͙̫̗(͍̟͍" ̡̤͓̝͚a͔̬͕̝̘u̹̱̱t҉͍̣̠̟̺͚o̞͖̯̻͉̞ "̦̟̳)̟͇̜̱?̛(͈̣̦a̡͎̺͔͍̟̱ͅ=̹̫̙(̪̰̫̼̬r=̪̲͔̬̣c̦̥͉̙.̸͕̰̣p̳̩͓͟o̵̮͉̫͇s̪̜̱̱̕i̵̼͔̞͉͖͚t̰̟̘͜i̼͡o̬͈̳n̶͍͕͖̺̬͙(̸̮̰̠̪͎͕)̲̦̹͎̕)̷͙̙͚̺̙͕.̞͖̱͇̪͎̬͢t͖͇̣̖̟̲o̟p̴̗̮͖,̩͡i̴̹̣̗=͓̯̞̣̬ŕ.̗̥͚l͢e̹f̭̥͙̖̟t̨̘͚̳̬̺)̠͕̀:͖̱͍̳͍(͓͇̮́a̙̰͜=̩͈pḁ͇̞̘ͅr͇͕̩͜șe̩̖͓͈F͇͖͖̰̰͖l͍̹̪̹o̙̫͎̪̯͇̣a̤̰̞̺̳͡t̙(͏͓̠͖̘̗͇ͅo͈̖̣̯͍)̵͉̘||0̱͇͞,̰̲͖̺ị̯̙̯̯̖̣=p̳̭̖͇̲̤̰a̤͓͍̭̺͚͝ŗ͖̜̦͍̹̖s̖̤͇e͎̱̖̖F̠̞͢l̢̼̭͙̖͉͍ͅo̝a̙̲̝̜̘̦͜t̡͕̹͎ͅ(̥̞̼̘u҉̟̲̟͈̦)͙͚|͏̳̭̞̖̝̭ͅ|̹̮͉ͅ0̛̻)̱̱,̱ͅm̧̭͉͔̞(̻t̤̦̙̻͔͝)̧&̡͙&̺(̨̼t̠̪͔̞̰̤̰=̼̥͍̰̤͘t̫̺̻̻.̶͇̫͉̳cal̛̻͈̩̮̟̮l͕(̵̜̳̬e͙̜̲͜,͈̳̳̥n̪͡ͅ,̷̘̹͖͍̮͔S̺̤̲̗͎.͜ex̻̖̜̪̖̮͚t͙̠̤e̜̝͢n͇̗̘̼͚͉̫d͈(͍̀{͇̠̲}̦͎,̬̤̼̩s̱̝)̲)͕̬̘̳̺),̸̯núl̪͘l͉̬!̮̭͕̮̪͔̝=̧̮͔̖͕̤̺͈t͕.͕̥̖͝ͅt̪̠o͎͖̼͈̖͓p̘̭͔̱̱̦̫͢&͖&͎̣̙͡ͅ(̼͇̼̳̬̪͡f̩.̰͢ţ͇̥o̭̘͖p̸̠̥͔̱̰=̢̟̖͚t̘͜.to͖̗̞͞p̵͖͇̤͇̞͈-s̞.̤͎̤t̯̬̤o̳p͔͎̰̜+̯̝̮͉a͈̖)̬̮,̡n͔u̬͉̥͇̠̲̺l̤l͕̱̠̺͓̥͎!̵͍̠̯=͖̜͚ṱ͓̘͡.̬̝̦̬̥l͠e̡̗̪̙̮f̛̝̞t&͟&̗͇͇(͓̟f̭̱̯͚̩͙̗.͇̘͖l͘e̦̯̱͔̺͝f̛͖̙̖t͉͓=̫̟̫̙͓͢t̩̬̠.̭̗̗l̹̭ͅe͕͎͚̗f͎̪͘t̷̘͚̖͉͚̤͔-̦̞̪͚͙̩͉s̵͉̼.̭̀l͖̮̯͓e͇͞f̹̳̥̱ͅt̥̤̹̞+̲̮̖͓̣̺i̞͟ͅ)̺̟̬̹̜̩,͓͓̕ͅ" ̢̘̬͇̲u͇̜s̝͕͚i̷̪̲ṉ̴͇̥̘̘̮g̲̮͢ "̥͈̭̫͇̻i̝̼n̛ ̲̭̠͢ṭ̣̦͔͇ͅ?̛͔̺͓t͙͔̮̰͙͜.̡̭̩u̶̬̯̜̦͎͚s͓̩͘i̙͝n͢g̛̥̥.̗̩͕͖͓̜͘c̦̬a̛̜̻ͅͅl͙͙̞l̀(̴̲̺e,̜͎͎̙f̡̲̜̼̣̘̳)̲:̦c̴.̻̫̬̩c͍̪̀sͅs̲̼̙̭̪͔̰(̕f̸͖͉̺̮̼̳͈)̠̯}͇̱͖͇̠̫̗}͚̤͓̻̩̮̜,̳̗͈S̱͍̗̩͕.̴f̧͍͚n͓̝̺̱͍͘.̳̥͙e̶xt̫̠̤̰̻̘̥ḙ̻̤n̥̮͙̖͞ͅd̗̼͔̭̯͎͓(ͅ{͍̞o͈̟̯͈͡f̳͇̺̤̦̩͡f͖͜s͈͈̞͔̘͜e̘͘t̼̦:f̼̭͓̱u̮̱͇̙̼̙̠n̨̦͇̗̬̠̱̱c̰̩̹̫̟̀t̜̰̹̕i͓̳̘͙̬o̴̤̣͈n͍͕̥̦(̢̦̲͇ͅt)̥͎͙̲̼͝{̝̩͉̝̼̝i̡͇̠̬͈͍̼f̮͇̪̲͇̘(́à͙͉̱̯̼r͖̥̮͖̖͍ͅg̤̝͔̳̞u̧͕̹̝̗͓̺m̳̹e̜̜̙̖n̯͕̞͔͙t̢̞̫̭͎͙̞s̯.̩̗̤̦̯̰̀ͅle͓n҉͉̭̘̲g̮͢t̸ḥ̷͚̯̺̩̣ͅ)͡r͇̱͈͍̠̗͖e̬͈̜̰͔͝tu̷̟̺̝͙̘̞̭r̟͇̩n͔̱̩̱͍̖̫ ̪̖v̟͝o͞i̡͕͖̞͔͍͓̳ḑ̖̝ ̥̣́0̗̺=̡̲=̤͍͓̹̤͕͖=҉̠̲̣̝t̳͝?̹̣͍̮̹̝͔t̳̺̠͇̟̙͠h͎͠i̷̥̠s̡̤̥͖̞̬͓͉:̴̞̘̙̩̟̙t̖̩̖̖̤̱͢h̢̜͇̭̥̞ͅis͕͖̟.̜̰ę͕͇̝̣a̛c͈͙̞h̟̝̪̞͎ͅ(̣͖̲͕̣͔̞f̀u҉̣͔n͚͙̰͓͘c͈͙͔t͖͔̹̘͉̗i̘̖͟o̖̤͉̥̞n̥͙̮͎̠̕(̸̘̲͕e̢̺̝̞̲̠ͅ)͍̟̺͈̪͜ͅ{̜̬̳͓̖̤̗S̖̮̀.͓̞͍̤̟̣͠o͎̜̣̰̠̼͟f̝͚̙͖̹͚f̷͎̟s̮̭̘͍͎͠e̵̜͇̘͖̤̜t̬͙͙͓̯.̠͎̀se̹̹̫͕͙̩͈͠t̸̖̜͔͓̘O͏͖̪̙f̶̱͖̭͓f̜̥͕s͉̦̗e̯̥͚̯̹̪̣̕t̲̯̜͚͇̬͡(̠̺̞̙̺̕t̤hi̠̤̝͕̮̞s͔̜͉̯̞,t͉̠,̲̟e̠)̗͢}̦̩͇̙͕)͟;͔̥̼̮va͚r͟ ̶̻e̡,͡n̠̰͈̠,̡̖̯ŕ͔̬=̬̮̺t̵h̸̠͇̞̲i҉͈ͅs̶͕̺͇͕͖[̳0̟̥]͚̻̻̗̮;͘re̳̩̮̲͜t̸̥̳̼̤̣͖̟u̳̹͔̭̻̟͟rn̖̹ ̡̲̼̥r͖̩?̬̞͙̱r̶̫͖̪̫̗̬.̮̞͜g̜̮̻̹̙̼e͈t̜̝C̪̼̻̯̜ͅl̟̼͎͙͍̩͘i͎̭̜̥̦e̸̗̻̰̘̠ń̞̱̱̺͈̖͇t͈͎̠̥R̖̝̲̳̲̬͔͡e̘͍͓̘c̼͔̞t̰͎̻̲̺̪s̬()͏͇͍.̜̬͇̠̺̩l͓̞͙̞̗͔͞ͅe̗n̬̰ͅg̖̱̗̰̮t͠h̜͕͈͎̝̪?̴̞̙̬͓͓̞(̢͇̥͓e͍̹̗=̷̭r̳̤̩̠̦͡.͈͙̫̩͜ͅͅg͎͜e͉̼̰̘̮͖̩t̛͙̖͚̪̞̪̩B̀o̠̹̼͕͙ụ̮̕n͚̖̗̘͝d͈̘̪͕i̲̮̬͈̟̼͕͞ṋ̛̩͔̩̤g̪͈̮͍̝͚Cl̛͙i̴̹͕e̞̰̗̺͈̘n͈̤̣̜͢t̯͚R̸̠̖̹͎e̸c̳t͜(͙͔͍̬͔͚̭)͕̱̫͈ͅ,̩͈̟͍̲̭͠n̡̜͓̠=̝̖̕r̮̻̜̞.͈͍̯̫̝̤͇o͖̦̦̭͔̯̤w̲͎̲̖̤̘n̩͖͓̜̭͎er̺̥̦̗̰̪̗D͔̘̭ͅo̥͓̘̙c̢̣u̪̭m̪͙͉̺̙̼e͕̟͞n̼͔̲̟͔ṭ̥͍.͙̝̭̪̪͇͎͘d͔̗̯͈͜e҉̮ͅf̱̥̹̦̦̕a̲u̪͍̭͔̯̟͘l̡͇͔͍t̸͓͍V̪i̳͇̼e̴̞͔̱͔̭w͏̱̺͇̭,͎{̙͚̖͎̹̼t̵͙ò̙̼̗̜̞p̸̯̯̱̤̦:͙͝e̥̤̥̹ͅ.̷͓̩̗̟̩ţ͎̜͍̪̠̙o҉͎̝̬͎̟ͅp̳̀+͇̙̯͟n͇.̜̜p͔̗̥̼̠̰͍͜a̘̩̲̳̘͟ge̹̖͍͍ͅY̯̟͓̜O͎̳̖͝f̥̺͕̜̱fs̟̺̼̻e̗̭̮̙̦͚t͓̱̝̥̕,̸̰̠̺̮̘̘l͉̝̠̰̘̖͠ef̵̹̙t͇̥̱̕:̰͓͉̥e̫͇͈̜͔.͔̮̪̮͈͚̳͘l͚̗͇̪͕͔͙e̛͓̬ͅf̢͚̣̜t͎̘̣+̸͚͈̠͇̭͓͔n͈̞̩̫̯̫.̜͚p̟̤̭̩̩͞a̭̬ge͓̥̣̭͓̗̕X̖̭̠̺O̟̙̘ff͏͎͎̫̺̹̟̟s̖̣̮̰̮̘͘e͔̞̘̘̤̱t͝}͜)̷:̤̘̟̬̹͍{̦̖̬t͈̙̙̣́o̶̹̼͙p:̰0҉̱̜͚͓̞,̪̕l͙e̥̘̥̲f̭̩̪t͏:̡̼͉͈͎0̗}͔͍:͓̣̠v̦͇̤͈̜̗͡ͅo͝i͔̹̳̻͍d͍̳͈̤̱̬ ̦̰̙̺̮͇0̛̣͎}̛̼,po̠̮̹s̭̮̳͙i̭t̙͉̺̝͎͝ͅio̹̟n̴:̣̭̰̩̟̺̹͢f͚͓̯̙̤̖̼ụ̶̭͉̤̹̯n̮̩͇̘̬̰c̹̳̳̗̬t͚̹̫̳i̦̰͕̟o̯̮̖n͓(͔̳͍̩)̼͍͇̻̤{̰͖͙͉̭i̤̦̥̖͓̭̲͝f̪̤̤͉̩͠(̤̘̟͖͇̙͜t͍͙̱̫͖͎̼h̬͍̰̯͈͟ͅi͚̰̟̗s̢[͈̯͈̹ͅ0̺̗]͉͈̘̗͓ͅ)̧̣̤̯̻̜ͅ{̨va͏͎͎̘̟̪̟r̶̹̳ͅ e̫̜̱͔̦͟,̫͚̞͍͎t͙̰̩͝,̼̺͕̱̪͈n̶,̜͓̻͖͖r͏̱̯͍=͍̪̙̳̬t̜̼̤̮̮ͅh̴͎͍͓͔̹͕i̥͈̙͢s͏[̳̹̩͕̰0̨̺̙̣̠̜]̨̲͍̜̘̰,͟i҉̪̖̩̳͇̯̟=̶̪͎{̘͝t̛͙̯̲͈̤̘͙o̥̜͔̺̤̖͙p͍͓͈̝̟:̮̣̹0̜̥͔͎,̵l̲̭̪͢ͅe̪̘͈̩͉̥f̘̹͕̤ț̗̳͈̥͔͓:̩͖̱̼̗͞0̥̤͖̫͚̦͘}̪͉̘̝̥̭͜;̢̠̳̭̳ì͇͙̣̰̩̗f͔͔̯̙͓(̞̘̲̰" ͇͕̩͔̥̠ͅf͇̣͉͔͡ͅi̵̱̤͓̫x͖̩e̱͖͉̥͔d̜̱̻͞ "̲̦͙̳̼==̨̩̯̮≠̩̜̻̱ͅŚ̙.͈̕c̢͈͍̺̮̟s̠̦͈̳͙̰͖s̨͖̖̰̦̯(̺̙̮̫͇̱̞r̥̠̯̗͇̯̦,̩͉" ͏̥̣̞po̠̬̩͙͙ş͇͇̮̭̦̰i͍͈̭̖̼͡t̻̠̣͔̦í̗͖̣̗o̰̱̖͎̼͇͝ͅn̻̯͕ "͇̠͕̩̘̣)͙̬͈͈͓͔̜)̝̮̭͔́ͅt=̝̯̺r̛.͎g͎͔̩͍͔ͅͅe̝͈t͘B̹̜̭̖͎̼ơ̻̳̰̻̘͔u͙̮̣̩̟̱n̛̥̹͇ͅd̺̹͙̮͎̗i̢̯̩̞͙̱n͚͇̪̻̪̝͚g̰̤̙̪͇͎͇C̱̪l̴̜i͇ḙ̜̺̼̖̣n̩͖͕t̬͕͖ͅR̨͔ͅe̗̬c̵̻t̸̝̻(̲̪͈)̪̦͖̼̳͡;͏e͇̯͖̥̳ͅl̻͉̼̯͍ͅs̤̭̞̟͓e͚͓̱͓̖{̻͙̖̮̜̱ṭ̶͚̭ͅ=͔͈̣̜̹̼͘t̛͙̯̩̤ͅͅh̢̖̤̙̘̬i̥s̩͙͇.̹͚̥̬̪o͔̠͜f̘̗̼̹͉̖f̙̳͈͡s͞e̴̪̥t̀(̭)͈̖͚,̤̙̖n̜̣̗̤̬≠̰͙̳͕r̠.̢̪͓͉̝͖ͅo̦͖͚̥͈w̵̰n̙e҉͎̲̳͉̺̙̬r̭̻̙̜D̦͎͚͈̱o̠̹̹̭̙ͅc̟͕̝̤u̡̪̺m̫e̺n͔͖̗̙̖t̰̲̟̞̬͉̮,̷ḙ̶̣̬̰̟̼̥=̥̝̕r͔͙͈̤͉͔͜ͅ.͓̟̮͙͔ͅo͈f̯̳f̮s̜̪̳͔̩͓̘et̝P͓̳̜̹̺͔̥ą͍r̷̙͈̫̯ḙ̝̬͖̰̲ͅnt͢|͉̞̬|n̘̦͈̟̙͟.̥͟d̳̫̦̗͇͎o̵̬͇c̻̩u̪͍̗̥m̢̪͈en̴͖͎̟t̞͙͔͇ͅÈ͉͓ͅl͖̜͖e̹͎̙͎͓m͖̫̖̫̯̰͚e̛̞̖̮̫̮͕̜n̩̼̦̺̯͖͙ţ;͚̳̟͉͙ẉ̝h̰͚̖̻͚̤i̼̫̹͓͘ĺ̗̦̣̞̝ȩ̣͕̺͕͙̲͍(̧͉̟̖͇e&͚̞̰̣͎̫͡&(͖e̼̘̖̤̯͎̮=̞͞=͟=̮̰̳̗̟̰̰n̹ͅ.b̨͙od̩̪̫̰̰͍̪͜y|̟͙̩̠͎̙͖|̳̙e҉̥̩͔͖̠͈=͙̰͔͈̜̰̪=͓͕͖̱͓̩͖≠̣̮̳̹̰̦ͅn͓͎͔̭͇̣̠.̰͙̼̥̕d̞̙̭͔̺o̸͙̳c̰͎͔̭͉͞u̖̱̜̱̜̯m̧e̼͉̤̹n̫̤͡t͖E̟̞͓̤ḽ̙̪̳ͅe̵̗̤͈̳̟m͖͕͕͍͎͡e͉͔ņ̞̮̬̖̯̩̫t̸͈͙̲)̞̲̘͓̰̱̞&̼&̹͕̳̯̬̘̝" st̹̘̥a̺̩̘͎ͅt͟i͈̳̩͕c̖̤͓̹͚͚͘ "̰͈̪̖==͞=̶̙̪͔̭͉S̼.c̤͍̺̖̱ş͇̹s̹̬͍͖̤ͅ(̸̗̞̦̠͕ͅe͎̥̖̮͢,̯͉͙̜̪" ҉̘̪̖͕̪͕͍p̛͎os̬̲͔̼i̭̼͍t̨i̵̬̤̩͇o̱̠̫̹̕ͅn̡̗̤ͅ "̪̭͎͉̟͚̫)̳̦̟̤)̵͕̖̪̩̣e̛͎͕͔̥̗͖=̠̠͔͟e͚͇.̛̟̫̟̥p̞͖̪̲̩̥͈͡ar̢̗̻͍é̪̗̣̳̫n̞̼͕̮͙̬tNo̳͚̫͙̖͇d̷͓̹̤͔ȩ̟̭;̰͕̬̖͎e̗&̴̻̭̳&̞̺̲͓̰e̩̮͜!̫͉͈̕=̷̺̟=̰r͖̟̟̩̝͞&̩̹̠͍̜͎͘&̣1̮̦̞̕=͉̯̣ͅ=̩̱̮͈̩͇́=̷̪ę̲̲̙͚.̢͎͎̻̥̘͇̯n͢o̵̯̘̼͖ͅd̙é͕̖͕͓T͍̳̘͇͎̼͖y͈͇͓̬̦̼̘͞p͉̪̣e̢̫̞̩̻̘̝̗&̘̬̗̻̰̀&̸̮̠͎̝͙̱̙(͎̺̜͉̭̺͓͠(̩̞̜̟̳̙̩̀ḭ̻̭̯̳̤=S̬̩͕͔͉̯͞(̧̜̩͖̭͇̱e͏͎̪)̤̠̼̫̭̕.o̩̟̘̺̯f̨͔̟͓͈̪̱̖f҉̼͎s̶̱̤e̴͎͇t̟̭̳͎(̰̗̤̣̺)̭̲̰̤)̰̺̞.̬̫̦͕ͅto̢̟͔̩̮p̦̰̜̦̼͈̝+͎̥̗=̦̘̦̮̮̞͜S̛̻.̡̘̹͖̱͙c̗s̢̹̳͙̙͇s̭̭͞(e͕̦͇̼ͅ,͈" ̯̠͇̬̗b͜o̴͎͍̙̬̣̟̣r͍̩͎̟̘d͓̘̖̮̮e̖̞͕̖̦̮ͅr͙͞T͏̫̥o̤͍̱̗̭pW̲̪͍ͅi͡d̡̬̲̯̺͍̩th̙̘̙͔̝̩ "̼̖,̝͔͍̟̟͇͡!͇̪͚0̧̺̱)̶̦͉̹͈͇͍̫,̠̥̺̹̮̤͜i̜͍͚̹͎ͅ.̬̗͟l͚̘͈̩̲̪͖e̯̭̯f̖͟t͎͖̼̟̯̟̀ͅ+̼̮͕̟͎̮=͚͙S̰.̘͍̣̦͎c̮͚̥̥̘s̲̪̯̳̟ṣ̲͈̟̤͇̮(̙̤͔̀e̸̘͍̝̳ͅ,͖̳͙̼̳" ̳̭͉b̭̱͙̹̺̱͇o̷͙͍͎r̵͔̭͕̯̠d̨e͖̱͙̼͚͟rLe̥̞̱̜̟f͚̳͍t̼̼̖̦̮̭͓͝W̬̬̼̤i̠̘̰̠̙̦d͚̜͉̮ṱ̹̞̰̟̼h̸͓̫̳ "̷͎̞,̴!̵͚̙0̲̟̭̥̟͠ͅ)̣̺̹͔̗̭̱͞)̷̬͇}̢͍̣̻̬̥r͇̱͈͇̙͖̗͢e̵̪͉͕t̳̪̮̤̹̣̻ur҉͎̯͓̻n̵̳̺͚͚͇ͅ{̩̘͚̹͎̞ț̗̹̣ơ͚̦̲̞̲̩͎p̘̦͕̜͎͞:t̮͖͍͢.̹͎ṭ̶͔̘͎̥̘o̜̺͔͙͓̠ͅp͉̞͟-̵͎i͈̱̮̹̲.̷̻͓͈͇̦t͔̥op̥̭͉͙͈̙̳-͇͔͕̞̬S҉̭̳̝̮.͡c̼̱͔s҉̝͍̠s͔̯̹̠̦(͔̰̳̯r͏,̘̞̜̩̟" ̪m̨a̗r͟g͚͉̼͎͎i̸̙̱̯̼̺n̞̭̪͍̖T̵̼͉̗̙o̹͈p̶̜͍̣̜͓͙ "̯,̩̬̞!̯͔0̮)̡͍,̖̞̪̦̜̹l̯̹̱̪̪e̴̳̘̹̥f͓t͉:̹̠̙͍t͕̹͕̻͉͚ͅ.̗̟̩̯̬̲͢l̺ef͈̪̙̭͘t̼̭̤́-̦̳̣̥i̤.̢̦̻͉l͍̠e̼͔̲̝͖͕f҉͎͙̬͉̮͎t̥͡-̙̠S͕͡.̤̣̫͈̥̣c҉̼̼̫̞̞͇s͎̳͍͍s̡͖̲(͡r,̻̳͖͔̫" ̖̝̮͕͙͕͘m͉a͚͍̦̞̳̞r̢͕̝g̺͙̖͙͉͔͜i̶̺̲͉n̸͙̻L̀e͉̥̱͓f̜̻̖t̼̼̳̲̲̖̫ "͔͔̤͍̪̥͟,!͝0̱̟̟̞̕)̤̼̙}̞͇͉}̶̦̥͙̤},̮̞̭̳͉o͖̱̳͉̘͔f̖̫̪͕̹̺͔͟f̘̭̯̩͍͎̥͘s͟é̩̖̰̘͙̱t̸͓Ṕ̺̘a̴̝̜r͖̫͖̝̖̠e̬͉̰n͙t̴͉͉̣:͕͞f̧͚̥u̱n̸͈̯̻ct̥̤̣̝͉͠io͍͠n͓̫ͅ(̭)̙͙̜̻{̱̦͚͇͚͉͡ŕ̰̳̼̰̮̤e̝͍͖̩ͅt́u͙̬̮̪̤ͅr̺͔n ̗̱̰͙̖t͙̬̻͔͎̮h͇̹̦͘i͉̤̗̟̫̜ͅs̴͓.ma̠̞̭̱p̰̠̳̳͔͡(͇̞̝̣̘f̼͝un̬̻̣̟͖͠c̀t͠i̭on҉̲̯͕(̶)̞͉͎̣̜͉͡{̤͕̤v̺̘̖͈̫̮͚a̷̼̙̤͕͎ͅr̯͉̯͈͘ ̤e͕͜=̭̖̩̬̤̟͍͡t̰h͞i̲͚̕s҉͍͚.̬o̦̯f̴̳̣̼̺ͅf̼̣͕͙̹͓͠s̖̭̩̬̮e̺̺̰̙̯̗̝t͉̮͙̮̟̲ͅP̢̠͔͕à̹͕̬̙̩r̟̹̻e̪nt̺͔͟;͙̙̤̺͈w͕̫͇͕͓͕̩h̜̪̮̭͉̬̝i̸̥̜l͖͚̥e͏̪͍͇͍͎̻(̬̰̖͔̩e̹͇͟&̲&̺̜" ̣͉̹̱̣͔s͎̦̭̱̭̥̙t͕̬̦̦͔̰ͅa̹͎͔̘̙̰͔t͇͖̟ͅͅi̝̩͈c͓̤͉̭̮͘ "̲͙̣͉̱=̧=̞̹̭̱̟̱ͅ=S̞͖.̹͉c͞s̶̤̭͉s̡͇͈͇͇̫̣̣(̢̞̺̦̼̱͈ͅe̱͔̘̙͡,̖̯̖̝͔́" ́p̝͕̩̘o͖̭̖̼̯͈s͍̺̲̗͕̼̤͜i͇̦͇̟t̘͉̙́i͎̯̥̖̮on̲̦̘̖͈̗̤ "̖̝̞̳̦̥̀ͅ)̸̝̯̠̗ͅ)̮̼e͎͠=̭͚ę̘̣͉̯̣̹̻.̛̳͓̲͕̬̦ͅo͚̰̬̠̹̤̭f̱͔͎fs̳̣̻̜͉̖̙e̙̭t̥̳͎ͅP̞a̬̘̥͉r̴e̥n̴̮t̥̹͇̼̠͡;̫̫̮̟r͇̳̗e͈̞͕t̸̰̯̝ͅu̞̥͚̺̜̕r̝͓̟͙̰̖n ͙͇̻͓͚̫͈͞e̩̫͓̭̥̞͇|̡̤|͈r̳̳̳̘e͕̖͢}̰̰͓̲͚ͅ)̘̠͟ͅ}͓͇̘̪̝ͅͅ}͉)͙̲͍,S̡̬͇.̼̱̮̙̙̠͘e҉͕͕̙͖̬͉͖ą̯c͓͈̕h̛͖ͅ(̘̟͕{̖͚͙͕̭s̙̯̜̺̘̩c̵͓r̙o͈l͈͈͖͕̖͖l̝͓̠Ḻ̬̺͓͔͔̘ȩ͖̪̹͕f҉̝ṯ̭͡:̩̥̤̙̥" ̲̹̮̜̫p̳̳͚͇̲̙a̯͉͙̘͉g̢̺̬̣̻̤̼̮ę̯̬̰̤̝̬͉X̬͈͇O̰̰͟f͔̻̝͕̜̫͙f̖̦̭̖ͅş͖̟̰̣e̶͓̯t̲̬͇̞̳ "̡̮̪͓̰,̪̯̻̹̠s̼̦̬̪c̳̖̬͚̖r̝̲̣͈̹̟ol͙̣̖͞l̖͈̫̬̫Ṱ͈͖͉͉̪͘o͖̭͍͔̪͜p:̞̜̠̩" ͚p͙͈̦̹a̲͖g͉̺̺̟̜͇͞è̗̙YO̲̘͕͈f҉̠̯͔̬͓f̢s̗̲̺̯e̗̤̪̜̥t̶̼̲ "̷},͉̀f̧̞̩u̘̖͉̤̱͕̳n͔c̶̜͎̗͉̜͇t̴͓̖i̘̻̺̱̻̰o̧̺̜̗̙̻͚̪n̮(̨t͍,̫̙̪͓͈̥i̛̭̦͇̩)̟͞{͈̺̞̯̟͜v̰̬a̵̹r̺͍̲ ̺͖̘̰͠o͚̭̝=̻̺͈͕͍̦͡" ̵̜̙͖p̶a̸̹͚͔͉̭̞ͅg̦͕̪̰e͉̜̺̭Y҉̦̹̖̬̗͙̗O͔f͖̻̭͍̫̖f͓͓̳̺̮s͢e҉t͈̪̞͖͈ "͓̤̺͢=͚͍̺̩̱=̢̗̜̱=̳̭i̦̬;̳̰̖̠̞ͅS͙̼.̥̲̲̻f̨̙͚̙͚̣̻̠n̤͖͎[͇͔t͎̰]̨̖̮̯̗̹=͎f̗̭͇̜͉̕u̠n͍̹̫̩͢ͅc͍͉̻̦t̨͚̠͕͙i͚̙o̺̖͖̮͓ͅn(̴͖̜e̛̺̝̰)̱̫́{̙̰͈r҉etu̗̼r̠̫̥̜n̞̯̲̪̗͓ͅ ͎͇̠͎͚̖̱$̙͠(͏̞̱̼̥t͖͖̱̼̤̮h͇̤̟͈̺̰͢ì͇͔͚͇̲͉̙s̩̼̗̩͎͍̳,͢f͖̠̹͎̜̖͇u̡͈͖̫̬̹n͕̭͖͍̦̠ͅc҉̜̥̪͕̙̩̠t͝i̥o̸͇̬̟ͅn̝̬̞̯̣͟(̢e̲̪͕̪͢,̜͖͈̪̹̹t,̹͎n)̰͓{͙͖̥v͕̻̘̣̟͕͎ḁ̙̦͢r̙ r͔̰̼͉͓̙̮͞;̤͙i̟̮͔f͖̹̗̱̻̦͘(̧x̗̮̟͈(͓̬͚̩͖͟e̥̜̫͍̖̩̘̕)͓͍̣̬̘?̙r̢͕̠̞͎ͅ=̛̣̬̞̝̤e̴̱:̫̮͓̗̜̰9̠͖̞̗=̻̺̥̭=̥̲͔̼̣͓̻̀=̺̭̰e.̳n̮͍̯̯̖̦̺͡o̡͖de̵͍̯̮̲̜T̘̘̦̬̣̯y͓͍̖p͏̱̬̟ͅe̦͓̰̘̦̮͡&̞̺̹̟&̰̲̼͘(̙̪͍͜ͅr̸̼̰̥͕̮͈ͅ=҉̞͖̫e̝.҉̝̞̘d̴̻ef̥̯͓a̖͔͠u̼͍̜̖̫̟͠ḽ͕̫̻͍͖͘ṭ̶̠V̰͍ͅi̞͙͕̖̰͚̥e̬̩͕̙͔̭̣w̧̬̞̯̼̘͈̥)͓,̪̯͓͍̣v͏͍̩̪̦o̲id̥ ̗͟0͉̩̣͔͚͟=̹̠̲=̣̱͕͉̻͡=̴̜̤͔̫n͕̱̫)̻̝͉͍͈͕̬r̨e͎̝̮t̩̣̬͉̯u̧͚ŗ͎͓̱͕̠͚ń̟̤̣ ̲͈̺͍r̟̪?̡̩̭̤̩̟̥̰r̹̥̥̥̫̤[̤͇̬̩̀i͍͎̥]̻̮͚:̯̫̼̠̣e͙̰̫̦̲ͅ[̴̺͍͙̺t̕]̸͖̭͈̪;̖̰̜͜ŕ?̞͢r̻̠̥͙.̡s͉͇̙̞̠̣̣c̵͓̣̠̮̙͎̖r̖̦͚o͚̮l͓̤͍̘͖̟͜lTo͎͔͇̦̝̜̲(̦̰͉̤͘o̶̤?̦͚̜̼͇r̸̥̜.̴p̜̘͓̜̫͍̩a̶͖̘̺͖̤̣͇g̨̞e̙̻͇̘͢X̘̤̘O̰͈̬̦̟̺ff̺̙̩̟͕ͅs͓e̢͕̲̳̰̗̥ͅt̷̘:̗̭̩̲n͔͈͓,̢o͉̠?̺̙̞̲͍n̵̳̖̼͕:̧̟̦̮̥r̨̬.͕̙̳̫̰̦͍p̕a͈̣g͖̫̯͡e̦̗̮Ỳ̖̳͇O̝͍̮͢f̛̪͙͔̺͖̺̭f͚͞s̗͢e҉̙̯̤t̘͔̪̫̲̗̹)̹̟̣̘́:̧͉͈ę̻[̢̫t̢͇̥̰̖̭̮]=̘̦̩̙̰̥̭͡n̢̦͍̘͇}̛̯̝̻,͍̙̹̬̻͈t͈̮͍̖,͓̙͈̞͖̗̱͡ę̼̩̦̲͓̼͕,̛̘̹͈̟̱̞̬a҉̲͖͚͚͓̠r̛̲̠͖g͈̺u̺̞̙̰m̟̟̻̀e͕͚n̨͎t̳͕s̟͖̦̲̤̤ͅ.l̩̠̖͈e̞̲̺̭̻̮n͈̝̙g͞t̝͙̣̰̣͓͕͟h̭̩͘)̮̻̙́}̧͚̖͉}̡̪̪̹͚̝)͓̼̦̱̣,̣̫̭͉͉͟S̖̪͉͕.̨̣̗̳͇͇̦e̛̠͍̣̯͕͙a̫̘̭̗̺̯͘ͅc̖̺͠h̹̯͉̳͢([̲" ̢t҉̭o̝͔p "̷̙̺̯̩̯͈,́" ͚͔l͟e͔̺̯f̠̜t "̭̳͕̼͞]͍̟̲̣̰,̜͍f̞̣̱̯̭̬u̼̪͇̣n͈̘̻͓̮͇̙͢c̙͟t̗͡i̖̲̮͔̩̳͝o̧͕͖n̲̭̲͕̮͍̝(̧e̞̩͇̜̘,̵̹͕n̲͞)̵̟̰{̥̥̞̙̮Ṣ̥̺͎.̪̤̩̘̺̞̫c͍͈̪̮͖̣ͅs̹̗̩̠̹͕̻͠s̤͓̖̬̰H͕̞̲͎o̪͔̖̞o͙̯͔̖̩̟̺k̷͙s͙͖[̣̝̮͈̺̠͡n̛̜͍̹̣͙̝̞]̧̯̰̫̘̙=Fe̞͇̣̭̬͍(͇̳̜̭͔̖y̹̗.̥̳̗̯̯̫͜pi̪͙̘͕̹x͓͓͖el̠̞̥̖̗̙P̛͕̞̩o̝̼̬͕̱̳̼s̫͍̼i̞t҉i͚͓̙̬̲̮o̙͈̗̻̫͕n͙̹,̰̺̦͙͍͠ͅͅf̲̠̥̯͉̲͜u̬͇͓͉̥͕n̹͔̣̩̯c͈̯̝̙̗̕t̩̬̮̦̕i̛o̝n̗͕(̝̫e̸̳̭̘̻,̖̺̯͕͢ͅt͎͡)̙̹͇͘{̷̝̟̪͚ͅi̦̤̤͉͕̤͙f̛(̰̬͉̙͔͕̖t̛)̸r͈̺͙̞͟ḙ̘̪̖͞t̡̮͕͚͕͙̱͓ṵ̰̘r͕̦̼̹̭̤̼̀n͕̱̩̳͍͜ ͏̱͇t=̳͚͓W̻͍ͅe͏̯͇̞̪͕̫͔(̰̼͍e͚͞,̟̪̱̠͚̙͞n͖͍͙̣͝ͅ)̛̙,̼̦P̸̘̝̞͓e͔̻̳̺̳.҉͇̩̞̭̜̺̦t̴̯e̹͚s͕̪͙̯̣̣̕t̟̠̘̭͇(̵͚͚t̻̳)̨̣͍̪͉?͇ͅS͍͓(͕e̘̘̺͇͕̩͘)̮.͇͕̯͎̯̦͞p͖̘̥̬̪̩ǫ̹͕̤̤͇͎s͓̜̼̯͟it͏͉̦͔̥͇̩i͉̟͈̠͖o͉̳n̺̣(̝)̟̘̲̼͉̫ͅ[͏̝̙̬͙͖n̖͓͙͘]̟̥̱̺͚̦̕ͅ+͝" ̬̪̲̰̯p̧͙̻̻x "͎͚̩̰̘͓:̟̲͓͉̯̪́ṱ̞͍̩̲͞}͉͙͓͕͞)͍}̛)̻̗̗̮̰̀,̶̲̺̱̻͎S̟̤͝.e͉͈̩̪a̡͖̭c͉̤͙h̤͚͢(̭̮́ͅ{̘̳̖̠H̝̘e̪̪̣̜i̬̪̲̱̫͎͍͡g̷h̩̫̫͚́ṱ͍̖̝̭̥:̸͍̦̘̣̝̩͙" ̤̟̺͇̘h̜̼͕̞̗̝e̵̼̟i̢̮͖̠g̪͓̝͖h̬͡ͅt̜͈͇͓̬̫͚ "̞͜,̷̝͖W̡̤̗̤i̯̺̭d͖͖̫̭͙͔ͅt̢̫̹̤̤̻̙͖h͏̺̙̺̦:̫̜̖̠̻͜" ̛̝̙̫͕̮̖w̥̻̗̙͙͚̦͟i̜͜d͚͍ṱ͍͔̳̟͖̮̕h͍̲̼̲͎ "͞}͇̺̯̘͝,̟̪̥f̷̺͖u̡̘͍̩̳̮n̮͕̼̱̯̫͔c̴ti̟̰͞ò͇͉̤̫̪n̢̻(̼̰̫̗͈̰a,̪̦͙̗̗̬s){̯͉͉̬̯̫S̶͓͓.̳è̲̜̦̙͕a̼̙͔͠ć̮h̝̭̯̻̬͠(̫̺̼̫͔{̫̞p̢̪̱͙̬͇ͅa͉̭͠d̹̫͖͓͎d̰i̠n̷̪̪̝̬̪g̶̟̯͙̹̱:̵̖͎̟̞̰̪ͅ" ̰̗̣̹i͞ṇ̛n̮͡e̯̯r̺͖̝̠͠ "͎͉̹+̛̫̼̜̯a̡̝̹̬̭,̀c̴̠̦on͍̮͖̪͇t̹͔͖̼ͅe̯̱n͚̕t҉͎͍̩̥̪̺:̛s,̢" ͈̮̼͎̻̙̙̀ "͎͈̘̱̥̩:͓͎" ̜͖͈̘͜o͕u͚͕̝̩̩̱͠ţ̫e̷͓̦̥̥̳͎r͟ "̶̹̹̗͉̮͕+̻̤͙̥a̯͔̳͢}͜,̨̘f͇̙̕u̜̹̱͚͇̮n̻̝̹͍̻̤͟ͅc̵̲̲t̵i͙̪͔͙̹͙͈o͎̺̞͕n̠̣̞͡(̰͍̖̜̩̰͉̕r̲̝̹̦͢,ǫ̝̹̠)̸̼̙̥̤͍̯̮{̗̟͍S̯̥̱̙̲͍̕.͈͍͙͙͟f̴̯n̼̙͇͓͞ͅ[̵͓͕̠̠o̶̜̖̥̫]̶̩͖̳̣≠͈̺̩̣̫̲̥f̭̯u̷͇n̨͈͚̣͔̪̳̙c̣͉ṯio̦͚̮̕n̖͇̝̥̗͖͢(͙̹̪̞̖e̢͔̝̤,̱̭͙t̻̗̖̠)͉͟{̘͖̠̲̠̭va̺̱̝̫r ̩͍̙͍̹̺͠ͅn̶̘͔̩̳=̱̜͕̘̝̙͉͢a̭͓̻̜̮͓̕ŗ̼̯̟g̹̣̕ṷ̳̳̠̳͢m͎̖̪̞͟e̬n͚̮t̮̗̹̻̬͔͕s̠̥.̡̤̗̥̯̠̞l̰͢en̯͍͎̜̖̙ͅg͏̰͇̦̯t̙͈͘h&̵̱͕̭͎&͕̼̘̞̙̬̮(̮͎̟r̘̙̣͠|͉̬̮̣̹͜|̷̠̳̫̞̞ͅ" ̤̠̲b̩̙̺͔̝o͇̰̯͈o̡̩̫͔l̲e̠ą̱̝̞̝̜̻n̹̣̯̠̲͖ "̜̦͖̳!̫͓͖=͓̝ͅt̮͓̳̙̳y̷̩̠̦͚̪̟p͟e̢̱o͙͍͇̦f̤̟̱̕ ̯̹͜e̬̫̦̖̤͈̗)̳̳̕,̣͖̟i̷=̹r̦̘͕̟͎͞|̭̹|̲͇̼̲̳͈(͈̙͎̺͝!̮̯͍̼͔̥̬0͖=̣͕̣͉̳̀=̣̙̞͕̱=̵̱͎̻͖e̯̲|̗̣̙̙̟͖|̜͈̲̪͔̠͖!̟̻͘0͓=̤͔==͈̩̪͠t̘͙̙͖͖ͅ?̢͖̜̞͉" ̹͎͈͚̰̜̞m̷a͔̞̦̼̗rg͏̻i̻͍̺̥͉̤n̮̜̦ "͙:̭̖̦̠͞" ̦͎̦͢b̪̥̺͔̲̜ͅo̩r̙͖̗d̳̝̹̫̩̗e̡̘̙r͖ "͍)͕͔̳̫̩̙;͇̞͇̀r̙͎̫e̻̰͙̳̱t̟̫̭͈̰u͓̭͇̹̩͞r̦̭̱̬͉n̡͍̗̜͔̹̖̰ ̨̭̲͙̼̯͚$̰̞͇(҉̝̺͓͍̺͍̺ț̰̣͔h͈̮̲͎̦̯̜i̖̪͉̕s̞̼͔,̦̼fu̶͚͈nct͓͚̰͕i̼̪̺̖̹̰̯on̛̬̳͙̪̳(҉͈e,̹̭t͠,̫̘̭̫̩n͔͇͓)́{̰̗̠̦v̻̠̯̣̠a̞̘͙r͙̭̹ ̮̥̮͔̻r͕̗;̩̫r̸̻̞͎͇͕̗é̪̫t̮͔͍͚̀ͅͅͅu̵̳͔̖r̬̜n̲̘̘̬͙ͅ ͏̙x̢͉̬(͕̗͇̥͝e̮̼̫̰)͚̪͙͔̮͞?̬̞̩̗0≠̫̪̤̹̙̦=͙̙͇̼͇̜͍͟=͈̞̻͘o̶̖̬ͅ.̶̹̙̬͉̯͔i̱̮͉͇͍̱̣n͎̱̠͢d̖̼̱̻̣e̖̺͖̫͝x͈̘̥̮͠O̞̳̗̥̫f̡̯̤̦͖̦̩̳(̯̪̫" ͏̫o̴̯͍͔̼̖ute̳̤̪̪̝̕r̯̰̥̣͉ "̮̙̗͢)͚̖̫̼̟̀?͈̖͞e̞̝̤̯͙̠[̭͙" ͇i̤̫͙͈͎̘n̠̼̪̣͔̰̦ṉȩ̹͙͔͖̥̻r͍̻̙̱ "̪̬+̷͔̥̬̲a̵]̴͚̫͙:̩̬͓̱͇̬e̪̹̠͔̥͉̦.̬̘̬͍̻̥͜d̨͚͍̬o̵c͇̭̯̱͚ù̖̹m͙͓͎̳̣e̼n̠t̵̫.͇̘̯̥̻d͏͔̫o͏̖͇c̬u̼͔͝me̟̖̹̗n̸̲t̥͚́E͔͎͈l̟e̴̳͙͈m̯͉e̪̰̝̞̪n̘͈̗̜t͉ͅ[̵͉͖̲̩̭̰" ҉͈c̘̳̼̙ͅĺi̧e̗n̫̬͉t̵̬̹͈̥͎͕ "̘̺̦̠͚̟̭̀+͏̰͉̪̥͚ą̩̱̼]̤̥:̹̼̥͇9͖=̴̬̤̣̠=̭̘̝̖̰̲̖=ę̮͍ͅ.̥̩̜͚n͉̙̣̰̻̰̜͠o̝̪̟͚de̝͝T̯͔̩̮͍͞y̘̹̜͈̫ͅp̬̫ͅͅe̘̱͘?͠(ṟ̣=̩̞͍͍͟e̷̼͕.̡̲d̷̦̯o̦̫̳̻̬̹̬c̨͙u̧͉m͏͖̺̯ḙ̣̝̳͓͜n̤t͡E͓̤̲l̛̻͕̳̩͕̥̯e͉͍͔̭m͍͝è̝͉̲̗ṉ̼͓̹̖͙ͅt̢͔͉̥̤,̗M̸̲̥̮̯̟̩̦a̷t̺͎̩̗͈͕́h̳̻̫.̫̯͚͍̲m̻̀a̪̩̖̜̮͍x͏̟̰ͅ(̹̀e͍̖͍̲͝ͅͅ.͓̥̻b̭̹̟͇̖̣ò̳͙̰d̙̟̙̯͢ͅy̰̝̙[" ͈̜͓̞̣̰s̠̼̟̥͍̥͝cr̳̹o̹l̜̲̼l̞ "͍+̖̻̭͍̹͎̤a̞͝]̣̺̬,̩͕͚̗̗͚r̨͓̗̦̼̼[͇͈̰" ̶̤̭̠ș̱͈̼͟cr͓͎̻̤̕o̪̮ͅl̛̤͙̦̺l "̘+̧̩ạ̭͟]̸̹̟̻̤,́e̶̪͚͖̼͚̮.̵̳b͕͈͓͚͙͡ͅo̵̥̯̟̬̦d̢̫̣̺̼̘̳y̘̘̮͎̙̭ͅ[" ̠̞̰̖̻o҉̲̫̮̬̠f̭̜̘f̲͖͖̟̘̭̀s̫̥̮ͅę̤t "͝+͇̱̝̘̪͈̹͠a̗̥̰̞͍],̧̗̬̲͍̰ŕ̖̯̮̳[̣" ̩͠of̴͕̜̦̖̻̗f̡̤̫͔ś̹̠e̶͔t̰̮͜ "̟̬͕̖͡+̤̼a̹̝͡],̬̬̣̙̬͉̠͘r̰̞͖̙̬͈͔[̗" ̶̣͚̜̣c̡̰͉l̞͉̟̳͔̯͉i̷͈̫̤͇̟̞̦ȩ̥̤̪n̪͚͢t̡̞̯ "+̴̖͎aͅ]̵)̞͕͞)͓̖̺͍̬̬:̨vͅo̬̣͇̪̯͈i̭͕͙ͅd͏ͅ ̜0̸̘̯̬̲͓=̲̞͍̣̖̫̖=̞̤̬̣͍͡=̭̩ṇ̲͖?̣S͏̯͙̞͉̪̩͕.̧̰̺̜̙͖cs͚͖͎̦͙s̳̟̱̜̦̗̳(͈̼͉ͅe̖̟̣,̜̺̲̠̻t̸̳̣,͔̝͚i͏̪)̛̟̬̯͕̰̲:͈͖̯͎̫ͅS̰͇̗̰̝̣ͅ.̼̻̹̕s͈̠͞t̻̤̪̗̼y̬̮̯͚̭͎̮l̡̞̱e̪͈̠͜(̡̼̙̤̫͈̹ͅe̤̥̗̺̯͎,̛̯͇̱t̼̭͇̘͍̲̥,͎̼̭̦͈̖̦n̕,̟͚̠̻̹̫̮i)͢}̪͡,̜͡ͅs͚͍͕̼͍,̴̱͓̥̗n̻̭̫?̟͔͝e̶̘͓͍:̤͚͙̣v͖̦̝̤o̠̜i̴̪̩̺͓ḏ̙͚ ̭̤͔0̵̭̻̜,̪͙̙̗̥͖́n̞̻̜)}̙̜̞͇͇͈͉}̼̣)̻͉̤̖̲}̩̦͜)̧͇,̯̳͜S͉̙̘̝̣.e̪͓͉̱͍a̹͚̱̦̬c̨͚͖̟̤̹h͉̜̲͟(͕̟̗͔̺̬͕[̯͖̫͓̰" ̙͓̀ͅa̮̯̺͇̫͔j̧̼̗̥̩ax͔̝̹͇͙S̛̱̥̝͙t͍̝̰͓̯͕a̰͈͍̗̖̦r̴̖̮t͖̟̭̞̗͠ "͈͓͔͓̫̜̖,̨̦͎͙̰̠̩̞" ̗͉͎̞͡a͠j̬͕̀ax̖̦̬̮̺͙St̵͔o̠̙͇͢p ",͖" ̵͉̮̼̦̲a̦̼̣̝j͍̼a̤͇͉͖̼͘x͜C̢͈̥̩o͖͓̱̬̥͡m͕̼p̳͎̳̪̲̱ͅl̸̝̖̙̹̯e̪͍͕̩̺̱̫͢t̨̖̭͈e҉̟͙̟ "͍̝̳̞́,̯̪" a͍͕̤̱͎͜j̶͕͖a̞̥͎͘x͏̩͉È͙̝̘̬̥͓r̥͔̘̹̥̺ͅro̰̪͍r̢͚͕̤͇ "̤,̘͇̰̩̥̟͜" a̴̳͔̱j̢̙̦̼̮͕̲a̦̹͉͟ͅx͎̖̗̣̜S͇̭͚̖̙̯̫u̥͓̣c̷̗ce̯̦̙̜͖̱̲͢s͖͉̤͡s̸͖ "̲͙̼̪̫͘,̢̳͎̬̤" ͈̙̮aj̤̗̤̠̞a͖x̶͖͈̤͇͙͔S̰͝e͖̩̘͔ṇ͝d͈̬͖͉̮͟ͅ "̴̖̻̟̝̭̻͓]̸͔̦̬̯͍̟,͈̬̱̦f̭̞͙̗̝͚͖̀u̷͙ń̫̳̭͚͕c̤̟̭̥͇t̹̳̪̘̹̣i̱̱͕̹͈o̶̩̥̪̼̼̜̮n̸̫͕(̱̞͇̘̯e͘,̫̣̩̟͚ṭ̰̻̤̥͍̀)̭̰̦͚̳͝{͕͙͓S.̤f̩̥͜ͅn͖̮̣̭͇[̠̼t̗̬̘͕̳̪̱]̹̗̟͍̪͉̺=͖̻͓̤f̺͙̩͜u̥͉̘͎͔̮̤n̠̰͟c̹̘̣̲t͟ͅì̜̫͓̮͇̪͖o̴͕̻̬̻n̛̥(̭̮̹̙è͙̱)̛͓̤̼̰̟{̛̟̼̘̞͖ͅr̬̩̣e̱̥̺̖̺̤̘͝t̝̼̺̱̖͇͙u̗̯͞r̥̩̬̱͓̖̳͜n̺̲ ̦͙͉̖̀t̨h̩̻̜ì̳͉̼͍s̳͓.̤͎̦̻o͖̣̜̯̼͍n̗̞̺͕(̪̦̹͎͖t,̷̺̙̙̪͕e̝̦̜͍̥)̤̙̫̠̫̪̻͘}̡͍̖}̡̺̖̲̬)̢̣͉͚ͅͅ,͕͇̥̣͢S.̖͈̞͓͚̲͞f̺͓̱̖̥̜͔͝n.̻e̼̭͉̫͖̤ͅx͙̼̫̝̤̘̞t́e̠̖̱̕n̸̟̖̫̘̦d̡ͅ(̶̼͔{͚̫̠̻b̬̜̬̻i͔̺̜͇̼̙͢n̲̤̜̩d͝:̟̰̬f̸̠u͙̰͔̭n̺̖͓̮͍̪c̱̞͉̪̭ͅt̝͔̦͎̦͞ͅi̱̙͢o̞̦̠̱̮̣ṋ̩͉͇(͜e,͏̮̥͕̠̰t͍͙̥̗,̜͜ņ)͡{́re͜ṯ̴̬u̬̥̱̲̼̬̬r̬̝̫̺̮̳͟n ̙͍̖̯̙̪ͅt̼͖h͍͝i̡͍s͕̘̯.͔͔̤͖̰̗͢on͖̺͕̝̟(̲͈͈e̲̜,̮nu͉͓l҉͍̪ĺ͈,̳͚̱̝̜͉ͅt̰͇͖̪͚̭̦,̸̠̖̣͓n̛̪̹͕͎͔)͞}͇̯͇̥̩̘̱̕,̨̝̝̱̱̞u̠͘n̥͓̖b̗i̩͇͙͖̘̟͠nd͙̤̙̬:̙̦͍̦͔̠̺͝f̙͓̣̞̘̪ư̳̣͍̻n̷̫̼̹̻̼̪̳c̳͉̖̦͙̦͢ț̥̘͚̯i̺͙̠͕͕o͖͡n̥(̗̯̦̬͈̦e̪̠͈͙͚̯̣,̖̙̜̮̰t̝̝̭̜̙̻)͏̲̟{̻̠͠r͚̲̮̹͕e͚͠ͅt̶͈͇u̱͢r͓n̥ t͕̹̥͔̯̀h͍i͙͜s̷̼̘.͖͎̜̦̺͍̠o̶̥͓̪̼͓͍ͅf̭̼̥̣̼f͉̟͖̻̦̳͇(͓̰̖̟e̸̼̦͍͈̯ͅ,̶͉̩̪͙n̥͈̗ul̻̤̹̩̹̯l̡͉̯̥̮ͅ,͍̺t̷̜)},̛̫d̡̥e̲͖͟l̰̬͔̹͡e̙̥g̠͉̻͚a̲̬͈t̡̻͔͇̟̦͕e̖̳͍̲̬:̜͇͖̤f̸̖̭̘͍̹͍ụ̴͉̹n̛̠̼ç̻̻t̼̦i͈͔̹̗̟̫ơ̱͕ṇ̼̺̣͇(̛͇͈e̡̟,̟͉̹̳̪t͔̱̱͙ͅ,͓̼̯͕n̯̼͉,̝͙̺̠̱̮̭r͠)̺͍̣̫͠{̨̳̘r͙̝̪̫͈̯͠ͅe͔̪̯̣̦̖̖t̠̹̯̲͕͚̀u̱̯̙͔̳̯͕ŕ̗̯̥̤n̗̼̱͓̭̼̫ ̱̳̻̲̝̤̬th̘̯̲̪̻͢i̘͉̠s̴̗͉̙̫.̲̠o̱̩̯͜n̻̙̭(̪̯̱̟́t̡͕̖͔͈,̶̻̫̬e̹̱,͔̳̤͖͚̤n͏͉̹̫,̝̱͕̺͜r̩̺͍)̮̣̻}̞͓,̦̩̥̖̳̭͎͢u̜̜̯͙̺͘ņ̫͚͖d̙e̞̰̱̥͉̼͓le̟͜g̻͕̜͎̣̥a͜t̖ḙ̼̠:̺̲̜f̯̹̰̼ṷ͚̭ͅń̘͇͙c̛̠̼͓̩̯ț̹͍͞i̙̟̺͖̻͇o̖̱̲̥̯̖̯n̤͍̭̹͚̞ͅ(̻̻̹̲̫̯̤͠e͙̜̯̪̤̝ͅ,̩͓̪̬̣t̻̭,͓͚͈́ṉ̱̯̥)̘̩̱{̰̮̺̣͜r͕̀e̞̹͉͟tu̩͍̦̝r̠̤͓̫n̫̫̦̣̠̻̹͘ ̧̦̰1͖̩̜̺̠̟̥=̬̤͚̺=̧̠̭̣̩̳=̪͎̻͞ar̥g͕̳͓̭u͟m͉̫͇̗̝ẹn̟͙t̟͖s̯̰̫̗.l͢e͇̞̯͢n̥̘̞̥g̢͓̥͍͙̹̙͇t̪h̢̞̠͖̲?̪̰͇͎̙̭t̵͇͇̣h̷͍̳i̵s.̸̘͔̟͚̥̦o̺f̲̟f̦̳(̡̮̰̳͎̜̣e̤̕ͅ,̡̫̪̺̲̼͉ͅ" ̢̝̪̹̥̳̝̩ * ̖͔ * ̟̭̝̹ "̘̬)̪̗͡:̛̤̗̖̝̥̥t̳̙̘̩h̢͉̺̹̺̲is.͏̥̗͇̺̞̰o͎̩̠͍̠͖͜f̡̹̭͍͈f̗̪̺͕̘͎(̰̰t̳͔,e̹̮̹͉͚̜|̫͙̣̪̰͈͇͜|̣̘" ̩͚̝̬̺̝̜ * ̳̜ * ̛͈ "̶̙͚͔,̨̣̮̬n̜͎͖͙)̙͍̹̗̜͔͢}̣͇̭̞,̶̤̟͚̩h͎͖̣͓̟ò̞̪̤v͢ę̳̣̗̖̱̟̥r̟̦̞̙̤:̷͖f̳̪̳͡u͏̣ń͈̤͈͍c̭̠͔̜țḭ̕o̬̱̟͖n̵(͓̤e,͔̺͇͈͖͇̞͜t̤̰̩̟̼̪ͅ)̧{̗͖̲͓̤̺̫r̖̥̳e̮͚̤̦̺͇t͙͜ṷ̩͖͕̥͇r̥͈͍̝̤ͅn̯͙̮̕ ̴̺̳̞̰̬t̝̱͈͍̳̱͉͝hi͍̼s̟̩̦̩͞ͅ.̨̩̙̖m̹͕̬̣ọ̢̙u͕͓̘s̢̤͈͚̮e̙̤͘e̠͡n̙͖̲̱̼̼̹t̵̯͍̗̭ͅe̡r̷̮̙̗̙̯̣(̶̜̜̮ȩ̭̳̻)̙.͍͚͜m̪̤̭̬̱̰͈o̹͕̪u̡̖s͜e̲̯̱͎̥̦̘l̼̣͈̝͞e̺̳͚̟̘̻a̝̝͉̱̦͠v̗̬̩͈̗̤ͅe̗̲̘(҉̟͙̤t͏͙͔͔͓̩̼|̱͟ͅ|̩͠e̷̗̹)̷̪}҉̤̪̤}̘̪̝͙͇̜̣)̘̹̖̱͖ͅ,̨̳S͍͟.̯̣̳̙͕͉̬͜e̷a̝͉c̱̰̥͍̹h҉̩̟͉̖͔̜̺(͎̻̗͕̺̯" ̹b̧͈̭̖̱ḽ̝͇̯͔͜ͅu̘̼͢r̙ͅ ͓̫͕̗ͅf͈̯̯͚͡o̗̭c̶u̡̯̥̩͖̥ṣ̘ ̭̺f̥o̝̳̤c̵u̮̳̥̭͡ͅṣ̮i͡n̸̲̞ ͔̼̩̱͢f̟͍̞̰̹o͕͕͡c͙̹̭̪u̹ͅș̪̻̥̟͞o͡u̹͎͔̣̥͖̺͝t̴͚̯̠̹͙ ̼̖͍̕ŗ͖̺̰e̮̤̗s̴i͈͇͈̝͚z͏e̜̹͎̖̖ ͏s͓̰̞̤̙̤c̤̻͍͔̘̟̰͢r̭͠o̗̗̗͓͚̜̘l͉̳ĺ͕ ͠c̖͇l̛̪̩̪̳̮ͅi͖̱̼̻c̠͚͡ͅk͝ ̢̳d̻̬̥̹b̘̲͉̫̮͚̩͢ĺcl̨̹̲i̳̣̲͈̫̩c͢k̤̤͖͎̘͝ ̦̣͖m̳͈̠͙̺̯o̺͙̖̙͈͚ͅu̘̙̯̘̘̲s҉̠͙̳e͍̣̟̱d͙̻̬̱̪͡o̷̫͔̫̳̜͈̱w̸̭͎n̺̜̤̙ͅ ̰͖͟m͈͉o̶̖̙̻̖̘̥u͖͍̹s̮̮̻͎̩̞͎eu͠p͔̭̭͇̰ ̭̩͓m̳̲̘̙̦̝̠o̺͍̺͚u̪͎s̨̹e̞͕͉͍͕͜ͅm̪̱̝͔͎ơv͔̺̤̪͖e ̥͍͞m̥̞͇o͉̠̣͠ųs̖̭̞̗e̷̲̣͇͍̘̞̝o̦̯̦͇̫̦̗v̨̜͍̩e̟̼̳͙̞͢r͏̻ ̷͕̙̥̞͔m̰̥͎̞o҉̝̻̥͚̼u̡s̙̞̗͖é̳o͟u̴t̼͇̩̘͠ ̦m̰̠̝͉͕͢o̩͙̼͍ͅṳ̵̙̘s̺̗͞e̡̲̪̬ͅe͙̤͚̣̳̣n͔̞t̶̤̲e̙r͍̪͓̬̗̣ ̷̘̺̦̬͕̭m̩̲͈͙̕ơ̠̗ú̠̤̙s̶̜e̲̩̱͈͖͢l̤̜̫̺̤̦̝è̳̠̯̬͎̦a͓̱̼̝v̟̻̱̯̪̙e̫̘͉̝ ̦͚͡c̖̺̘̭͝h̤̭͇̯͢a̸̪͇̗̣͚͙̗n̖͟g̫̗̦̜̹͈̼è̟̭̗ ̰̜̟͉͚͈s̥̲̬͜e̺͠ḽ̫̻̖͈̫͇e̺͉̱͜c̺͙̘͉͎͈t̮͙̹̗̫̫́ ҉̮̬̜͙͙ͅs̢̜̺̰̼̰͇̮u͖̻b͉̮̻̰͉̹͡mit̛͇͔̺̲͖̰ ̻̠̻̙͕̗̦k̵e͎̲͓͔y̞̦̣͕ḍ̰ow͔͕͓͔̠̝n̷͉͚̯͇̮̼ͅ ̯̮̮͚͍̥̮͜ké̫̥̻͇y͉͟p̩̺̫̦͉͝r͏̹̹̣͓e҉̫̬̭s҉s̜̣̯ ̨̥͉̣̯̲̳̩ke̲͠y̶̠u̬̪̱͉̠̩p̜̯ ͏̣̲c̪o͓̱͚̦̝̻̩n̟̜̖̹t̖̞͓͙e̢̖͔̟̜̝x̘̘̦̘̦ț̛̩m̴̪̙͎̯͙e͙͇̺͘n͎̮u̻͉͉̙̯̥͜ "̲̝̪̗̙̲͝.̦͢s̱̤̤̬p̭l͚i̜̞̣t̨̥̮̺̟̭̝(̫̜̰̫̯" ̶͎̙͓̳̲̠̫ ̥̣̥̖͍̫ "͘)͖,͙̖ͅf͉͖̦̖u̴̪̬̞̺͕n̯͚̬̼ͅc̢̟͍͙̹̮ţ̭̱̘i̟̠̼̥̞̺͎͟o̭̦͎n͙̣̪̯(̨̟̳̬̗̪̣e͓,͖̱̝̙n̢̞͉͔)̟̤̺̳͓{͢S̡̻͎̱̙͔̠͓.̰̯͝f͍̗̫͙͉̕ͅn̟[̝̮̬n̖̲̣͍͇̩̣]͕͕̤̥̲̝=̲̭̪͕̰̟͞f̵̙̺̫̼u̦̬̥̙n̡͕̙̩̪̤̬̙c͔̻̺͡ͅt̡̯i̜o҉͈̹̝n̦̱͇͕̻̜͔(̞͎̱̩͙͡ẹ̢̘̙̦̪͚͚,̢̮̫̖̘̝t͕̱̘̕ͅ)̣̭̥̰̪{͚̜ͅr̰͈͔̼̬̤͠e̺̝t͕͇̫̙ͅͅu̠̜̝͕̭̣͉rn̟̦͓͟ ̫͓͖͕̝̖͢ͅ0̝͔̟͔̱͢<̱͜a̳̺̥̪͙͖r͙͚͔̯g̴͚̪̖̗̮͍̯ṷ͙̞̟͜m̛͎̭e̳͎̱ͅn̗̣̥̫͎̲t͞s̯͝.l͈e͇͡n̫͇̭̕g͉̠̤̹̥̻̖t͚͓̭̘̞̦͡h̢͓̜̳?̜̤̀t̝̘̞̭̮̬͖h̹̤̮̬͚i̢̞s̪̲̼.̪̲͈o̡̱n̘̣̪(͎n͚̣͍̭̲̙͍͞,͎̻̰̮͜ͅͅn͙̞͓̰u̘̯͟l̤̙̯̝͓̼l̫̠͖̟̙̳̗,̦̼̼̦̥̯̙e̷͍̺̼,̥̱͎͎̳ͅͅt͇͖̫)͈͍:̣̠͖͟ͅţ̙̰̜h͕͎̣͕͠i̻ṣ͟.͈t͎̠͓ŗi̼͓͖͡g̪͓̪̹̞̖̳̀g̲̺͟e̪͇͞r̷(҉͕̖n)̬͙̣}̬̠}̸̲͎̠̘̰ͅͅ)̛̬̬͓̥;͓͓v͏̲̺̠̞̰a̩r ̷X̦̲̜̖̣̫ͅt̵͉̲̣̙̻=̞̤̝/͇̲̮͎͟ͅ^̲̪̞͇[̞͉̰̼͍̱͡ͅ\͏s̘̪̼̟̦\u̜̮̯F͙͓̥̣E͇̗̘̼̜̗̺F̦̺͎̘̺͙F̵̖̰͚̠̹\̳̻̞͓̤̹͟ͅx̹͍̠̯̞Ạ̞0̮]̨͇̬͔̙̤̺+̟̫̜̞̲̹͢|[̟̯\͚̮̟̬́s͉̗͜\̳̱̪͚͓͞ͅu̖͇̻ͅF̷͔͓̫̥Ȩ̲͈F̖̜̞̮̬̙̼F̰̪͉̹̫́\̥x̖͍̫̲̯̻͎A̷̻͈̦0̰͇̹͇̭̯́]̤̯̯+̬̥͈͇$̥̰͇͙ͅ/̣g̙̺̜̻̹͝;͎̦͔̦̙͎S̞̼̣̦̻̠ͅ.͖͔͈̺͖̟̫p̣̝r͞o̡̤͙̯̞x̛̮y̼̪=̞̞̀f̶u̴̝̠͇͕n̻c̼̯̮͍ͅṯ̮̝̹i̤̲o̞n̸̬(̻̻̲͖̳̞̳̕ȩ̭̪̗̜̟̠,̺̮̫̣͔t̡)̹̜̣͙{̲̙̺̳̳̲̕v͉̮̝̝̖̱a̜̣͓͎̩ͅṟ̜͍̼͓̭ ̵̯̭͔̺͚̲n̡̯̗,͘r̟̰̜̯̬͈,͈͟į̫̫;̪̭̞̬̝͈i̬̻̹͍̦̭̖͜f͓͈̖(̣͈͈͠" ͉ͅs̘̱ͅt̯̘͖̭̗r̴̥i̺̻̝̤n̳͕̣̩̫g "̨͍͓̦̯=̳̥̹̞̻͖=̟̙͟t͚͉̹̬͢y҉̤p̨͙̟̱̠̠̹e̩ó̝͙̤f̳̺̻̪ ̯̯̗͇t̺̳̹͢&̣̳&̸(ͅǹ͈͍=̳̪̯͉̙e͓͚̤[͢t̴̼]͉͔,̙͢t̸̩̲̪̲̦=e̼̞̯͕̝͈,é͍=͕͈̭͓͖n̸̞̝͕)̞͈̻̟̙,̥̘̝̠̳͘m͇̺̼̱͕̠̠(̰͖̤e̖̻)̛̳̟)̧̝̰͇̬̗̭r̖͇̦̼e̬̣̳͚̖͎̘t͍̞̥͔͔͎ú̲̙͉̰̪͈ͅṛn ͈̦̣̙̰̰̰r͏͓̲͖̤=͍͇̬̣s͕̦̙̬̯̺͔͘.̣͔̟͔͜c̝̜͉͇̕a̹̘͕̻̤͡l̶̰̫͎̬̱͍̥l(͉̯̬̹̦͘a̰̰̘͓͇̪r͓̮g̝͚̻̕u̙m̳e͖̬n͔̦t̟s̖̤̳͜,̧̝̹̝̩̗͇2̮)͝,̷̱̻͈(̣̟̖i̝̝͍=҉͚̱̙͔̰̦f̤̲̟̬̟ͅu̟̱̼̦͈ṇ̯͖c͇̗̘̜̟t͉̮̘̦i͇o̦ń̻̝̹(͎̲̟̙̻̫̦){̣͍̣̗̜̫̹͡r̘̩̺͕͡e̬̹t͉͙͚u̷̼̼͕ṟn̵̳ ̷͉̫̭̪͔ͅe͔̦͎͝.̧͉a̢̲̬ͅp̧͕̮p͍̫͡l͍͚̞̙͈ͅy̤̤̰͍͢(̨͕t͖͈̞̣||̘̲t̰h͇̼̱͔̹͎̤͟i̷̯s̞͇̩̼̣̗̞͢,̗̖͇r̸̠͍͍̱̺͍.͕̕ͅc͔̮̕o̬͍n͔̼͔̟̙̼͈c̷̘̬a͈t͖̳̤͔̤̦͔(͔̭͎̮̭͎͠s.͏̯̳͚̫c̭͡a͏̩͓͇̠̤ͅl̗̩̭̹l(̱͕̱ar̼̬g͇̫̱u̘̹̭̠̣ͅm͓̲̟̰̺e̬͢n͍͉̹͡t͓̬̳̥̕s̡̰̲̩)͚̤̦̞͓̕)̤̮̫̗̼͕͠)}̨̰)̹̠̪͚̜.͎͈̺̯͓͇͢g͕͍̣̣u̟̪̮͇͇̮ͅi͖̭̣͓͓͔͢d̘͖̝=̮ͅḙ̶͓.̜͜g̬͇̜͙u̶̗͎̟id͘=̹̻͝ȩ͕͖.͡g͖̗̼u͉i̯̥ͅd̙͈̪̺͇͘|͓|̗̱̜̩̪͍S̩̰̠͢.̰͘gư̯̝̦i͇̝̬͜d̪̯̠̻̝̝+̱̳̙̠+̦̠͎̦̪̲̺,͇͙̮̺͟i̲̤̙͈̜}̯,̦̰̦̝̀S̛̰͍.̲͈͉̥h̭̫̬͠o̯͙̣͔͎l̝d̫͕̫̪͔̥̹Re̛ad̩̳̺͉y̨̫͓̹̦̮̮=̠͈̯f͇u̮nc̡t̖̯̲̺̞̼i̮̯͉̠͎͇͓o͘n͓̟̩(̛̱̥̬̰̥͍e͇̻̙̙̠)͏̜̩͍{̺̺͎̭͈͓ȩ̯̻?̧S̡̱̬̙̳̦̪̗.̬̦͜r̯̹͉͖̞̭̯̀ead҉̰̞͎̝̤̞̣y̵̬̖W̤͟a̻i̺̜̫͓̲t̛͇̞͖̦̖+̧̖͇̱ͅ+̠̥͔͖̝̼:́S.͎̝r̛͕̟̲̥̥̤͚e͝a̪̤̠d̜͍̫̠̱̙͝ͅy͏̘͉͎͎̤(̢̘͔̖!̝͕̦̰̳̯̱̕0̙͎̹͚)̖̹̥̱̦̦̩̕}̜̝͕̪͞,̤̮̼S̘.̜̥͍͇͓ì̯͔̳̱s̵͍̩͉̲͙͚̳A̭̣͇̪ͅr̞͙͎͉̩̮̥r̩̝͉a̻̺̳̲̘͟y̱͙͍̲͔̖=͓́A͇̹̞͓͎̭͔r͎̥̟̺r͙̹̲͟ͅa̡̞͓̜y͟.̦͈̲̦͕͇i̴s̥̩͉̹͘A̲̳̼̕r̴̗̱͔r̪̪̻̬̯̞͔a̳̟y̧̭̯͔,̟̱͈̺̀S͙.҉̜͕͙p͍̤̻̝a͍͓͝r̟̗s̝̭̙e̕J͓S͏͖̹͙ͅO͜N̦̮̠̤̫̖=̼͚͔̖͘J̧͓̤̬S̪̘̩̖̭͇O̪̫͇̦̳͘N̮̻̻.̀p̯̳͚a̧͈̤̥̩͇r̥̗̺s̨̺͚e̗͡,̫S͈͞.̰͡ṋ̩̤o̫̬d͙̟̗ḙ̛͙̭̠̻Ṋ͍͔͞a͎̣̣̬̗ṃ͎͔͚͚̜͞ͅe̼̣̙̮̳=̬̞̱̰͎̖A̦̱͖,͔̺̠̻S̬͟.͖͕̹ḭ̪̗̗̜s͚̲̺͎̻̯͟ͅF̹u͚̭̯͙n̼̯̠͝c̵t̝̤͓̣̲̥i̤̙̩ͅo̸͙̺ṇ͈̪̖̖̘̘=̺̼̼̼m̛͚̣̩̲̖,̹̙͢S̞͙͇̩.̕i͜s̡͍͕̤͚̭W҉̩̠͍̻̱͙i̕n͏̜̦̞͈͙d̯̲̭̕ͅo͕͇͈̮͠w̭=̷̖̞x͏̱̖̣̫̣,̠̳͉̝̗̦̞S̴̭͉͚̞̺̜̫.̜̺͉ͅc̯̙̪̙̰͞a̲͙m͟e͎̺̖ḻ̪͚̪C̟̺̖̪a͇s͎̖͍̰͓̠e̻̻̭͙=͙̰͚͚X̩̩,̮͈̹̥͉͖S͕̣͇ͅ.͙̠͉͠t̹̼̭͎̣͚̱y̶͚̳̤̠p̝̩̗̝͟e̼̪̟̗̟̹=̶͎̣w̴̘͈͈̭̝͕,͔̤͕̤͚̟S.̟̭͚̝͝n̗̻̭͍̫̥o̵̼͎̘w̙̞̹̟͎̮=͏̤͖̟͈͚͎Ḍ̡̦̤͔͔̭̣a̱t̴͍̞͙̩̻̺͈e͉̦̹̭̞͓.͕͖͈͇͍now҉̥͚,̧͍͖̣͚̺͙̗S͠.͢i͙̣̹͔̕sN͏̖̤̺̜̮͙u͏̞̰̘̦̯m̲͎͇̹̹̺̳e̗̥͇̝͈͠r̼̣̖͞i̪͓̳̤ͅc̢͓̘̻̗=͎̦f̨̯̳̪͉̤͈u̸̗̥̮̺̩͎̰n̲̫̮̳c͙t̝̬̲i̷̙̥̺o̯n͘(͈̙e̸͓̱̦̲̞̞)̛̹͔͎̖{̱͕̞̬̬̩v̳͍̮̠a͏̣͇̝̗̖r̺͚̗̖̠͞ ̙̟̰̬t͔͙=̷S̼̬̫̫̥͡.̨̟̙͍͖̜t̻͚̗̹̞̀ͅy̪̼̥͙̰p̗̻͓͝ę̦̞(̖͙̩e)̻̞̞͔;͈̞r̀e̬̪̬̰͉͚t̯̮̠u̬͕̮͈͎̳̹r̘̠͘n̬̺̞̳͔(" ̡̖͎͈̥͚̩ṋ̜͕ͅu̮͉͓m̥b͚͟e̛̜̖͚͚r̛̤͓ "̞͈̮̯̀=̛̝̳̪̰̱=̙̻̜=̶͇͚̥̱̞̘̜ṯ̜̰͕̺̙|͡|̹̞̟͔̯̱" ̲̝͉͍̟͇̙͢s͙͈̲͙̤͉t̢̗̫͚̮̮r̴̝̰̜̹̬͔i̤͖̠̗̟̺nͅg̩͟ "̩̺̟̤͟=̛̳=͉̫=̼͈̭͙̣t̖)͙&̗̘̗̮̳̣&̰̪̺!̜̺̤̺͚͢i̻̤̮̼s̸̝̫̰̫̙N̡ͅa̵̩͚̝͇N͠(̗̫̺̜̪͔̫e̝̺̭̻͕̬̥-p͖͠a̮̝̞͔̫̖r̻̼̩̝͕ş̺̩̰̳̖̬͈ę͚͇͕͉͍̻ͅF̣̺̠̹̗ͅl̶͎o̴̲̥̣a͔̲t̥̺̳͡(̖͕̘͙̺͟ḙ̡̰͉̙̞͕)͔͖̭̳͜)̻͓͙}̠̲̥͖͟,̨̠̹̗͍͇̗S͓̦.t̮͇͔̦͔͍r͕i͠m̰̦͔̥=f̭̬͓ú̪̰̠̥̲̙̻n̗c̲͖̮̖t̗͔̼̼̣̬i̡̤̼̳͇͎o͎̼̤̻͚̱͠n̦̣̺̱͡(̥̫e͍͇̭͇̲̪̟̕)͏{҉̝̮̱̣̮r̸͚̻͕͓͖̪e̮͖̩͈͎̹t̴̳ụ̧͉̭̖r͈͕͚̺͔n͍̻̦̝͍ ̦̞͢n̡̲u̜͟l̼͓͇̟͘l̪͓=҉̱=̙̗e͍ͅ?̤͓̹̹͠" ̨̣̳̮ "̲̥:͎̜̠͢(̤e̫̜̜̯͕̗+" ̖̬͜ "̵̯ͅ)҉̟̟͔̗̣͔.̘̻͎̞̗̳͇r̻̳è͔͍̙͍̯p̛l̦̠̬̟̱̠͚a̯̦c̷̝̝e̵̲̱(̣̘͉̻̘̼̀X̙͇̹̝t̢̬͎̣͉͔,͚̪͍̮̞" ̧ "̭͉͍̪͔͉)̨̣͇}̬,̖̀" ͚f̢ṳ̟̜̦̺n͚̖̞̜c̱͍ͅt͇̣̬̬̻͍̝i͈̙͔̘͢o̠͉͍͇̭̰̣n͉̯͍͉͖ͅ "͢=͏̟͚̙͉̪=̱̮̤t̳̣̗̪̕y̛̬̬͓͓p̸̠̟̜̹̙̝e͏͇̩o̭͉̬̖̠f̪̯̖̲ ͈̕d̴͓̱̭̟̝e҉̹̻̼̟f̩i͇̟̮̘̟̠n̨̦e̯&&͇̻̮̙̩͙̰d̝͇͎̳͈͘ͅe͍͍͔̣͔͟f̞͟i̯͕̙̱̱n̤͝e̡̠̤͕.͎͢a̹͠m̦͓̼̳̘d̝&̣&̷̣d͎͍̻̤̖e̙͇̦f̫̺͚̮̪͞i҉̹̰̦n͖̭͙̫͙e(̹͎̥͉̰̞̹͟" ̠͉͟j̧̠̖͉q͔͉ue͜ŕ̮̥̱ͅy̘̱̦͚͕̦̲ "͖,͕̠͉̜̲̫[̥̗̫̀]̜,̴̫̜f̬̖̼͍̫̬̩͠u͓̪͈̜n̝ͅc̭͉̲͈t̕ͅͅi҉oͅn̕(̘̠̟͍̜͎)̖{̟͉r͇͡e͙̰͕̩͔t̪̹̙̳u҉r̠̥n̴̹͍͍ͅ ̗͈̮͕̳̦͡S͏̭͈̟̠̫͕}̱̳͎͝);̛̩v͇͠a̰̤̼͎̪͡ͅr͕̕ ̢̮̟V̫̙t̴̙̳=̺̩̹̩C͇̙͎̹͔͖̱͘.͍̜͔͉͈j̖̤͓Q̟̤̯ͅu̫̬͈̖e͉̤͟r̸̼͚̥͓y̱̤,̗̱̕G̵̱̜̬̝̪͔t͈̮̳̯͚=̳̤̺C͚̯.̛̫̞̟͈̰$̙;͚̩͓̫͠r̼̖̫͚ͅe҉ț͕̘̫͉ͅͅṳ͕̤͍̝r͈̞̘̘̯̦n͙̙͙͇̰̣͢ ͖̥̗̬̀S̞̘̳.̯̮̜͕͟n̤̺̮ơ͓͇͙̜̻̹̼C̤͙̤̙͔̭̪o͈͇͚̼̰͢n̛̲̭̭̗̦f͢l̼̱͟ḭ̝c̺̣̝͇͝t=̪̩f̩̱̤̥̙̭͝u͏̻̻̦̰n̲̙̥̩̻͈̞c͚͍̟̻͖͖̜t̥͇͔͍̟̭̠͝i͕̻̥͢o̙̬̳̥̦͙̫n̩̭̤͍̙̖͖(͝e͖)̱͕̺{̢r̠̫͝e͍̙̬̭̺t̸̻͚̼̻̫u̱̼͞r͟n̳̞̖͖ͅ ̫̭͎̳͚͍Ć̫̙̻͕ͅ.̗̯͈̪̙͈$͎=̷͖̞͈̹̮͚̞=̝̺̩͙͖=̧̹͉͈ͅS&͍̖̜̘̭&̤̳(͍͔̙̠̭̮C͔̘̮̥̻̱͍.̩̤͕̫͉̳̭́$̛̫=̡͎̖̱̠G̜̰͖̱̲͢t̲͔̱̼̩̮)̸̠͚̝̖͇ͅ,̹̟̰̞̯̫͜e̺̦̗͇̣͚̘&̞͉͓͝&͟C̴͎̙͈.jQ̲̙̥̩̩̮̹͘ṳ͉e̵̖̝͚ṟ̖ͅy̖͔͖͜=̮̘̝͓̮͚̙=̴̹̬͉͚͖̺=͔̗̳̺͙͉Ș̣̮͔͝&̝̤͕̼̺͘&̲͍͇̳͍(C̙̝.̤͎̰̯͠ͅj̻̞̰̘̳͉Q̲̳̩͚̯̭̤͢u̠̱̫̙̭̳͈͢e̵̞̯̱ͅr̸̲y̧͍̝=V͙ͅt͇̞)̢͔̩̝͔ͅͅ,͙̭͙S}̸̹̥̤͙̞̮̱,̼͖͓̖͝" ͔un̘̕d̟̱̥̜̜͚ͅẹ̶f͕͈̤̗i̠͞ne̹͞ͅd͕̹̮̺́ "̛̺̪̣̣̺̯̼=͝=̷̗̞͍̥͍ͅt̛̠̹̻̮̹̱y҉̭̲p̴͇̦̦̮e̫̥͈̯̘o̯̳̼͈̥̗f̞̦̮͖ ̭e̡&̼&͕(̠͔C͉̹̺̼̩̰̞.҉̯͍j͉̯̀Q̜͟u̫̭̖̭̜er͈y̼=̬C̷̮̳̙̠.͏̟͕̘̬͓͕͓$̰̜̖=̴S͇)̞,S̼̣̗̻}̮̰͍̙̣͚)̛͕̲̬̰;̶̲̙̰
                                    ̴̣̗͚̻͓
